

create database SchoolDB
go
use SchoolDB
go

--年级表
create table Grade
(
	gId int primary key identity(1,1),      --编号
	gName varchar(20) ,                     --年级名称
	gNote text                      --备注
)
go
insert into Grade values('一学年',''),('二学年','')
select * from 	Grade				
--教师职位表
create table Position
(
	pid int primary key identity(1,1),		--id
	pName varchar(20) not null,				--类型名称
	pNote text						--备注
)
go
insert into Position values('班主任',''),('语文老师',''),('数学老师',''),('英语老师',''),('体育老师',''),('专业老师','')
--select * from Teacher t join Position p on t.tPosition=p.pid where tid=5
--教师表
create table Teacher
(
	tid int primary key identity(1,1),		--id
	tJNumber varchar(20) UNIQUE not null,			--工号
	tName varchar(20) not null,				--姓名
	tsex varchar(2) ,						--性别
	tBirthday datetime,							--出生日期
	tPosition int foreign key references Position(pid),		--职位
	tTelephone varchar(15),					--电话号码
	tPassword varchar(100) not null,			--密码
	tNation varchar(20) ,					--民族
	tPolitical varchar(20),					--政治面貌
	tid_card varchar(18),					--身份证
	tEducation varchar(20),					--学历
	tHome varchar(50),						--家庭住址
	tNative varchar(20),					--籍贯
	img varchar(50),						--图片
	tContent text,					--内容
	tState varchar(20) default('在职'),				--状态
	tNote text						--备注
)
go		
insert into Teacher(tJNumber,tName,tsex,tBirthday,tPosition,tTelephone,tPassword,tNation,tPolitical,tid_card,tEducation,tHome,tNative,img,tContent,tNote) values('20181001','梁光健 ','男','1999-09-02',1,'13481297235','686868','汉族','党员','452226199909022115','大学毕业','','中国','','',''),
('20181002','余傲旋 ','女','1986-02-20',1,'18373453544','686868','汉族','党员','330821198602201140','大学毕业','','中国','','',''),
('20181003','石泽语','男','1995-03-29',1,'13456443574','686868','壮族','群众','54213619950329649X','中专毕业','','中国','','',''),
('20181004','董寄柔','女','1977-10-11',1,'17485738583','686868','汉族','党员','652927197710114664','研究生毕业','','中国','','',''),
('20181005','刘乐成','男','1993-08-03',1,'17463847395','686868','壮族','党员','411224199308030370','大学毕业','','中国','','',''),
('20181006','史若枫','女','1971-02-27',1,'18476594757','686868','壮族','群众','530111197102272307','高中毕业','','中国','','',''),
('20181007','邓宏阔','男','1970-10-03',1,'17483947533','686868','汉族','群众','130127197010035079','高中毕业','','中国','','',''),
('20181008','潘兴旺','男','1985-12-22',1,'13544545454','686868','壮族','党员','150100198512225014','大学毕业','','中国','','',''),
('20181009','孙弘益','男','1984-07-04',1,'13446565645','686868','壮族','群众','640302198407041918','高中毕业','','中国','','',''),
('20181010','马自怡','男','1990-01-21',1,'15343435355','686868','汉族','党员','440703199001211871','大学毕业','','中国','','',''),
('20181011','秦从安','女','1978-03-02',1,'13435345647','686868','壮族','群众','371425197803025347','大学毕业','','中国','','',''),
('20181012','郑笑卉','女','1977-08-15',2,'16576564544','686868','壮族','党员','431125197708150406','大学毕业','','中国','','',''),
('20181013','杨念云','男','1998-12-04',2,'17853442433','686868','汉族','党员','54210019981204656X','高中毕业','','中国','','',''),
('20181014','陶毅然','男','1987-10-01',2,'13656565534','686868','壮族','群众','440682198710018850','高中毕业','','中国','','',''),
('20181015','胡嘉年','男','1987-03-14',2,'13465767675','686868','汉族','党员','64022219870314409X','研究生毕业','','中国','','',''),
('20181016','尹听安','女','1972-10-01',2,'17454533433','686868','汉族','群众','410301197210013549','大学毕业','','中国','','',''),
('20181017','任安志','男','1977-06-08',2,'13454565545','686868','壮族','党员','110227197706089333','高中毕业','','中国','','',''),
('20181018','夏绿竹','女','1991-01-18',3,'13498009233','686868','汉族','群众','500100199101185521','大学毕业','','中国','','',''),
('20181019','贺从菡','女','1982-12-01',3,'13499924563','686868','汉族','党员','513128198212019645','高中毕业','','中国','','',''),
('20181020','李映安','男','1972-06-06',3,'18777739344','686868','壮族','党员','230307197206068349','高中毕业','','中国','','',''),
('20181021','谢凌丝','男','2000-01-26',4,'17548784344','686868','汉族','群众','42112720000126486X','大学毕业','','中国','','',''),
('20181022','韦思远','男','1986-06-12',4,'13488895433','686868','汉族','党员','371526198606128634','大学毕业','','中国','','',''),
('20181023','孔鹏池','男','1990-03-03',4,'13484878454','686868','汉族','群众','410402199003034196','大学毕业','','中国','','',''),
('20181024','杜元武','男','1982-12-05',5,'18798448437','686868','壮族','党员','420102198212051997','高中毕业','','中国','','',''),
('20181025','彭凝旋','男','1996-10-13',5,'17867656565','686868','汉族','党员','152323199610139162','研究生毕业','','中国','','',''),
('20181026','谭海冬','男','1993-10-05',5,'13445456767','686868','壮族','党员','440901199310053561','高中毕业','','中国','','',''),
('20181027','侯彭勃','男','1980-11-15',5,'18489333232','686868','汉族','群众','650100198011158990','高中毕业','','中国','','',''),
('20181028','闫巧荷','男','1977-01-22',6,'13878574839','686868','汉族','党员','230822197701222367','大学毕业','','中国','','',''),
('20181029','刘夏波','男','1980-09-15',6,'18384783748','686868','壮族','群众','450422198009157582','高中毕业','','中国','','',''),
('20181030','宋觅山','男','1972-08-09',6,'19348343493','686868','汉族','党员','320601197208094604','高中毕业','','中国','','',''),
('20181031','史痴瑶','女','1980-05-21',6,'18743784343','686868','汉族','群众','610300198005216721','大学毕业','','中国','','',''),
('20181032','汤乐欣','男','1977-10-27',6,'13483948332','686868','壮族','党员','430381197710277116','高中毕业','','中国','','',''),
('20181033','魏秋莲','女','1974-05-06',6,'18737439894','686868','壮族','群众','330900197405060747','大学毕业','','中国','','',''),
('20181034','秦夏波','女','1977-01-24',6,'19843893483','686868','汉族','党员','410122197701248669','高中毕业','','中国','','',''),
('20181035','于初蝶','女','1973-12-19',6,'18734734834','686868','壮族','党员','622225197312197947','大学毕业','','中国','','',''),
('20181036','黄怜翠','女','1990-04-09',5,'15895845445','686868','壮族','群众','452225199004099285','大学毕业','','中国','','',''),
('20181037','肖鸿福','男','1981-02-06',5,'19845988498','686868','汉族','党员','331000198102061511','研究生毕业','','中国','','',''),
('20181038','韦元冬','女','1973-12-17',5,'13929907358','686868','汉族','党员','542137197312176863','大学毕业','','中国','','',''),
('20181039','崔巧春','女','1977-06-29',2,'13929913229','686868','汉族','党员','140525197706295603','高中毕业','','中国','','',''),
('20181040','陈若翠','女','1980-08-27',3,'13923153358','686868','汉族','群众','131128198008277521','大学毕业','','中国','','',''),
('20181041','付俊名','男','1977-03-05',1,'13928571568','686868','汉族','党员','41030219770305437X','研究生毕业','','中国','','',''),
('20181042','白波涛','男','1981-09-18',4,'13929919358v','686868','汉族','党员','511001198109180193','高中毕业','','中国','','',''),
('20181043','谭半双','女','1985-06-15',2,'13923188378','686868','汉族','党员','310200198506158746','大学毕业','','中国','','',''),
('20181044','姜学民','男','1988-10-17',2,'13500255808','686868','壮族','党员','230524198810178255','高中毕业','','中国','','',''),
('20181045','周冷之','女','1979-07-18',3,'13929901158','686868','汉族','群众','130731197907181289','高中毕业','','中国','','',''),
('20181046','陆敏叡','男','2000-09-17',1,'13690577772','686868','汉族','党员','420203200009178791','研究生毕业','','中国','','',''),
('20181047','林初曼','女','1979-11-13',3,'13809258598','686868','壮族','党员','330122197911137262','大学毕业','','中国','','',''),
('20181048','陈梦旋','女','1993-04-26',3,'13928520158','686868','汉族','群众','230300199304267143','高中毕业','','中国','','',''),
('20181049','江凝海','女','1977-07-23',5,'13927725878','686868','壮族','党员','41110219770723188X','研究生毕业','','中国','','',''),
('20181050','陶念烟','女','1993-02-19',4,'13690601110','686868','汉族','群众','140110199302199343','大学毕业','','中国','','',''),
('20181051','杨修诚','男','1983-02-02',1,'15088001616','686868','壮族','党员','120111198302025472','研究生毕业','','中国','','',''),
('20181052','吕明志','男','1998-09-06',2,'15728811199','686868','壮族','群众','510701199809066238','高中毕业','','中国','','',''),
('20181053','魏芷容','女','1986-07-03',5,'18823232351','686868','汉族','党员','610625198607034320','大学毕业','','中国','','',''),
('20181054','蒋谷梦','女','1986-07-01',4,'18316811868','686868','壮族','党员','340822198607014860','研究生毕业','','中国','','',''),
('20181055','秦念桃','女','1988-11-28',5,'18316816856','686868','汉族','党员','450106198811283504','大学毕业','','中国','','','')

--select * from Teacher
--select * from(SELECT *,ROW_NUMBER() over(order by id desc) row FROM [Sxcalss] sx join Studentinfo st on sx.stuxh=st.stuId join Classs c on c.cId=sx.sxhbj) t  where t.row>=1 and t.row<=10
----select * from Classs s, (select count(sclasss)人数,sclasss from Studentinfo group by sclasss)t where s.cId=t.sclasss 
--select cId,cName,cTypeName,cGraduated, cGtime,   cGstate,   cTeacher,cPhone,cNote, gId, gName,gNote,tid,tName,cttime from(SELECT *,ROW_NUMBER() over(order by cId desc) row FROM [Classs] c join  grade g on c.cTypeName=g.gId join Teacher a on c.cTeacher=a.tid) t
--select * from(SELECT *,ROW_NUMBER() over(order by cId desc) row FROM [Classs] c join  grade g on c.cTypeName=g.gId join Teacher a on c.cTeacher=a.tid) t
--select * from Classs c join Grade g on c.cTypeName=g.gId join Teacher t on c.cTeacher=t.tid,
--select   cId,cName,cTypeName,cGraduated, cGtime,   cGstate,   cTeacher,cPhone,cNote, gId, gName,gNote,tid,tName,cttime,cou from(SELECT *,ROW_NUMBER() over(order by cId desc) row FROM  Classs s join Grade g on s.ctypename=g.gId join Teacher te on s.cTeacher=te.tid, (select count(sclasss) cou,sclasss from Studentinfo group by sclasss)t  where s.cId=t.sclasss ) t where t.row>=1 and t.row<=10
--select * from(SELECT *,ROW_NUMBER() over(order by cId desc) row FROM [Classs] c join  grade g on c.cTypeName=g.gId join Teacher a on c.cTeacher=a.tid) t where t.row>=1 and t.row<=10
--select * from(SELECT *,ROW_NUMBER() over(order by cId desc) row FROM [Classs] c join  grade g on c.cTypeName=g.gId join Teacher a on c.cTeacher=a.tid) t
--SELECT cId,cName,cTypeName,cGraduated, cGtime,cGstate, cTeacher,cPhone,cNote, gId, gName,gNote,tid,tName,cttime,cou FROM [Classs] c join  grade g on c.cTypeName=g.gId join Teacher a on c.cTeacher=a.tid ,(select count(sclasss) cou,sclasss from Studentinfo group by sclasss)t
--班级表
create table Classs
(
	cId int primary key identity(1,1),  --编号
	cName varchar(50)  UNIQUE,                     --班级名称
	cTypeName int foreign key references Grade(gid),    --年级名称
	cGraduated varchar(2) default('否'),                   --是否毕业
	cGtime datetime,                                  --开班时间
	cttime datetime,                                  --结业时间
	cGstate varchar(20) default('开学'),				--状态
	cTeacher int foreign key references Teacher(Tid),	--班主任
	cPhone varchar(11),								--电话号码
	cNote varchar(50)                             --备注
)
go
select * from Teacher
insert into Classs(cName,cTypeName,cGraduated,cGtime,cGstate,cTeacher,cPhone,cNote) values('141班',1,'否','2017-06-20','开学',1,'18394738493',''),
						('142班',1,'否','2017-06-20','开学',2,'18394738493',''),
						('143班',1,'否','2017-06-20','开学',3,'18394738493',''),
						('145班',1,'否','2017-07-20','开学',4,'18394738493',''),
						('146班',1,'否','2017-08-20','开学',5,'18394738493',''),
						('147班',1,'否','2017-09-20','开学',6,'18394738493',''),
						('148班',1,'否','2018-09-20','开学',7,'18394738493',''),
						('java1班',2,'否','2018-07-20','开学',1,'18394738493',''),
						('java2班',2,'否','2018-07-20','开学',2,'18394738493',''),
						('java3班',2,'否','2018-07-20','开学',3,'18394738493',''),
						('新视觉多媒体',2,'否','2018-07-20','开学',4,'18394738493',''),
						('.NET',2,'否','2018-07-20','开学',5,'18394738493',''),
						('软件测试与实施',2,'否','2018-07-20','开学',6,'18394738493',''),
						('前端安卓开发',2,'否','2018-07-20','开学',7,'18394738493',''),
						('前端全栈开发',2,'否','2018-07-20','开学',8,'18394738493',''),
						('前端PHP开发',2,'否','2018-07-20','开学',9,'18394738493',''),
						('人工智能',2,'否','2018-07-20','开学',10,'18394738493',''),
						('无人机',2,'否','2018-07-20','开学',11,'18394738493','')

select * from Classs
--学生信息表
create table Studentinfo
(
	stuId int identity(1,1) primary key,    --编号
	studentid varchar(20)  UNIQUE,       --学号
	sclasss int foreign key references Classs(cId),          --班级
	sname varchar(20) ,			  --姓名
	ssex varchar(2) default('男') ,         --性别 1:男 0:女
	snational varchar(20) ,       --民族
	sdate datetime ,                   --出生日期
	scard char(18) ,                --身份证号码
	snativeplace varchar(50) ,     --籍贯
	saddress varchar(100) ,          --家庭住址       
	spassword varchar(100) ,           --密码
	sparentsname varchar(50) ,      --家长姓名
	sparentsnumber nvarchar(11) ,    --家长号码
	sface varchar(10) ,             --政治面貌
	snumber nvarchar(11) ,         --手机号码
	sentrancedate datetime ,          --入学时间
	sqq varchar(20),                     --QQ号码
	spicture text,          --图片
	sstate varchar(20) default('在读'),				--状态
	snote text						--备注
)
select * from Studentinfo

-- select * from Position left join(select count(*) cou,tPosition from Teacher group by tPosition)t on tPosition=Position.pid

	insert into Studentinfo values ('0070717000',1,'吴文斌','男','汉','1999-03-22','452629199903221832','广东省信宜市','广东省信宜市城中','686868','吴先生','13790436396','群众','13790436396','2017-06-20','964947876','','在读','')
	insert into Studentinfo values ('0070717001',1,'畅嘉伟','男','汉','1998-06-17','452629199806171832','广东省珠海市','珠海市金湾区金山花园','686868','畅先生','13824132245','共青团员','13824132245','2017-06-20','1175230403','','在读','')
	insert into Studentinfo values ('0070717002',1,'刘志翔','男','汉','1998-11-28','452629199811281832','广东省揭阳市','广东省揭阳市皮凝视池尾街道塔峰','686868','刘先生','13824132245','群众','13923533128','2017-06-20','193660821','','在读','')
	insert into Studentinfo values ('0070717003',1,'张东明','男','汉','1999-12-18','452629199912181832','广东省紫金县','广东省紫金县紫城镇','686868','张先生','13824132245','共青团员','15986033428','2017-06-20','2093128158','','在读','')
	insert into Studentinfo values ('0070717004',1,'李泽望','男','汉','1997-09-20','452629199709201832','广西省百色市','广西百色市乐业县同乐路','686868','李先生','13824132245','共青团员','15322777511','2017-06-20','1650441540','','在读','')
	insert into Studentinfo values ('0070717005',1,'刘风','男','汉','1999-06-10','4526299906101832','广东省紫金县','广东省紫金县紫城镇二中路9号','686868','刘先生','13824132245','共青团员','15077689173','2017-06-20','1293434420','','在读','')
	insert into Studentinfo values ('0070717006',1,'刘铭','男','汉','1998-06-30','452629199806301832','江西省干赣州市','江西省干赣州市寻乌县','686868','刘先生','13824132245','群众','15170746497','2017-06-20','2671626752','','在读','')
	insert into Studentinfo values ('0070717007',1,'钟世杨','男','汉','1998-04-28','452629199804281832','江西省干赣州市','江西省干赣州市寻乌县文峰乡岗背村','686868','钟先生','13824132245','共青团员','13979748040','2017-06-20','1171332001','','在读','')
	insert into Studentinfo values ('0070717008',1,'杜京粤','男','汉','1997-07-19','452629199707191832','广东省普宁市','广西百色广东省普宁市流沙西街道南平里119栋4号市乐业县同乐路','686868','杜先生','13824132245','共青团员','18278578248','2017-06-20','563918504','','在读','')
	insert into Studentinfo values ('0070717009',1,'覃欧','男','汉','1999-08-12','452629199908121832','广西省来宾市','广西来宾市城厢乡','686868','覃先生','13824132245','共青团员','13677722156','2017-06-20','404344656','','在读','')
	insert into Studentinfo values ('0070717010',1,'李云清','男','汉','1997-10-11','452629199710111832','江西省石城县','江西省石城县琴江镇温坊村老虎坑','686868','李先生','13824132245','共青团员','13979794335','2017-06-20','1013084720','','在读','')
	insert into Studentinfo values ('0070717011',2,'龙家为','男','汉','1998-09-12','452629199809121832','广西省象州县','广西省象州县运红镇水寨村民委龙塘村118号','686868','龙先生','13824132245','共青团员','13737207873','2017-06-20','1440203176','','在读','')
	insert into Studentinfo values ('0070717012',2,'陈胜','男','壮','1998-09-22','452629199809221832','广西省田阳县','广西田阳县坡洪镇新景村','686868','陈先生','13824132245','群众','13005768719','2017-06-20','2517778384','','在读','')
	insert into Studentinfo values ('0070717013',2,'夏同鑫','男','壮','1999-02-26','452629199902261832','广西省北海市','广西壮族自治区北海市海城区石子里三巷9号','686868','夏先生','13824132245','共青团员','18777927469','2017-06-20','2862519348','','在读','')
	insert into Studentinfo values ('0070717014',2,'欧一乐','男','壮','1998-03-28','452629199803281832','广西省来宾市','广西省来宾市兴宾区五山乡六欠村委欧村36-1号','686868','欧先生','13824132245','共青团员','13660804719','2017-06-20','2668697130','','在读','')
	insert into Studentinfo values ('0070717015',2,'张敏杰','男','壮','1999-01-13','452629199901131832','广东省龙门县','广东省龙门县马榨镇下龙山口34号','686868','张先生','13824132245','共青团员','13928389292','2017-06-20','435524709','','在读','')
	insert into Studentinfo values ('0070717016',2,'唐玉棋','女','壮','1998-11-23','452629199811231832','广西省桂平市','广西桂平市栋镇开发区83号','686868','唐先生','13824132245','共青团员','15777463501','2017-06-20','1561172137','','在读','')
	insert into Studentinfo values ('0070717017',2,'殷家日','男','壮','1998-12-15','452629199812151832','江西省丰城市','江西省丰城市张巷镇殷家村','686868','殷先生','13824132245','群众','18289720867','2017-06-20','1662666486','','在读','')
	insert into Studentinfo values ('0070717018',2,'李小云','男','汉','1999-02-19','452629199902191832','江西省赣州市','江西省赣州市于都县罗江乡','686868','李先生','13824132245','共青团员','13177796516','2017-06-20','303224648','','在读','')
	insert into Studentinfo values ('0070717019',2,'刘地林','男','汉','1998-04-10','452629199804101832','江西省赣州市','江西省赣州市于都县罗江乡','686868','刘先生','13824132245','群众','18379708359','2017-06-20','3269983308','','在读','')
	insert into Studentinfo values ('0070717020',2,'陈绍雄','男','汉','1998-06-11','452629199806111832','广东省遂溪县','广西百色市乐业县同乐路','686868','陈先生','13824132245','共青团员','13724771756','2017-06-20','649689087','','在读','')
	insert into Studentinfo values ('0070717021',3,'黎军基','男','汉','1999-07-26','452629199907261832','广西省灵山县','广西省灵山县丰塘镇潭龙村','686868','黎先生','13824132245','共青团员','13507775423','2017-06-20','450983626','','在读','')
	insert into Studentinfo values ('0070717022',3,'朱星宇','男','汉','1998-07-12','452629199807121832','江西九江市','江西九江市都昌县阳光花园','686868','朱先生','13824132245','共青团员','18279239511','2017-06-20','150237080','','在读','')
	insert into Studentinfo values ('0070717023',3,'梅宇诚','男','汉','1999-05-18','452629199905181832','广东省云浮市','广东省云浮市郁南县都城镇桂圩罗顺镇罗顺村39号','686868','梅先生','13824132245','共青团员','15398852223','2017-06-20','1147562174','','在读','')
	insert into Studentinfo values ('0070717024',3,'郭世棋','男','汉','1999-06-22','452629199906221832','江西省吉安市','江西省吉安市','686868','郭先生','13970623853','共青团员','13970623853','2017-06-20','370622009','','在读','')
	insert into Studentinfo values ('0070717025',3,'欧健平','女','壮','1998-02-21','452629199802211832','广东省云浮市','云浮市罗定市素龙街道思围村思围95号','686868','欧先生','13824132245','共青团员','18818983530','2017-06-20','818983530','','在读','')
	insert into Studentinfo values ('0070717026',3,'韦邦杠','男','壮','1998-09-29','452629199809291832','广西省来宾市','广西省来宾市南泗乡平田村','686868','韦先生','13824132245','群众','13152624559','2017-06-20','761273133','','在读','')											 
	insert into Studentinfo values ('0070717027',3,'雷胜杰','男','汉','1998-06-17','452629199806171832','广东省珠海市','珠海市金湾区金山花园','686868','雷先生','13824132245','共青团员','13824132245','2017-06-20','1175230403','','在读','')
	insert into Studentinfo values ('0070717028',3,'赵婷婷','女','汉','1998-11-28','452629199811281832','广东省揭阳市','广东省揭阳市皮凝视池尾街道塔峰','686868','赵先生','13824132245','群众','13923533128','2017-06-20','193660821','','在读','')
	insert into Studentinfo values ('0070717029',3,'刘红凌','男','汉','1999-12-18','452629199912181832','广东省紫金县','广东省紫金县紫城镇','686868','刘先生','13824132245','共青团员','15986033428','2017-06-20','2093128158','','在读','')
	insert into Studentinfo values ('0070717030',3,'沈婷','男','汉','1997-09-20','452629199709201832','广西省百色市','广西百色市乐业县同乐路','686868','沈先生','13824132245','共青团员','15322777511','2017-06-20','1650441540','','在读','')
	insert into Studentinfo values ('0070717031',4,'徐奎明','男','汉','1999-06-10','4526299906101832','广东省紫金县','广东省紫金县紫城镇二中路9号','686868','徐先生','13824132245','共青团员','15077689173','2017-06-20','1293434420','','在读','')
	insert into Studentinfo values ('0070717032',4,'王江宏','男','汉','1998-06-30','452629199806301832','江西省干赣州市','江西省干赣州市寻乌县','686868','王先生','13824132245','群众','15170746497','2017-06-20','2671626752','','在读','')
	insert into Studentinfo values ('0070717033',4,'叶丽娜','女','汉','1998-04-28','452629199804281832','江西省干赣州市','江西省干赣州市寻乌县文峰乡岗背村','686868','叶先生','13824132245','共青团员','13979748040','2017-06-20','1171332001','','在读','')
	insert into Studentinfo values ('0070717034',4,'蒋贝贻','女','汉','1997-07-19','452629199707191832','广东省普宁市','广西百色广东省普宁市流沙西街道南平里119栋4号市乐业县同乐路','686868','蒋先生','13824132245','共青团员','18278578248','2017-06-20','563918504','','在读','')
	insert into Studentinfo values ('0070717035',4,'周舒婷','女','汉','1999-08-12','452629199908121832','广西省来宾市','广西来宾市城厢乡','686868','周先生','13824132245','共青团员','13677722156','2017-06-20','404344656','','在读','')
	insert into Studentinfo values ('0070717036',4,'杨嘉欣','女','汉','1997-10-11','452629199710111832','江西省石城县','江西省石城县琴江镇温坊村老虎坑','686868','杨先生','13824132245','共青团员','13979794335','2017-06-20','1013084720','','在读','')
	insert into Studentinfo values ('0070717037',4,'龙家为','男','汉','1998-09-12','452629199809121832','广西省象州县','广西省象州县运红镇水寨村民委龙塘村118号','686868','龙先生','13824132245','共青团员','13737207873','2017-06-20','1440203176','','在读','')
	insert into Studentinfo values ('0070717038',4,'李琳琳','女','壮','1998-09-22','452629199809221832','广西省田阳县','广西田阳县坡洪镇新景村','686868','李先生','13824132245','群众','13005768719','2017-06-20','2517778384','','在读','')
	insert into Studentinfo values ('0070717039',4,'陈宏伟','男','壮','1999-02-26','452629199902261832','广西省北海市','广西壮族自治区北海市海城区石子里三巷9号','686868','陈先生','13824132245','共青团员','18777927469','2017-06-20','2862519348','','在读','')
	insert into Studentinfo values ('0070717040',4,'高相杰','男','壮','1998-03-28','452629199803281832','广西省来宾市','广西省来宾市兴宾区五山乡六欠村委欧村36-1号','686868','高先生','13824132245','共青团员','13660804719','2017-06-20','2668697130','','在读','')
	insert into Studentinfo values ('0070717041',5,'曾小倩','女','壮','1999-01-13','452629199901131832','广东省龙门县','广东省龙门县马榨镇下龙山口34号','686868','曾先生','13824132245','共青团员','13928389292','2017-06-20','435524709','','在读','')
	insert into Studentinfo values ('0070717042',5,'伊文静','女','壮','1998-11-23','452629199811231832','广西省桂平市','广西桂平市栋镇开发区83号','686868','伊先生','13824132245','共青团员','15777463501','2017-06-20','1561172137','','在读','')
	insert into Studentinfo values ('0070717043',5,'徐彩铃','女','壮','1998-12-15','452629199812151832','江西省丰城市','江西省丰城市张巷镇殷家村','686868','徐先生','13824132245','群众','18289720867','2017-06-20','1662666486','','在读','')
	insert into Studentinfo values ('0070717044',5,'王彩霞','男','汉','1999-02-19','452629199902191832','江西省赣州市','江西省赣州市于都县罗江乡','686868','王先生','13824132245','共青团员','13177796516','2017-06-20','303224648','','在读','')
	insert into Studentinfo values ('0070717045',5,'赵湘莹','女','汉','1998-04-10','452629199804101832','江西省赣州市','江西省赣州市于都县罗江乡','686868','赵先生','13824132245','群众','18379708359','2017-06-20','3269983308','','在读','')
	insert into Studentinfo values ('0070717046',5,'吴亦然','男','汉','1998-06-11','452629199806111832','广东省遂溪县','广西百色市乐业县同乐路','686868','吴先生','13824132245','共青团员','13724771756','2017-06-20','649689087','','在读','')
	insert into Studentinfo values ('0070717047',5,'杨一凡','男','汉','1999-07-26','452629199907261832','广西省灵山县','广西省灵山县丰塘镇潭龙村','686868','杨先生','13824132245','共青团员','13507775423','2017-06-20','450983626','','在读','')
	insert into Studentinfo values ('0070717048',5,'王丽婷','女','汉','1998-07-12','452629199807121832','江西九江市','江西九江市都昌县阳光花园','686868','王先生','13824132245','共青团员','18279239511','2017-06-20','150237080','','在读','')
	insert into Studentinfo values ('0070717049',5,'周摇','男','汉','1999-05-18','452629199905181832','广东省云浮市','广东省云浮市郁南县都城镇桂圩罗顺镇罗顺村39号','686868','周先生','13824132245','共青团员','15398852223','2017-06-20','1147562174','','在读','')
	insert into Studentinfo values ('0070717050',5,'韩诗淑','男','汉','1999-06-22','452629199906221832','江西省吉安市','江西省吉安市','686868','韩先生','13824132245','共青团员','13970623853','2017-06-20','370622009','','在读','')
	insert into Studentinfo values ('0070717051',6,'许正一','女','壮','1998-02-21','452629199802211832','广东省云浮市','云浮市罗定市素龙街道思围村思围95号','686868','许先生','13824132245','共青团员','18818983530','2017-06-20','818983530','','在读','')
	insert into Studentinfo values ('0070717052',6,'肖一凡','男','壮','1998-09-29','452629199809291832','广西省来宾市','广西省来宾市南泗乡平田村','686868','肖先生','13824132245','群众','13152624559','2017-06-20','761273133','','在读','')
	insert into Studentinfo values ('0070717053',6,'陈政福','男','壮','1999-01-13','452629199901131832','广东省龙门县','广东省龙门县马榨镇下龙山口34号','686868','陈先生','13824132245','共青团员','13928389292','2017-06-20','435524709','','在读','')
	insert into Studentinfo values ('0070717054',6,'林希愔','女','壮','1998-11-23','452629199811231832','广西省桂平市','广西桂平市栋镇开发区83号','686868','林先生','13824132245','共青团员','15777463501','2017-06-20','1561172137','','在读','')
	insert into Studentinfo values ('0070717055',6,'刘豪','男','壮','1998-12-15','452629199812151832','江西省丰城市','江西省丰城市张巷镇殷家村','686868','刘先生','13824132245','群众','18289720867','2017-06-20','1662666486','','在读','')
	insert into Studentinfo values ('0070717056',6,'王逸','男','汉','1999-02-19','452629199902191832','江西省赣州市','江西省赣州市于都县罗江乡','686868','王先生','13824132245','共青团员','13177796516','2017-06-20','303224648','','在读','')
	insert into Studentinfo values ('0070717057',6,'王晨旭','男','汉','1998-04-10','452629199804101832','江西省赣州市','江西省赣州市于都县罗江乡','686868','王先生','13824132245','群众','18379708359','2017-06-20','3269983308','','在读','')
	insert into Studentinfo values ('0070717058',6,'李佳敏','女','汉','1998-06-11','452629199806111832','广东省遂溪县','广西百色市乐业县同乐路','686868','李先生','13824132245','共青团员','13724771756','2017-06-20','649689087','','在读','')
	insert into Studentinfo values ('0070717059',6,'徐丽云','男','汉','1999-07-26','452629199907261832','广西省灵山县','广西省灵山县丰塘镇潭龙村','686868','徐先生','13824132245','共青团员','13507775423','2017-06-20','450983626','','在读','')
	insert into Studentinfo values ('0070717060',6,'王丽婷','女','汉','1998-07-12','452629199807121832','江西九江市','江西九江市都昌县阳光花园','686868','王先生','13824132245','共青团员','18279239511','2017-06-20','150237080','','在读','')
	insert into Studentinfo values ('0070717061',6,'李舒婷','女','汉','1999-05-18','452629199905181832','广东省云浮市','广东省云浮市郁南县都城镇桂圩罗顺镇罗顺村39号','686868','李先生','13824132245','共青团员','15398852223','2017-06-20','1147562174','','在读','')
	insert into Studentinfo values ('0070717062',7,'黄景挥','男','汉','1999-06-22','452629199906221832','江西省吉安市','江西省吉安市','686868','黄先生','13824132245','共青团员','13970623853','2017-06-20','370622009','','在读','')
	insert into Studentinfo values ('0070717063',7,'孙慧','女','壮','1998-02-21','452629199802211832','广东省云浮市','云浮市罗定市素龙街道思围村思围95号','686868','孙先生','13824132245','共青团员','18818983530','2017-06-20','818983530','','在读','')
	insert into Studentinfo values ('0070717064',7,'许嘉','男','壮','1998-09-29','452629199809291832','广西省来宾市','广西省来宾市南泗乡平田村','686868','许先生','13824132245','群众','13152624559','2017-06-20','761273133','','在读','')
	insert into Studentinfo values ('0070717065',7,'吴金英','女','壮','1998-02-21','452629199802211832','广东省云浮市','云浮市罗定市素龙街道思围村思围95号','686868','吴先生','13824132245','共青团员','18818983530','2017-06-20','818983530','','在读','')
	insert into Studentinfo values ('0070717066',7,'曾燕玲','女','壮','1998-09-29','452629199809291832','广西省来宾市','广西省来宾市南泗乡平田村','686868','曾先生','13824132245','群众','13152624559','2017-06-20','761273133','','在读','')
	insert into Studentinfo values ('0070717067',7,'胡丽萍','女','壮','1999-01-13','452629199901131832','广东省龙门县','广东省龙门县马榨镇下龙山口34号','686868','胡先生','13824132245','共青团员','13928389292','2017-06-20','435524709','','在读','')
	insert into Studentinfo values ('0070717068',7,'王银珍','女','壮','1998-11-23','452629199811231832','广西省桂平市','广西桂平市栋镇开发区83号','686868','王先生','13824132245','共青团员','15777463501','2017-06-20','1561172137','','在读','')
	insert into Studentinfo values ('0070717069',7,'陈晓瑶','女','壮','1998-12-15','452629199812151832','江西省丰城市','江西省丰城市张巷镇殷家村','686868','陈先生','13824132245','群众','18289720867','2017-06-20','1662666486','','在读','')
	insert into Studentinfo values ('0070717070',7,'李文琪','男','汉','1999-02-19','452629199902191832','江西省赣州市','江西省赣州市于都县罗江乡','686868','李先生','13824132245','共青团员','13177796516','2017-06-20','303224648','','在读','')
	insert into Studentinfo values ('0070717071',7,'吕雪艺','男','汉','1998-04-10','452629199804101832','江西省赣州市','江西省赣州市于都县罗江乡','686868','吕先生','13824132245','群众','18379708359','2017-06-20','3269983308','','在读','')
	insert into Studentinfo values ('0070717072',7,'张楚翔','男','汉','1998-06-11','452629199806111832','广东省遂溪县','广西百色市乐业县同乐路','686868','张先生','13824132245','共青团员','13724771756','2017-06-20','649689087','','在读','')
	insert into Studentinfo values ('0070717073',8,'李如','男','汉','1999-07-26','452629199907261832','广西省灵山县','广西省灵山县丰塘镇潭龙村','686868','李先生','13824132245','共青团员','13507775423','2017-06-20','450983626','','在读','')
	insert into Studentinfo values ('0070717074',8,'林晓艳','女','汉','1998-07-12','452629199807121832','江西九江市','江西九江市都昌县阳光花园','686868','林先生','13824132245','共青团员','18279239511','2017-06-20','150237080','','在读','')
	insert into Studentinfo values ('0070717075',8,'向玮鑫','男','汉','1999-05-18','452629199905181832','广东省云浮市','广东省云浮市郁南县都城镇桂圩罗顺镇罗顺村39号','686868','向先生','13824132245','共青团员','15398852223','2017-06-20','1147562174','','在读','')
	insert into Studentinfo values ('0070717076',8,'吴绮维','男','汉','1999-06-22','452629199906221832','江西省吉安市','江西省吉安市','686868','吴先生','13824132245','共青团员','13970623853','2017-06-20','370622009','','在读','')
	insert into Studentinfo values ('0070717077',8,'彭静','女','壮','1998-02-21','452629199802211832','广东省云浮市','云浮市罗定市素龙街道思围村思围95号','686868','彭先生','13824132245','共青团员','18818983530','2017-06-20','818983530','','在读','')
	insert into Studentinfo values ('0070717078',8,'徐燕','女','壮','1998-09-29','452629199809291832','广西省来宾市','广西省来宾市南泗乡平田村','686868','徐先生','13824132245','群众','13152624559','2017-06-20','761273133','','在读','')
	insert into Studentinfo values ('0070717079',8,'白莲女','女','壮','1998-02-21','452629199802211832','广东省云浮市','云浮市罗定市素龙街道思围村思围95号','686868','白先生','13824132245','共青团员','18818983530','2017-06-20','818983530','','在读','')
	insert into Studentinfo values ('0070717080',8,'王为成','男','壮','1998-09-29','452629199809291832','广西省来宾市','广西省来宾市南泗乡平田村','686868','王先生','13824132245','群众','13152624559','2017-06-20','761273133','','在读','')
	insert into Studentinfo values ('0070717081',8,'张得民 ','男','壮','1999-01-13','452629199901131832','广东省龙门县','广东省龙门县马榨镇下龙山口34号','686868','张先生','13824132245','共青团员','13928389292','2017-06-20','435524709','','在读','')
	insert into Studentinfo values ('0070717082',8,'孙成红','女','壮','1998-11-23','452629199811231832','广西省桂平市','广西桂平市栋镇开发区83号','686868','孙先生','13824132245','共青团员','15777463501','2017-06-20','1561172137','','在读','')
	insert into Studentinfo values ('0070717082',8,'唐丽','女','壮','1998-11-23','452629199811231832','广西省桂平市','广西桂平市栋镇开发区83号','686868','唐先生','13824132245','共青团员','15777463501','2017-06-20','1561172137','','在读','')
	insert into Studentinfo values ('0070717084',9,'丁冬芹','女','汉','1999-02-19','452629199902191832','江西省赣州市','江西省赣州市于都县罗江乡','686868','李先生','13824132245','共青团员','13177796516','2017-06-20','303224648','','在读','')
	insert into Studentinfo values ('0070717085',9,'孙立军','男','汉','1998-04-10','452629199804101832','江西省赣州市','江西省赣州市于都县罗江乡','686868','刘先生','13824132245','群众','18379708359','2017-06-20','3269983308','','在读','')
	insert into Studentinfo values ('0070717086',9,'张虎豹','男','汉','1998-06-11','452629199806111832','广东省遂溪县','广西百色市乐业县同乐路','686868','张先生','13824132245','共青团员','13724771756','2017-06-20','649689087','','在读','')
	insert into Studentinfo values ('0070717087',9,'张亮','男','汉','1999-07-26','452629199907261832','广西省灵山县','广西省灵山县丰塘镇潭龙村','686868','张先生','13824132245','共青团员','13507775423','2017-06-20','450983626','','在读','')
	insert into Studentinfo values ('0070717088',9,'贾大林','男','汉','1998-07-12','452629199807121832','江西九江市','江西九江市都昌县阳光花园','686868','贾先生','13824132245','共青团员','18279239511','2017-06-20','150237080','','在读','')
	insert into Studentinfo values ('0070717089',9,'王亮','男','汉','1999-05-18','452629199905181832','广东省云浮市','广东省云浮市郁南县都城镇桂圩罗顺镇罗顺村39号','686868','王先生','13824132245','共青团员','15398852223','2017-06-20','1147562174','','在读','')
	insert into Studentinfo values ('0070717090',9,'刘涛涛','男','汉','1999-06-22','452629199906221832','江西省吉安市','江西省吉安市','686868','刘先生','13970623853','共青团员','13970623853','2017-06-20','370622009','','在读','')
	insert into Studentinfo values ('0070717091',9,'李军','女','壮','1998-02-21','452629199802211832','广东省云浮市','云浮市罗定市素龙街道思围村思围95号','686868','李先生','13824132245','共青团员','18818983530','2017-06-20','818983530','','在读','')
	insert into Studentinfo values ('0070717092',9,'何晨','男','壮','1998-09-29','452629199809291832','广西省来宾市','广西省来宾市南泗乡平田村','686868','何先生','13824132245','群众','13152624559','2017-06-20','761273133','','在读','')
	insert into Studentinfo values ('0070717093',9,'马飞','男','汉','1998-04-10','452629199804101832','江西省赣州市','江西省赣州市于都县罗江乡','686868','马先生','13824132245','群众','18379708359','2017-06-20','3269983308','','在读','')
	insert into Studentinfo values ('0070717094',10,'陶非凡','男','汉','1998-06-11','452629199806111832','广东省遂溪县','广西百色市乐业县同乐路','686868','陶先生','13824132245','共青团员','13724771756','2017-06-20','649689087','','在读','')
	insert into Studentinfo values ('0070717095',10,'杨家奋','男','汉','1999-07-26','452629199907261832','广西省灵山县','广西省灵山县丰塘镇潭龙村','686868','杨先生','13824132245','共青团员','13507775423','2017-06-20','450983626','','在读','')
	insert into Studentinfo values ('0070717096',10,'向春艳','女','汉','1998-07-12','452629199807121832','江西九江市','江西九江市都昌县阳光花园','686868','向先生','13824132245','共青团员','18279239511','2017-06-20','150237080','','在读','')
	insert into Studentinfo values ('0070717097',10,'成小均','男','汉','1999-05-18','452629199905181832','广东省云浮市','广东省云浮市郁南县都城镇桂圩罗顺镇罗顺村39号','686868','成先生','13824132245','共青团员','15398852223','2017-06-20','1147562174','','在读','')
	insert into Studentinfo values ('0070717098',10,'孙丽丽','女','汉','1999-06-22','452629199906221832','江西省吉安市','江西省吉安市','686868','孙先生','13824132245','共青团员','13970623853','2017-06-20','370622009','','在读','')
	insert into Studentinfo values ('0070717099',10,'张小磊','女','壮','1998-02-21','452629199802211832','广东省云浮市','云浮市罗定市素龙街道思围村思围95号','686868','张先生','13824132245','共青团员','18818983530','2017-06-20','818983530','','在读','')
	insert into Studentinfo values ('0070717100',10,'李敏','女','壮','1998-09-29','452629199809291832','广西省来宾市','广西省来宾市南泗乡平田村','686868','李先生','13824132245','群众','13152624559','2017-06-20','761273133','','在读','')
	insert into Studentinfo values ('0070717101',10,'王生安','男','汉','1998-06-17','452629199806171832','广东省珠海市','珠海市金湾区金山花园','686868','王先生','13824132245','共青团员','13824132245','2017-06-20','1175230403','','在读','')
	insert into Studentinfo values ('0070717102',10,'李鑫灏','男','汉','1998-11-28','452629199811281832','广东省揭阳市','广东省揭阳市皮凝视池尾街道塔峰','686868','李先生','13824132245','群众','13923533128','2017-06-20','193660821','','在读','')
	insert into Studentinfo values ('0070717103',10,'薛佛世','男','汉','1999-12-18','452629199912181832','广东省紫金县','广东省紫金县紫城镇','686868','薛先生','13824132245','共青团员','15986033428','2017-06-20','2093128158','','在读','')
	insert into Studentinfo values ('0070717104',10,'蔡壮保 ','男','汉','1997-09-20','452629199709201832','广西省百色市','广西百色市乐业县同乐路','686868','蔡先生','13824132245','共青团员','15322777511','2017-06-20','1650441540','','在读','')
	insert into Studentinfo values ('0070717105',11,'钱勤堃','男','汉','1999-06-10','4526299906101832','广东省紫金县','广东省紫金县紫城镇二中路9号','686868','钱先生','13824132245','共青团员','15077689173','2017-06-20','1293434420','','在读','')
	insert into Studentinfo values ('0070717106',11,'潘恩依','男','汉','1998-06-30','452629199806301832','江西省干赣州市','江西省干赣州市寻乌县','686868','潘先生','13824132245','群众','15170746497','2017-06-20','2671626752','','在读','')
	insert into Studentinfo values ('0070717107',11,'陈国柏','男','汉','1998-04-28','452629199804281832','江西省干赣州市','江西省干赣州市寻乌县文峰乡岗背村','686868','陈先生','13824132245','共青团员','13979748040','2017-06-20','1171332001','','在读','')
	insert into Studentinfo values ('0070717108',11,'魏皑虎','男','汉','1997-07-19','452629199707191832','广东省普宁市','广东省普宁市流沙西街道南平里119栋4号','686868','魏先生','13824132245','共青团员','18278578248','2017-06-20','563918504','','在读','')
	insert into Studentinfo values ('0070717109',11,'周卓浩','男','汉','1999-08-12','452629199908121832','广西省来宾市','广西来宾市城厢乡','686868','周先生','13824132245','共青团员','13677722156','2017-06-20','404344656','','在读','')
	insert into Studentinfo values ('0070717110',11,'汤辟邦','男','汉','1997-10-11','452629199710111832','江西省石城县','江西省石城县琴江镇温坊村老虎坑','686868','李先生','13824132245','共青团员','13979794335','2017-06-20','1013084720','','在读','')
	insert into Studentinfo values ('0070717111',11,'张顺谷','男','汉','1998-09-12','452629199809121832','广西省象州县','广西省象州县运红镇水寨村民委龙塘村118号','686868','张先生','13824132245','共青团员','13737207873','2017-06-20','1440203176','','在读','')
	insert into Studentinfo values ('0070717112',11,'张悌斯','男','壮','1998-09-22','452629199809221832','广西省田阳县','广西田阳县坡洪镇新景村','686868','张先生','13824132245','群众','13005768719','2017-06-20','2517778384','','在读','')
	insert into Studentinfo values ('0070717113',11,'易江维','男','壮','1999-02-26','452629199902261832','广西省北海市','广西壮族自治区北海市海城区石子里三巷9号','686868','易先生','13824132245','共青团员','18777927469','2017-06-20','2862519348','','在读','')
	insert into Studentinfo values ('0070717114',11,'饶展林','男','壮','1998-03-28','452629199803281832','广西省来宾市','广西省来宾市兴宾区五山乡六欠村委欧村36-1号','686868','饶先生','13824132245','共青团员','13660804719','2017-06-20','2668697130','','在读','')
	insert into Studentinfo values ('0070717115',11,'岳列洋','男','壮','1999-01-13','452629199901131832','广东省龙门县','广东省龙门县马榨镇下龙山口34号','686868','岳先生','13824132245','共青团员','13928389292','2017-06-20','435524709','','在读','')
	insert into Studentinfo values ('0070717116',12,'周迟蒲','女','壮','1998-11-23','452629199811231832','广西省桂平市','广西桂平市栋镇开发区83号','686868','周先生','13824132245','共青团员','15777463501','2017-06-20','1561172137','','在读','')
	insert into Studentinfo values ('0070717117',12,'廉梦容','女','壮','1998-12-15','452629199812151832','江西省丰城市','江西省丰城市张巷镇殷家村','686868','廉先生','13824132245','群众','18289720867','2017-06-20','1662666486','','在读','')
	insert into Studentinfo values ('0070717118',12,'张淮森','男','汉','1999-02-19','452629199902191832','江西省赣州市','江西省赣州市于都县罗江乡','686868','张先生','13824132245','共青团员','13177796516','2017-06-20','303224648','','在读','')
	insert into Studentinfo values ('0070717119',12,'刘昼星','女','汉','1998-04-10','452629199804101832','江西省赣州市','江西省赣州市于都县罗江乡','686868','刘先生','13824132245','群众','18379708359','2017-06-20','3269983308','','在读','')
	insert into Studentinfo values ('0070717120',12,'池荣弈','男','汉','1998-06-11','452629199806111832','广东省遂溪县','广西百色市乐业县同乐路','686868','池先生','13824132245','共青团员','13724771756','2017-06-20','649689087','','在读','')
	insert into Studentinfo values ('0070717121',12,'邹包幼','男','汉','1999-07-26','452629199907261832','广西省灵山县','广西省灵山县丰塘镇潭龙村','686868','邹先生','13824132245','共青团员','13507775423','2017-06-20','450983626','','在读','')
	insert into Studentinfo values ('0070717122',12,'王施峪','男','汉','1998-07-12','452629199807121832','江西九江市','江西九江市都昌县阳光花园','686868','王先生','13824132245','共青团员','18279239511','2017-06-20','150237080','','在读','')
	insert into Studentinfo values ('0070717123',12,'武慎萌','男','汉','1999-05-18','452629199905181832','广东省云浮市','广东省云浮市郁南县都城镇桂圩罗顺镇罗顺村39号','686868','武先生','13824132245','共青团员','15398852223','2017-06-20','1147562174','','在读','')
	insert into Studentinfo values ('0070717124',12,'范千皋','男','汉','1999-06-22','452629199906221832','江西省吉安市','江西省吉安市','686868','范先生','13970623853','共青团员','13970623853','2017-06-20','370622009','','在读','')
	insert into Studentinfo values ('0070717125',12,'潘佩焱','女','壮','1998-02-21','452629199802211832','广东省云浮市','云浮市罗定市素龙街道思围村思围95号','686868','潘先生','13824132245','共青团员','18818983530','2017-06-20','818983530','','在读','')
	insert into Studentinfo values ('0070717126',12,'周逸依','男','壮','1998-09-29','452629199809291832','广西省来宾市','广西省来宾市南泗乡平田村','686868','周先生','13824132245','群众','13152624559','2017-06-20','761273133','','在读','')
	insert into Studentinfo values ('0070717127',13,'文壮翔','男','汉','1998-06-17','452629199806171832','广东省珠海市','珠海市金湾区金山花园','686868','文先生','13824132245','共青团员','13824132245','2017-06-20','1175230403','','在读','')
	insert into Studentinfo values ('0070717128',13,'卢钦钧','女','汉','1998-11-28','452629199811281832','广东省揭阳市','广东省揭阳市皮凝视池尾街道塔峰','686868','卢先生','13824132245','群众','13923533128','2017-06-20','193660821','','在读','')
	insert into Studentinfo values ('0070717129',13,'唐盎正','男','汉','1999-12-18','452629199912181832','广东省紫金县','广东省紫金县紫城镇','686868','唐先生','13824132245','共青团员','15986033428','2017-06-20','2093128158','','在读','')
	insert into Studentinfo values ('0070717130',13,'王腾振','男','汉','1997-09-20','452629199709201832','广西省百色市','广西百色市乐业县同乐路','686868','王先生','13824132245','共青团员','15322777511','2017-06-20','1650441540','','在读','')
	insert into Studentinfo values ('0070717131',13,'蔡容富','男','汉','1999-06-10','4526299906101832','广东省紫金县','广东省紫金县紫城镇二中路9号','686868','蔡先生','13824132245','共青团员','15077689173','2017-06-20','1293434420','','在读','')
	insert into Studentinfo values ('0070717132',13,'宁雨御','男','汉','1998-06-30','452629199806301832','江西省干赣州市','江西省干赣州市寻乌县','686868','宁先生','13824132245','群众','15170746497','2017-06-20','2671626752','','在读','')
	insert into Studentinfo values ('0070717133',13,'朱付流','女','汉','1998-04-28','452629199804281832','江西省干赣州市','江西省干赣州市寻乌县文峰乡岗背村','686868','朱先生','13824132245','共青团员','13979748040','2017-06-20','1171332001','','在读','')
	insert into Studentinfo values ('0070717134',13,'陆丛枫','女','汉','1997-07-19','452629199707191832','广东省普宁市','广东省普宁市流沙西街道南平里119栋4号','686868','陆先生','13824132245','共青团员','18278578248','2017-06-20','563918504','','在读','')
	insert into Studentinfo values ('0070717135',13,'汤丞昱','女','汉','1999-08-12','452629199908121832','广西省来宾市','广西来宾市城厢乡','686868','汤先生','13824132245','共青团员','13677722156','2017-06-20','404344656','','在读','')
	insert into Studentinfo values ('0070717136',13,'萧百徽','女','汉','1997-10-11','452629199710111832','江西省石城县','江西省石城县琴江镇温坊村老虎坑','686868','萧先生','13824132245','共青团员','13979794335','2017-06-20','1013084720','','在读','')
	insert into Studentinfo values ('0070717137',13,'莫立恩','男','汉','1998-09-12','452629199809121832','广西省象州县','广西省象州县运红镇水寨村民委龙塘村118号','686868','莫先生','13824132245','共青团员','13737207873','2017-06-20','1440203176','','在读','')
	insert into Studentinfo values ('0070717138',14,'郭磊留','女','壮','1998-09-22','452629199809221832','广西省田阳县','广西田阳县坡洪镇新景村','686868','郭先生','13824132245','群众','13005768719','2017-06-20','2517778384','','在读','')
	insert into Studentinfo values ('0070717139',14,'邱靖祈','男','壮','1999-02-26','452629199902261832','广西省北海市','广西壮族自治区北海市海城区石子里三巷9号','686868','邱先生','13824132245','共青团员','18777927469','2017-06-20','2862519348','','在读','')
	insert into Studentinfo values ('0070717140',14,'刘鲜发','男','壮','1998-03-28','452629199803281832','广西省来宾市','广西省来宾市兴宾区五山乡六欠村委欧村36-1号','686868','刘先生','13824132245','共青团员','13660804719','2017-06-20','2668697130','','在读','')
	insert into Studentinfo values ('0070717141',14,'李彩早','女','壮','1999-01-13','452629199901131832','广东省龙门县','广东省龙门县马榨镇下龙山口34号','686868','张先生','13824132245','共青团员','13928389292','2017-06-20','435524709','','在读','')
	insert into Studentinfo values ('0070717142',14,'卓互知','女','壮','1998-11-23','452629199811231832','广西省桂平市','广西桂平市栋镇开发区83号','686868','李先生','13824132245','共青团员','15777463501','2017-06-20','1561172137','','在读','')
	insert into Studentinfo values ('0070717143',14,'岳繁粟','女','壮','1998-12-15','452629199812151832','江西省丰城市','江西省丰城市张巷镇殷家村','686868','岳先生','13824132245','群众','18289720867','2017-06-20','1662666486','','在读','')
	insert into Studentinfo values ('0070717144',14,'莫两敬','男','汉','1999-02-19','452629199902191832','江西省赣州市','江西省赣州市于都县罗江乡','686868','莫先生','13824132245','共青团员','13177796516','2017-06-20','303224648','','在读','')
	insert into Studentinfo values ('0070717145',14,'贺 易','女','汉','1998-04-10','452629199804101832','江西省赣州市','江西省赣州市于都县罗江乡','686868','贺先生','13824132245','群众','18379708359','2017-06-20','3269983308','','在读','')
	insert into Studentinfo values ('0070717146',14,'岑贝澄','男','汉','1998-06-11','452629199806111832','广东省遂溪县','广西百色市乐业县同乐路','686868','岑先生','13824132245','共青团员','13724771756','2017-06-20','649689087','','在读','')
	insert into Studentinfo values ('0070717147',14,'陶臣杜','男','汉','1999-07-26','452629199907261832','广西省灵山县','广西省灵山县丰塘镇潭龙村','686868','陶先生','13824132245','共青团员','13507775423','2017-06-20','450983626','','在读','')
	insert into Studentinfo values ('0070717148',14,'卫惇琰','女','汉','1998-07-12','452629199807121832','江西九江市','江西九江市都昌县阳光花园','686868','卫先生','13824132245','共青团员','18279239511','2017-06-20','150237080','','在读','')
	insert into Studentinfo values ('0070717149',15,'王赫颢','男','汉','1999-05-18','452629199905181832','广东省云浮市','广东省云浮市郁南县都城镇桂圩罗顺镇罗顺村39号','686868','王先生','13824132245','共青团员','15398852223','2017-06-20','1147562174','','在读','')
	insert into Studentinfo values ('0070717150',15,'何刚名','男','汉','1999-06-22','452629199906221832','江西省吉安市','江西省吉安市','686868','何先生','13824132245','共青团员','13970623853','2017-06-20','370622009','','在读','')
	insert into Studentinfo values ('0070717151',15,'梁澄静','女','壮','1998-02-21','452629199802211832','广东省云浮市','云浮市罗定市素龙街道思围村思围95号','686868','梁先生','13824132245','共青团员','18818983530','2017-06-20','818983530','','在读','')
	insert into Studentinfo values ('0070717152',15,'卢全煦','男','壮','1998-09-29','452629199809291832','广西省来宾市','广西省来宾市南泗乡平田村','686868','卢先生','13824132245','群众','13152624559','2017-06-20','761273133','','在读','')
	insert into Studentinfo values ('0070717153',15,'严席华','男','壮','1999-01-13','452629199901131832','广东省龙门县','广东省龙门县马榨镇下龙山口34号','686868','严先生','13824132245','共青团员','13928389292','2017-06-20','435524709','','在读','')
	insert into Studentinfo values ('0070717154',15,'张顺廉','女','壮','1998-11-23','452629199811231832','广西省桂平市','广西桂平市栋镇开发区83号','686868','张先生','13824132245','共青团员','15777463501','2017-06-20','1561172137','','在读','')
	insert into Studentinfo values ('0070717155',15,'欧贡界','男','壮','1998-12-15','452629199812151832','江西省丰城市','江西省丰城市张巷镇殷家村','686868','欧先生','13824132245','群众','18289720867','2017-06-20','1662666486','','在读','')
	insert into Studentinfo values ('0070717156',15,'汤始青','女','汉','1999-02-19','452629199902191832','江西省赣州市','江西省赣州市于都县罗江乡','686868','汤先生','13824132245','共青团员','13177796516','2017-06-20','303224648','','在读','')
	insert into Studentinfo values ('0070717157',15,'张鸿鹤','男','汉','1998-04-10','452629199804101832','江西省赣州市','江西省赣州市于都县罗江乡','686868','张先生','13824132245','群众','18379708359','2017-06-20','3269983308','','在读','')
	insert into Studentinfo values ('0070717158',15,'车亚忠','女','汉','1998-06-11','452629199806111832','广东省遂溪县','广西百色市乐业县同乐路','686868','车先生','13824132245','共青团员','13724771756','2017-06-20','649689087','','在读','')
	insert into Studentinfo values ('0070717159',15,'龙璨禄','男','汉','1999-07-26','452629199907261832','广西省灵山县','广西省灵山县丰塘镇潭龙村','686868','龙先生','13824132245','共青团员','13507775423','2017-06-20','450983626','','在读','')
	insert into Studentinfo values ('0070717160',15,'柯纤翊','女','汉','1998-07-12','452629199807121832','江西九江市','江西九江市都昌县阳光花园','686868','柯先生','13824132245','共青团员','18279239511','2017-06-20','150237080','','在读','')
	insert into Studentinfo values ('0070717161',16,'柯古薄','女','汉','1999-05-18','452629199905181832','广东省云浮市','广东省云浮市郁南县都城镇桂圩罗顺镇罗顺村39号','686868','柯先生','13824132245','共青团员','15398852223','2017-06-20','1147562174','','在读','')
	insert into Studentinfo values ('0070717162',16,'梁 真','男','汉','1999-06-22','452629199906221832','江西省吉安市','江西省吉安市','686868','梁先生','13824132245','共青团员','13970623853','2017-06-20','370622009','','在读','')
	insert into Studentinfo values ('0070717163',16,'刘慕骏','女','壮','1998-02-21','452629199802211832','广东省云浮市','云浮市罗定市素龙街道思围村思围95号','686868','刘先生','13824132245','共青团员','18818983530','2017-06-20','818983530','','在读','')
	insert into Studentinfo values ('0070717164',16,'贺 滨','男','壮','1998-09-29','452629199809291832','广西省来宾市','广西省来宾市南泗乡平田村','686868','贺先生','13824132245','群众','13152624559','2017-06-20','761273133','','在读','')
	insert into Studentinfo values ('0070717165',16,'张宁光','女','壮','1998-02-21','452629199802211832','广东省云浮市','云浮市罗定市素龙街道思围村思围95号','686868','张先生','13824132245','共青团员','18818983530','2017-06-20','818983530','','在读','')
	insert into Studentinfo values ('0070717166',16,'吴川宜','女','壮','1998-09-29','452629199809291832','广西省来宾市','广西省来宾市南泗乡平田村','686868','吴先生','13824132245','群众','13152624559','2017-06-20','761273133','','在读','')
	insert into Studentinfo values ('0070717167',16,'蒲惇坚','女','壮','1999-01-13','452629199901131832','广东省龙门县','广东省龙门县马榨镇下龙山口34号','686868','蒲先生','13824132245','共青团员','13928389292','2017-06-20','435524709','','在读','')
	insert into Studentinfo values ('0070717168',16,'欧彩徽','女','壮','1998-11-23','452629199811231832','广西省桂平市','广西桂平市栋镇开发区83号','686868','欧先生','13824132245','共青团员','15777463501','2017-06-20','1561172137','','在读','')
	insert into Studentinfo values ('0070717169',16,'雷 琳','女','壮','1998-12-15','452629199812151832','江西省丰城市','江西省丰城市张巷镇殷家村','686868','雷先生','13824132245','群众','18289720867','2017-06-20','1662666486','','在读','')
	insert into Studentinfo values ('0070717170',16,'张频启','男','汉','1999-02-19','452629199902191832','江西省赣州市','江西省赣州市于都县罗江乡','686868','张先生','13824132245','共青团员','13177796516','2017-06-20','303224648','','在读','')
	insert into Studentinfo values ('0070717171',16,'吴湘意','男','汉','1998-04-10','452629199804101832','江西省赣州市','江西省赣州市于都县罗江乡','686868','吴先生','13824132245','群众','18379708359','2017-06-20','3269983308','','在读','')
	insert into Studentinfo values ('0070717172',17,'刘 玉','男','汉','1998-06-11','452629199806111832','广东省遂溪县','广西百色市乐业县同乐路','686868','刘先生','13824132245','共青团员','13724771756','2017-06-20','649689087','','在读','')
	insert into Studentinfo values ('0070717173',17,'王吉蓉','女','汉','1999-07-26','452629199907261832','广西省灵山县','广西省灵山县丰塘镇潭龙村','686868','王先生','13824132245','共青团员','13507775423','2017-06-20','450983626','','在读','')
	insert into Studentinfo values ('0070717174',17,'柳述俊','女','汉','1998-07-12','452629199807121832','江西九江市','江西九江市都昌县阳光花园','686868','柳先生','13824132245','共青团员','18279239511','2017-06-20','150237080','','在读','')
	insert into Studentinfo values ('0070717175',17,'穆佑碧','男','汉','1999-05-18','452629199905181832','广东省云浮市','广东省云浮市郁南县都城镇桂圩罗顺镇罗顺村39号','686868','穆先生','13824132245','共青团员','15398852223','2017-06-20','1147562174','','在读','')
	insert into Studentinfo values ('0070717176',17,'赵程缨 ','男','汉','1999-06-22','452629199906221832','江西省吉安市','江西省吉安市','686868','赵先生','13824132245','共青团员','13970623853','2017-06-20','370622009','','在读','')
	insert into Studentinfo values ('0070717177',17,'韦裁苗','女','壮','1998-02-21','452629199802211832','广东省云浮市','云浮市罗定市素龙街道思围村思围95号','686868','韦先生','13824132245','共青团员','18818983530','2017-06-20','818983530','','在读','')
	insert into Studentinfo values ('0070717178',17,'张存丽','女','壮','1998-09-29','452629199809291832','广西省来宾市','广西省来宾市南泗乡平田村','686868','张先生','13824132245','群众','13152624559','2017-06-20','761273133','','在读','')
	insert into Studentinfo values ('0070717179',17,'范鹊茜','女','壮','1998-02-21','452629199802211832','广东省云浮市','云浮市罗定市素龙街道思围村思围95号','686868','范先生','13824132245','共青团员','18818983530','2017-06-20','818983530','','在读','')
	insert into Studentinfo values ('0070717180',17,'萧婷豫','男','壮','1998-09-29','452629199809291832','广西省来宾市','广西省来宾市南泗乡平田村','686868','萧先生','13824132245','群众','13152624559','2017-06-20','761273133','','在读','')
	insert into Studentinfo values ('0070717181',17,'张察妙 ','男','壮','1999-01-13','452629199901131832','广东省龙门县','广东省龙门县马榨镇下龙山口34号','686868','张先生','13824132245','共青团员','13928389292','2017-06-20','435524709','','在读','')
	insert into Studentinfo values ('0070717182',17,'袁棋琴','女','壮','1998-11-23','452629199811231832','广西省桂平市','广西桂平市栋镇开发区83号','686868','袁先生','13824132245','共青团员','15777463501','2017-06-20','1561172137','','在读','')
	insert into Studentinfo values ('0070717182',17,'孟鼎好','女','壮','1998-11-23','452629199811231832','广西省桂平市','广西桂平市栋镇开发区83号','686868','孟先生','13824132245','共青团员','15777463501','2017-06-20','1561172137','','在读','')
	insert into Studentinfo values ('0070717184',17,'欧充舒','女','汉','1999-02-19','452629199902191832','江西省赣州市','江西省赣州市于都县罗江乡','686868','欧先生','13824132245','共青团员','13177796516','2017-06-20','303224648','','在读','')
	insert into Studentinfo values ('0070717185',18,'郑洋影','男','汉','1998-04-10','452629199804101832','江西省赣州市','江西省赣州市于都县罗江乡','686868','郑先生','13824132245','群众','18379708359','2017-06-20','3269983308','','在读','')
	insert into Studentinfo values ('0070717186',18,'严 凌','男','汉','1998-06-11','452629199806111832','广东省遂溪县','广西百色市乐业县同乐路','686868','严先生','13824132245','共青团员','13724771756','2017-06-20','649689087','','在读','')
	insert into Studentinfo values ('0070717187',18,'陈缅芙','女','汉','1999-07-26','452629199907261832','广西省灵山县','广西省灵山县丰塘镇潭龙村','686868','陈先生','13824132245','共青团员','13507775423','2017-06-20','450983626','','在读','')
	insert into Studentinfo values ('0070717188',18,'周蕾秀','男','汉','1998-07-12','452629199807121832','江西九江市','江西九江市都昌县阳光花园','686868','周先生','13824132245','共青团员','18279239511','2017-06-20','150237080','','在读','')
	insert into Studentinfo values ('0070717189',18,'潘苹芝','男','汉','1999-05-18','452629199905181832','广东省云浮市','广东省云浮市郁南县都城镇桂圩罗顺镇罗顺村39号','686868','潘先生','13824132245','共青团员','15398852223','2017-06-20','1147562174','','在读','')
	insert into Studentinfo values ('0070717190',18,'华稻兰','女','汉','1999-06-22','452629199906221832','江西省吉安市','江西省吉安市','686868','华先生','13970623853','共青团员','13970623853','2017-06-20','370622009','','在读','')
	insert into Studentinfo values ('0070717191',18,'李丞佩','女','壮','1998-02-21','452629199802211832','广东省云浮市','云浮市罗定市素龙街道思围村思围95号','686868','李先生','13824132245','共青团员','18818983530','2017-06-20','818983530','','在读','')
	insert into Studentinfo values ('0070717192',18,'王原愿','男','壮','1998-09-29','452629199809291832','广西省来宾市','广西省来宾市南泗乡平田村','686868','王先生','13824132245','群众','13152624559','2017-06-20','761273133','','在读','')
	insert into Studentinfo values ('0070717193',18,'蔡慕天','男','汉','1998-04-10','452629199804101832','江西省赣州市','江西省赣州市于都县罗江乡','686868','蔡先生','13824132245','群众','18379708359','2017-06-20','3269983308','','在读','')
	insert into Studentinfo values ('0070717194',18,'詹昱珑','男','汉','1998-06-11','452629199806111832','广东省遂溪县','广西百色市乐业县同乐路','686868','詹先生','13824132245','共青团员','13724771756','2017-06-20','649689087','','在读','')
	insert into Studentinfo values ('0070717195',18,'贺松声','男','汉','1999-07-26','452629199907261832','广西省灵山县','广西省灵山县丰塘镇潭龙村','686868','贺先生','13824132245','共青团员','13507775423','2017-06-20','450983626','','在读','')
	insert into Studentinfo values ('0070717196',18,'陆荆虹','女','汉','1998-07-12','452629199807121832','江西九江市','江西九江市都昌县阳光花园','686868','陆先生','13824132245','共青团员','18279239511','2017-06-20','150237080','','在读','')
	insert into Studentinfo values ('0070717197',18,'何莲宁','男','汉','1999-05-18','452629199905181832','广东省云浮市','广东省云浮市郁南县都城镇桂圩罗顺镇罗顺村39号','686868','何先生','13824132245','共青团员','15398852223','2017-06-20','1147562174','','在读','')
	insert into Studentinfo values ('0070717198',18,'康 谚','女','汉','1999-06-22','452629199906221832','江西省吉安市','江西省吉安市','686868','郭先生','13824132245','共青团员','13970623853','2017-06-20','370622009','','在读','')
	insert into Studentinfo values ('0070717199',18,'刘倩诺','女','壮','1998-02-21','452629199802211832','广东省云浮市','云浮市罗定市素龙街道思围村思围95号','686868','刘先生','13824132245','共青团员','18818983530','2017-06-20','818983530','','在读','')
	insert into Studentinfo values ('0070717200',18,'张晶卿','女','壮','1998-09-29','452629199809291832','广西省来宾市','广西省来宾市南泗乡平田村','686868','张先生','13824132245','群众','13152624559','2017-06-20','761273133','','在读','')







select * from Studentinfo


--管理员表
create table Administrator
(
	Admin_id int primary key identity(1,1),		--id
	Admin_Name varchar(20) not null,				--姓名
	Admin_Account varchar(20)  UNIQUE not null,			--账号
	Admin_Password varchar(100) not null,			--密码
	Admin_State varchar(20),						--状态
	Admin_Note text						--备注
)
select * from Administrator
insert into Administrator values('da','123456','D352079B056A133A60C1F3091437FE23','可用','')
go
--课程表
create table Course
(
	course_id int identity(1,1) primary key,     --编号
	course_name varchar(50) not null,          --课程名称
	course_number int not null,               --课程数量
	course_sum   int not null,               --总学分
	course_note text                --备注
)
go
insert into Course values('java程序设计基础',45,100,''),
						 ('C#面向对象编程基础',45,100,''),
						 ('SQL Server基础编程',45,100,''),
						 ('HTML5与CSS3网页设计',30,100,''),
						 ('JavaScript编程',50,100,''),
						 ('Java Web编程',50,100,''),
						 ('jQuery框架及AJAX应用',50,100,''),
						 ('Java高级程序设置',60,100,''),
						 ('C#高级编程',50,100,''),
						 ('SQL Server高级编程',50,100,''),
						 ('人文素养',20,100,'')
						 
select * from Course

--学分表
create table Credits
( 
	cIds int identity(1,1) primary key,     --编号
	cClasssName int foreign key references Classs(cid),           --班级名称
	cStudentid int foreign key references Studentinfo(stuId),                  --根据ID查询学号
	cSubjectsName  int foreign key references Course(course_id),         --课程名称
	cHavecredit int not null,               --已修学分
	cOperator  int foreign key references Teacher(tid),                  --操作员
	cNotes text                      --备注 
)
go
insert into Credits values(3,1,1,70,1,''),
							(3,2,3,73,2,''),
							(3,3,2,75,3,''),
							(3,4,3,78,4,''),
							(3,1,3,80,5,''),
							(3,2,4,85,6,''),
							(3,3,5,68,7,''),
							(3,4,2,70,8,''),
							(3,1,1,88,9,''),
							(3,2,2,76,10,''),
							(3,2,4,90,11,''),
							(3,3,3,89,12,''),
							(3,4,6,86,13,''),
							(4,1,5,95,14,''),
							(4,2,2,80,15,'')

select * from Credits
go
--课时表-
create table Pperiod
(
	pId int identity(1,1) primary key,     --编号
	pClasss int foreign key references Classs(cid) ,                 -- 班级，引用外键
	pCourse int foreign key references Course(course_id),          --课程名称，引用外键
	pDate datetime ,                    --时间
	pNote text						--备注
)
go

--学生出勤表
create table Attendance
(
	aId int identity(1,1) primary key,     --编号
	aClasss int foreign key references Classs(cid),           --班级
	aStudentid int foreign key references Studentinfo(stuId),              --学号
	aDate datetime not null,                --日期
	aCourseName varchar(50) not null,     --课程名称
	aOperator int foreign key references Teacher(tid),                 --操作员
	aAttendanceType varchar(20),			--出勤类型
	aNote text						--备注
)
go

insert into Attendance values(3,1,'2018-05-07',1,1,'上课',''),
							(3,2,'2018-05-07',1,1,'上课',''),
							(3,3,'2018-05-07',1,1,'上课',''),
							(3,4,'2018-05-07',1,1,'上课',''),
							(3,5,'2018-05-07',2,2,'上课',''),
							(3,6,'2018-05-07',2,2,'上课',''),
							(3,7,'2018-05-07',2,2,'上课',''),
							(3,8,'2018-05-07',2,2,'上课',''),
							(3,9,'2018-05-07',2,2,'上课',''),
							(3,10,'2018-05-07',3,3,'上课',''),
							(3,11,'2018-05-07',3,3,'上课',''),
							(3,12,'2018-05-07',3,3,'上课',''),
							(3,13,'2018-05-07',3,3,'上课','')
select * from Attendance


--学生成绩表
create table Student_results
(
	rId int identity(1,1) primary key,     --编号
	rStudentid int foreign key references Studentinfo(stuId),               --学号
	rExamDate datetime not null,                  --考试时间
	rOperating decimal(3,1),					--机试
	rAnswer decimal(3,1),						--笔试
	rClasss int foreign key references Classs(cid),	--班级
	rPass varchar(20),					--是否通过
	rNote text					--备注
)
go
insert into Student_results values  (1,'2018-07-09',68,45.5,2,'是',''),
									(2,'2018-07-09',43,59,2,'是',''),
									(3,'2018-07-09',70,97,2,'是',''),
									(4,'2018-07-09',52,53,2,'是',''),
									(5,'2018-07-09',62,53,2,'是',''),
									(6,'2018-07-09',38,20,2,'否',''),
									(7,'2018-07-09',68,52,2,'是',''),
									(8,'2018-07-09',58,44,2,'是',''),
									(9,'2018-07-09',84,74,2,'是',''),
									(10,'2018-07-09',78,62,2,'是',''),
									(11,'2018-07-09',23,28,2,'否',''),
									(12,'2018-07-09',74,77,2,'是',''),
									(13,'2018-07-09',66,48,2,'是',''),
									(14,'2018-07-09',70,63,2,'是',''),
									(15,'2018-07-09',54,30,2,'是',''),
									(16,'2018-07-09',43,40,2,'是',''),
									(17,'2018-07-09',90,47,2,'是',''),
									(18,'2018-07-09',82,63,2,'是',''),
									(19,'2018-07-09',62,50,2,'是',''),
									(20,'2018-07-09',30,22,2,'否','')


select * from Student_results
go

--选课类型表
create table SelectCoursetype
(
	select_id int identity(1,1) primary key,      --编号
	select_name varchar(50) ,             --课程名称
	select_target varchar(100) ,          --课程目标
	select_introduce varchar(100) ,       --课程介绍
	select_capacityv varchar(100) ,       --具备能力
	select_jobs varchar(50) ,             --就业岗位
	select_teacher varchar(50) ,          --专业老师
	select_Headmaster varchar(20) ,       --班主任
	select_Note text					--备注

) 
go

insert into SelectCoursetype values('前端开发-Android开发工程师','熟练掌握Java Web开发，具备开源框架SSM的应用能力','熟练掌握数据存储和网络编程','掌握基于react native跨平台混合式App的开发','Android开发工程师','何家盛','',''),
									('互联网运营工程师','能从事B/S,C/S架构的互联网开发工作','具有企业产品及品牌在互联网上进行网店的运营能力','具备从事跨电商的运营和推广工作的能力','互联网运营工程师','邓伟','',''),
									('Java开发工程师','掌握Java企业级应用开发能力','掌握各种设计模式应用场景','熟练运用各种轻量级开源框架技术','Java开发工程师','王亮','',''),
									('.NET开发工程师','熟练运用三层架构进行应用程序开发','掌握ASP.NET MVC框架进行开发','掌握jQuery等前端框架','.NET软件工程师','崔翔','',''),
									('软件测试与实施工程师','会编写软件测试方案、测试文档','掌握最流行的自动化测试工具的使用','掌握Linux服务器的安装与设置','软件测试工程师','李克明','',''),
									('UI设计师','熟练使用设计相关软件和系统的设计理论知识相结合','能主导产品的UI设计视觉整体方向','具备扎实的设计功底','UI设计师','刘毅','',''),
									('前端开发-PHP开发工程师','熟练掌握HTML5,CSS3,JS等前端开发技术','掌握ThinkPHP框架，能使用它进行复杂网站的开发','学会使用PHP进行微信开发','PHP开发工程师','牛春虎','',''),
									('前端开发-前端全栈开发工程师','培养具备竞争力的跨平台App与全栈软件工程师','掌握后台开发技术','掌握MVVM框架技术','Web前端开发工程师','张果','','')
go
select * from SelectCoursetype
go

--选课方向表
create table Direction
(
	dId int identity(1,1) primary key,                                       --编号
	dStudentid int foreign key references Studentinfo(stuId),				 -- 学号
	dClasss int foreign key references Classs(cId),                            --班级
	dFirstchoice int foreign key references SelectCoursetype(select_id),      --第一志愿，引用外键
	dSecondchoice int foreign key references SelectCoursetype(select_id),        --第二志愿，引用外键
	dDate datetime ,                                                         --日期
	dNote text					                                     --备注
)
go

insert into Direction values(1,2,1,3,'2018-07-02',''),
							(2,2,2,1,'2018-07-02',''),
							(3,2,4,2,'2018-07-02',''),
							(4,2,3,2,'2018-07-02',''),
							(5,2,5,1,'2018-07-02',''),
							(6,2,2,4,'2018-07-02',''),
							(7,2,3,1,'2018-07-02',''),
							(8,2,2,6,'2018-07-02',''),
							(9,2,4,5,'2018-07-02',''),
							(10,2,1,7,'2018-07-02',''),
							(11,2,3,1,'2018-07-02',''),
							(12,2,3,5,'2018-07-02',''),
							(13,2,2,4,'2018-07-02',''),
							(14,2,2,1,'2018-07-02',''),
							(15,2,2,3,'2018-07-02','')

select * from Direction

--上课点名表
create table Roll_Call
(
	Roll_id int primary key identity(1,1), --编号
	Roll_Classs int foreign key references Classs(cid),	--班级
	Roll_Course int foreign key references Course(course_id),	--课程
	Roll_Type varchar(20),			--点名类型
	Roll_Number int foreign key references Studentinfo(stuId),	--学号
	Roll_Operator int foreign key references Teacher(tid),		--操作员
	Roll_Time datetime,			--时间
	Roll_State varchar(20),		--状况
	Roll_Note text					--备注
)
go

insert into Roll_Call values(2,3,'上课',1,4,'2018-07-10','正常',''),
							(2,3,'上课',2,4,'2018-07-10','正常',''),
							(2,3,'上课',3,4,'2018-07-10','正常',''),
							(2,3,'上课',4,4,'2018-07-10','正常',''),
							(2,3,'上课',5,4,'2018-07-10','迟到',''),
							(2,3,'上课',6,4,'2018-07-10','正常',''),
							(2,3,'上课',7,4,'2018-07-10','正常',''),
							(2,3,'上课',8,4,'2018-07-10','正常',''),
							(2,3,'上课',9,4,'2018-07-10','正常',''),
							(2,3,'上课',10,4,'2018-07-10','早退',''),
							(2,3,'上课',11,4,'2018-07-10','正常',''),
							(2,3,'上课',12,4,'2018-07-10','正常',''),
							(2,3,'上课',13,4,'2018-07-10','正常',''),
							(2,3,'上课',14,4,'2018-07-10','正常',''),
							(2,3,'上课',15,4,'2018-07-10','请假','')
							   
select * from Roll_Call
--学员谈话
create table Student_Talk
(
	stu_id int primary key identity(1,1),
	stu_Studentid int foreign key references Studentinfo(stuId),		--学号
	stu_Time datetime,			--访谈时间
	stu_Content text,		--内容
	stu_Operator int foreign key references Teacher(tid),		--操作员
	stu_Note text					--备注
)
go
insert into Student_Talk values(1,'2018-07-02','表现良好',1,''),
								(2,'2018-06-27','表现良好',3,''),
								(3,'2018-07-05','表现良好',6,''),
								(4,'2018-05-18','表现良好',2,''),
								(5,'2018-07-04','表现良好',2,''),
								(6,'2018-04-05','表现良好',16,''),
								(7,'2018-05-12','表现良好',8,''),
								(9,'2018-03-07','表现良好',10,''),
								(11,'2018-04-20','表现良好',9,''),
								(12,'2018-06-07','表现良好',4,''),
								(13,'2018-06-22','表现良好',7,''),
								(14,'2018-04-25','表现良好',11,''),
								(15,'2018-07-03','表现良好',2,''),
								(16,'2018-05-27','表现良好',10,'')

select * from Student_Talk

--家长访谈
create table Parents_Talk
(
	par_id int primary key identity(1,1),		
	par_Studentid int foreign key references Studentinfo(stuId),		--学号
	par_Time datetime,			--时间
	par_Content text,			--内容
	par_Operator int foreign key references Teacher(tid),		--操作员
	par_Note text					--备注
)
go
insert into Parents_Talk values(1,'2018-07-02','表现良好',1,''),
									(2,'2018-06-27','表现良好',3,''),
									(3,'2018-07-05','表现良好',6,''),
									(4,'2018-05-18','表现良好',2,''),
									(5,'2018-07-04','表现良好',2,''),
									(6,'2018-04-05','表现良好',16,''),
									(7,'2018-05-12','表现良好',8,''),
									(9,'2018-03-07','表现良好',10,''),
									(11,'2018-04-20','表现良好',9,''),
									(12,'2018-06-07','表现良好',4,''),
									(13,'2018-06-22','表现良好',7,''),
									(14,'2018-04-25','表现良好',11,''),
									(15,'2018-07-03','表现良好',2,''),
									(16,'2018-05-27','表现良好',10,'')

select * from Parents_Talk

--升学访谈
create table Enter_Talk
(
	enter_id int primary key identity(1,1),
	enter_Studentid int foreign key references Studentinfo(stuId),		--学号
	enter_Time datetime,			--时间
	enter_Content text,			--内容
	enter_Operator int foreign key references Teacher(tid),		--操作员
	enter_Note text					--备注
)
go
insert into Enter_Talk values(1,'2018-02-18','升学情况良好',1,''),
							(2,'2018-03-18','升学情况良好',11,''),
							(3,'2018-04-18','升学情况良好',5,''),
							(4,'2018-05-18','升学情况良好',3,''),
							(5,'2018-02-21','升学情况良好',7,''),
							(6,'2018-02-10','升学情况良好',6,''),
							(7,'2018-03-28','升学情况良好',10,''),
							(8,'2018-02-28','升学情况良好',7,''),
							(9,'2018-06-18','升学情况良好',2,''),
							(10,'2018-06-19','升学情况良好',14,''),
							(11,'2018-04-12','升学情况良好',12,''),
							(12,'2018-02-18','升学情况良好',5,''),
							(13,'2018-02-22','升学情况良好',8,''),
							(14,'2018-07-08','升学情况良好',6,'')



select * from Enter_Talk

--班级活动
create table Classs_Activity
(
	act_id int primary key identity(1,1),
	act_Classs int foreign key references Classs(cid),		--班级
	act_Teme varchar(30),			--活动主题
	act_Time datetime,			--时间
	act_Location varchar(30),		--地点
	act_Content text,		--内容
	act_Note text					--备注
)
go
insert into Classs_Activity values(1,'秋游','2018-05-22','淇澳岛','烧烤',''),
								(2,'秋游','2018-04-27','新圆明园','烧烤',''),
								(3,'秋游','2018-04-22','海滨泳场','游泳',''),
								(4,'秋游','2018-05-16','淇澳岛','烧烤',''),
								(5,'秋游','2018-05-16','淇澳岛','烧烤',''),
								(6,'秋游','2018-05-20','真人JS','烧烤',''),
								(8,'秋游','2018-05-28','新圆明园','烧烤',''),
								(9,'秋游','2018-06-08','黄阳山','烧烤',''),
								(10,'秋游','2018-05-12','真人JS','烧烤',''),
								(12,'秋游','2018-05-10','黄阳山','爬山',''),
								(11,'秋游','2018-06-12','渔女附近','游玩','')

select * from Classs_Activity

--学员违纪
create table Student_Violate
(
	vio_id int primary key identity(1,1),
	vio_Studentid int foreign key references Studentinfo(stuId),		--学号
	vio_Time datetime,		--时间
	vio_Content text,			--违纪内容
	vio_Note text					--备注
)
go
insert into Student_Violate values  (1,'2017-08-14','打架斗殴',''),
									(2,'2017-08-24','使用违规电器',''),
									(3,'2017-10-15','赌博',''),
									(4,'2017-03-12','使用违规电器',''),
									(5,'2017-06-11','翻墙外出',''),
									(6,'2017-02-17','翻墙外出',''),
									(7,'2017-11-05','使用违规电器',''),
									(8,'2018-09-07','使用违规电器',''),
									(9,'2018-08-19','翻墙外出',''),
									(10,'2018-04-13','使用违纪电器',''),
									(11,'2018-03-18','使用违纪电器',''),
									(12,'2018-04-23','翻墙外出',''),
									(13,'2018-06-27','打架斗殴',''),
									(14,'2018-12-29','打架斗殴',''),
									(15,'2018-08-13','打架斗殴','')

	select * from Student_Violate

--学员通讯录
create table Classs_Address
(
	address_id int primary key identity(1,1),
	address_Classs int foreign key references Classs(cid),		--班级
	adderss_Name int foreign key references Studentinfo(stuId),		--姓名
	adderss_Phone int foreign key references Studentinfo(stuId),	--电话
	adderss_Note text					--备注
)
go
insert into Classs_Address values(3,1,1,''),
								(3,2,2,''),
								(3,3,3,''),
								(3,4,4,''),
								(3,5,5,''),
								(3,5,5,''),
								(3,6,6,''),
								(3,7,7,''),
								(3,8,8,''),
								(3,9,9,''),
								(3,10,10,''),
								(3,11,11,''),
								(3,12,12,''),
								(3,13,13,''),
								(3,14,14,''),
								(3,15,15,''),
								(3,16,16,''),
								(3,17,17,'')

	select * from Classs_Address

--学员证
create table Student_Certificate
(
	cer_id int primary key identity(1,1),
	cer_Studentid int foreign key references Studentinfo(stuId),		--学号
	cer_Time datetime,			--办证日期
	cer_Read datetime,			--在读时间
	cer_Note text					--备注
)
go
insert into Student_Violate values  (1,'2017-08-14','2018-06-20',''),
									(2,'2017-08-24','2018-06-20',''),
									(3,'2017-10-15','2018-06-20',''),
									(4,'2017-03-12','2018-06-20',''),
									(5,'2017-06-11','2018-06-20',''),
									(6,'2017-02-17','2018-06-20',''),
									(7,'2017-11-05','2018-06-20',''),
									(8,'2018-09-07','2018-06-20',''),
									(9,'2018-08-19','2018-06-20',''),
									(10,'2018-04-13','2018-06-20',''),
									(11,'2018-03-18','2018-06-20',''),
									(12,'2018-04-23','2018-06-20',''),
									(13,'2018-06-27','2018-06-20',''),
									(14,'2018-12-29','2018-06-20',''),
									(15,'2018-08-13','2018-06-20','')

select * from Student_Violate
--保险表
create table Insurance
(
	Iid int primary key identity(1,1),
	IStudentid int foreign key references Studentinfo(stuId),		--学号
	IName varchar(20),			--保险名称
	ITime datetime,				--日期
	IContent text,		--内容
	INote text					--备注
)
go

insert into Insurance values  (1,'在校意外保险','2018-06-20','',''),
									(2,'在校意外保险','2018-06-20','',''),
									(3,'在校意外保险','2018-06-20','',''),
									(4,'在校意外保险','2018-06-20','',''),
									(5,'在校意外保险','2018-06-20','',''),
									(6,'在校意外保险','2018-06-20','',''),
									(7,'在校意外保险','2018-06-20','',''),
									(8,'在校意外保险','2018-06-20','',''),
									(9,'在校意外保险','2018-06-20','',''),
									(10,'在校意外保险','2018-06-20','',''),
									(11,'在校意外保险','2018-06-20','',''),
									(12,'在校意外保险','2018-06-20','',''),
									(13,'在校意外保险','2018-06-20','',''),
									(14,'在校意外保险','2018-06-20','',''),
									(15,'在校意外保险','2018-06-20','','')


	select * from Insurance

--档案核对
create table Archives_check
( 
	arc_id int primary key identity(1,1),
	arc_Classs int foreign key references Classs(cid),		--班级
	arc_Studentid int foreign key references Studentinfo(stuId),		--学号
	arc_Content text,		--内容
	arc_Note text					--备注
)
go
insert into Archives_check values(3,1,'',''),
								(3,2,'',''),
								(3,3,'',''),
								(3,4,'',''),
								(1,5,'',''),
								(3,6,'',''),
								(3,7,'',''),
								(3,8,'',''),
								(3,9,'',''),
								(3,10,'',''),
								(3,11,'',''),
								(3,12,'',''),
								(3,13,'',''),
								(3,14,'',''),
								(3,15,'',''),
								(3,16,'',''),
								(3,17,'',''),
								(3,18,'',''),
								(3,19,'',''),
								(3,20,'','')

select * from Archives_check


--通知公告
create table Notice(
 id int primary key identity(1,1),--ID
 title varchar(100),--标题
 content text,--内容
 Reletime datetime default(getdate()),--发布时间
 Relepeople  int --发布人
)
go

--作息时间表
create table Worktime(
 id int primary key identity(1,1),--ID
 Serial int,--序号
 interval varchar(100),--时段
 section varchar(100),--节序
 wtime varchar(100), --时间
  wNote text, --备注
)
go

insert into Worktime values (1,'早上','起床','6：30',''),
							(2,'早午','早操/早读','7：10--7：40',''),
							(3,'早上','早餐','7：40--8：30',''),
							(4,'上午','第一节课','8：30--9：10',''),
							(5,'上午','第二节课','9：20--10：00',''),
							(4,'上午','课间时间','10：00--10：15',''),
							(6,'上午','第三节课','10：15--10：55',''),
							(7,'上午','第四节课','11：05--11：45',''),
							(8,'中午','放学/中餐','11：50--12：20',''),
							(9,'中午','午休','12：20--13：40',''),
							(10,'中午','起床时间','13：40',''),
							(11,'下午','第一节课','14：00--14：40',''),
							(13,'下午','第二节课','14:50--15:30',''),
							(15,'下午','第三节课','15：40--16：20',''),
							(16,'下午','放学/晚餐','16：30--18：30',''),
							(17,'晚上','第一节晚自习','19：00--19：40',''),
							(18,'晚上','第二节晚自习','19：50--20：30',''),
							(19,'晚上','放学/自由时间','20：30--10：30',''),
							(20,'晚上','熄灯时间','10：30','')
select * from 	Worktime						

--管理人员
create table adm(
 id int primary key identity(1,1),--ID
 department varchar(20),--部门
 adname varchar(20),--姓名
 adpost varchar(20),--职务
 adphone varchar(20),--办公电话
 Mailbox varchar(20),--电子邮箱
 adNote text,--岗位备注
)
go
insert into adm values  ('财务部','梁光健','部门组长','0776118','1342344@qq.com',''),
						('后勤部','李泽望','部门组长','0776228','3431234@qq.com',''),
						('校党部','韦邦杠','部门组长','0776338','122234@qq.com',''),
						('教务部','欧一乐','部门组长','0776448','18543234@qq.com',''),
						('科研部','陈胜','部门组长','0776558','6331234@qq.com',''),
						('教导部','张兰邓','部门组长','0776668','21325234@qq.com','')
					
--公共下载
create table download(
 id int primary key,--ID
 title varchar(100),--标题
Reletime datetime default(getdate()),--发布时间
 link varchar(256),--文件链接
 Relepeople int --发布人
)
select* from download
go
--缴费

create table xfCost
(
id int  primary key identity(1,1),--ID
stuidxf int ,		--学号
danhao varchar(256) not null,--订单号
jysj datetime default(getdate()),--交易时间
jyqyr money, --交易前余额
jyhyr money, --交易后余额
jyyr money, --交易余额
jyfs varchar(20), --交易方式
jylx varchar(10), --交易类型
)
go
--升学表
create table sxcalss(
id int primary key identity(1,1),
stuxh int  foreign key references Studentinfo(stuId),
sxqbj  varchar(20),
sxhbj int ,
 zt varchar(10),
 sxsj datetime ,
 bz  varchar(256),
)
go
--备份表
--backup database carddb to disk='d:/carddb.bak'
--restore database carddb from disk='d:/carddb.bak'
create table bf(
id int primary key identity(1,1),
bfsj datetime default(getdate()),--备份时间
bflq nvarchar(256),--备份路径
hysj  datetime--还原时间
)
go
select * from sxcalss


/*
Navicat MySQL Data Transfer

Source Server         : 本机
Source Server Version : 50133
Source Host           : localhost:3306
Source Database       : testdispatchsys

Target Server Type    : MYSQL
Target Server Version : 50133
File Encoding         : 65001

Date: 2013-04-17 11:51:12
*/


-- ----------------------------
-- Table structure for  s_area_code 
-- ----------------------------
DROP TABLE IF EXISTS  s_area_code ;
CREATE TABLE  s_area_code  (
   ID  int  PRIMARY KEY NOT NULL,
   areaCode  int NOT NULL,
   province  varchar(50) NOT NULL,
   city  varchar(50) NOT NULL,
   district  varchar(50) NOT NULL,
   detail  varchar(100) NOT NULL,
) 

-- ----------------------------
-- Records of s_area_code
-- ----------------------------
INSERT INTO  s_area_code  VALUES ('1', '110000', '北京市', '北京市', '', '北京市');
INSERT INTO  s_area_code  VALUES ('2', '110100', '北京市', '北京市', '市辖区', '北京市市辖区');
INSERT INTO  s_area_code  VALUES ('3', '110101', '北京市', '北京市', '东城区', '北京市东城区');
INSERT INTO  s_area_code  VALUES ('4', '110102', '北京市', '北京市', '西城区', '北京市西城区');
INSERT INTO  s_area_code  VALUES ('5', '110103', '北京市', '北京市', '崇文区', '北京市崇文区');
INSERT INTO  s_area_code  VALUES ('6', '110104', '北京市', '北京市', '宣武区', '北京市宣武区');
INSERT INTO  s_area_code  VALUES ('7', '110105', '北京市', '北京市', '朝阳区', '北京市朝阳区');
INSERT INTO  s_area_code  VALUES ('8', '110106', '北京市', '北京市', '丰台区', '北京市丰台区');
INSERT INTO  s_area_code  VALUES ('9', '110107', '北京市', '北京市', '石景山区', '北京市石景山区');
INSERT INTO  s_area_code  VALUES ('10', '110108', '北京市', '北京市', '海淀区', '北京市海淀区');
INSERT INTO  s_area_code  VALUES ('11', '110109', '北京市', '北京市', '门头沟区', '北京市门头沟区');
INSERT INTO  s_area_code  VALUES ('12', '110111', '北京市', '北京市', '房山区', '北京市房山区');
INSERT INTO  s_area_code  VALUES ('13', '110112', '北京市', '北京市', '通州区', '北京市通州区');
INSERT INTO  s_area_code  VALUES ('14', '110113', '北京市', '北京市', '顺义区', '北京市顺义区');
INSERT INTO  s_area_code  VALUES ('15', '110114', '北京市', '北京市', '昌平区', '北京市昌平区');
INSERT INTO  s_area_code  VALUES ('16', '110115', '北京市', '北京市', '大兴区', '北京市大兴区');
INSERT INTO  s_area_code  VALUES ('17', '110116', '北京市', '北京市', '怀柔区', '北京市怀柔区');
INSERT INTO  s_area_code  VALUES ('18', '110117', '北京市', '北京市', '平谷区', '北京市平谷区');
INSERT INTO  s_area_code  VALUES ('19', '110200', '北京市', '北京市', '县', '北京市县');
INSERT INTO  s_area_code  VALUES ('20', '110228', '北京市', '北京市', '密云县', '北京市密云县');
INSERT INTO  s_area_code  VALUES ('21', '110229', '北京市', '北京市', '延庆县', '北京市延庆县');
INSERT INTO  s_area_code  VALUES ('22', '120000', '天津市', '天津市', '', '天津市');
INSERT INTO  s_area_code  VALUES ('23', '120100', '天津市', '天津市', '市辖区', '天津市市辖区');
INSERT INTO  s_area_code  VALUES ('24', '120101', '天津市', '天津市', '和平区', '天津市和平区');
INSERT INTO  s_area_code  VALUES ('25', '120102', '天津市', '天津市', '河东区', '天津市河东区');
INSERT INTO  s_area_code  VALUES ('26', '120103', '天津市', '天津市', '河西区', '天津市河西区');
INSERT INTO  s_area_code  VALUES ('27', '120104', '天津市', '天津市', '南开区', '天津市南开区');
INSERT INTO  s_area_code  VALUES ('28', '120105', '天津市', '天津市', '河北区', '天津市河北区');
INSERT INTO  s_area_code  VALUES ('29', '120106', '天津市', '天津市', '红桥区', '天津市红桥区');
INSERT INTO  s_area_code  VALUES ('30', '120107', '天津市', '天津市', '塘沽区', '天津市塘沽区');
INSERT INTO  s_area_code  VALUES ('31', '120108', '天津市', '天津市', '汉沽区', '天津市汉沽区');
INSERT INTO  s_area_code  VALUES ('32', '120109', '天津市', '天津市', '大港区', '天津市大港区');
INSERT INTO  s_area_code  VALUES ('33', '120110', '天津市', '天津市', '东丽区', '天津市东丽区');
INSERT INTO  s_area_code  VALUES ('34', '120111', '天津市', '天津市', '西青区', '天津市西青区');
INSERT INTO  s_area_code  VALUES ('35', '120112', '天津市', '天津市', '津南区', '天津市津南区');
INSERT INTO  s_area_code  VALUES ('36', '120113', '天津市', '天津市', '北辰区', '天津市北辰区');
INSERT INTO  s_area_code  VALUES ('37', '120114', '天津市', '天津市', '武清区', '天津市武清区');
INSERT INTO  s_area_code  VALUES ('38', '120115', '天津市', '天津市', '宝坻区', '天津市宝坻区');
INSERT INTO  s_area_code  VALUES ('39', '120200', '天津市', '天津市', '县', '天津市县');
INSERT INTO  s_area_code  VALUES ('40', '120221', '天津市', '天津市', '宁河县', '天津市宁河县');
INSERT INTO  s_area_code  VALUES ('41', '120222', '天津市', '天津市', '武清县', '天津市武清县');
INSERT INTO  s_area_code  VALUES ('42', '120223', '天津市', '天津市', '静海县', '天津市静海县');
INSERT INTO  s_area_code  VALUES ('43', '120225', '天津市', '天津市', '蓟县', '天津市蓟县');
INSERT INTO  s_area_code  VALUES ('44', '130000', '河北省', '', '', '河北省');
INSERT INTO  s_area_code  VALUES ('45', '130100', '河北省', '石家庄市', '', '河北省石家庄市');
INSERT INTO  s_area_code  VALUES ('46', '130101', '河北省', '石家庄市', '市辖区', '河北省石家庄市市辖区');
INSERT INTO  s_area_code  VALUES ('47', '130102', '河北省', '石家庄市', '长安区', '河北省石家庄市长安区');
INSERT INTO  s_area_code  VALUES ('48', '130103', '河北省', '石家庄市', '桥东区', '河北省石家庄市桥东区');
INSERT INTO  s_area_code  VALUES ('49', '130104', '河北省', '石家庄市', '桥西区', '河北省石家庄市桥西区');
INSERT INTO  s_area_code  VALUES ('50', '130105', '河北省', '石家庄市', '新华区', '河北省石家庄市新华区');
INSERT INTO  s_area_code  VALUES ('51', '130107', '河北省', '石家庄市', '井陉矿区', '河北省石家庄市井陉矿区');
INSERT INTO  s_area_code  VALUES ('52', '130108', '河北省', '石家庄市', '裕华区', '河北省石家庄市裕华区');
INSERT INTO  s_area_code  VALUES ('53', '130121', '河北省', '石家庄市', '井陉县', '河北省石家庄市井陉县');
INSERT INTO  s_area_code  VALUES ('54', '130123', '河北省', '石家庄市', '正定县', '河北省石家庄市正定县');
INSERT INTO  s_area_code  VALUES ('55', '130124', '河北省', '石家庄市', '栾城县', '河北省石家庄市栾城县');
INSERT INTO  s_area_code  VALUES ('56', '130125', '河北省', '石家庄市', '行唐县', '河北省石家庄市行唐县');
INSERT INTO  s_area_code  VALUES ('57', '130126', '河北省', '石家庄市', '灵寿县', '河北省石家庄市灵寿县');
INSERT INTO  s_area_code  VALUES ('58', '130127', '河北省', '石家庄市', '高邑县', '河北省石家庄市高邑县');
INSERT INTO  s_area_code  VALUES ('59', '130128', '河北省', '石家庄市', '深泽县', '河北省石家庄市深泽县');
INSERT INTO  s_area_code  VALUES ('60', '130129', '河北省', '石家庄市', '赞皇县', '河北省石家庄市赞皇县');
INSERT INTO  s_area_code  VALUES ('61', '130130', '河北省', '石家庄市', '无极县', '河北省石家庄市无极县');
INSERT INTO  s_area_code  VALUES ('62', '130131', '河北省', '石家庄市', '平山县', '河北省石家庄市平山县');
INSERT INTO  s_area_code  VALUES ('63', '130132', '河北省', '石家庄市', '元氏县', '河北省石家庄市元氏县');
INSERT INTO  s_area_code  VALUES ('64', '130133', '河北省', '石家庄市', '赵 县', '河北省赵 县');
INSERT INTO  s_area_code  VALUES ('65', '130181', '河北省', '石家庄市', '辛集市', '河北省辛集市');
INSERT INTO  s_area_code  VALUES ('66', '130182', '河北省', '石家庄市', '藁城市', '河北省藁城市');
INSERT INTO  s_area_code  VALUES ('67', '130183', '河北省', '石家庄市', '晋州市', '河北省晋州市');
INSERT INTO  s_area_code  VALUES ('68', '130184', '河北省', '石家庄市', '新乐市', '河北省新乐市');
INSERT INTO  s_area_code  VALUES ('69', '130185', '河北省', '石家庄市', '鹿泉市', '河北省鹿泉市');
INSERT INTO  s_area_code  VALUES ('70', '130200', '河北省', '唐山市', '', '河北省唐山市');
INSERT INTO  s_area_code  VALUES ('71', '130201', '河北省', '唐山市', '市辖区', '河北省唐山市市辖区');
INSERT INTO  s_area_code  VALUES ('72', '130202', '河北省', '唐山市', '路南区', '河北省唐山市路南区');
INSERT INTO  s_area_code  VALUES ('73', '130203', '河北省', '唐山市', '路北区', '河北省唐山市路北区');
INSERT INTO  s_area_code  VALUES ('74', '130204', '河北省', '唐山市', '古冶区', '河北省唐山市古冶区');
INSERT INTO  s_area_code  VALUES ('75', '130205', '河北省', '唐山市', '开平区', '河北省唐山市开平区');
INSERT INTO  s_area_code  VALUES ('76', '130207', '河北省', '唐山市', '丰南区', '河北省唐山市丰南区');
INSERT INTO  s_area_code  VALUES ('77', '130208', '河北省', '唐山市', '丰润区', '河北省唐山市丰润区');
INSERT INTO  s_area_code  VALUES ('78', '130223', '河北省', '唐山市', '滦 县', '河北省滦 县');
INSERT INTO  s_area_code  VALUES ('79', '130224', '河北省', '唐山市', '滦南县', '河北省滦南县');
INSERT INTO  s_area_code  VALUES ('80', '130225', '河北省', '唐山市', '乐亭县', '河北省乐亭县');
INSERT INTO  s_area_code  VALUES ('81', '130227', '河北省', '唐山市', '迁西县', '河北省迁西县');
INSERT INTO  s_area_code  VALUES ('82', '130229', '河北省', '唐山市', '玉田县', '河北省玉田县');
INSERT INTO  s_area_code  VALUES ('83', '130230', '河北省', '唐山市', '唐海县', '河北省唐海县');
INSERT INTO  s_area_code  VALUES ('84', '130281', '河北省', '唐山市', '遵化市', '河北省遵化市');
INSERT INTO  s_area_code  VALUES ('85', '130283', '河北省', '唐山市', '迁安市', '河北省迁安市');
INSERT INTO  s_area_code  VALUES ('86', '130300', '河北省', '秦皇岛市', '', '河北省秦皇岛市');
INSERT INTO  s_area_code  VALUES ('87', '130301', '河北省', '秦皇岛市', '市辖区', '河北省秦皇岛市市辖区');
INSERT INTO  s_area_code  VALUES ('88', '130302', '河北省', '秦皇岛市', '海港区', '河北省秦皇岛市海港区');
INSERT INTO  s_area_code  VALUES ('89', '130303', '河北省', '秦皇岛市', '山海关区', '河北省秦皇岛市山海关区');
INSERT INTO  s_area_code  VALUES ('90', '130304', '河北省', '秦皇岛市', '北戴河区', '河北省秦皇岛市北戴河区');
INSERT INTO  s_area_code  VALUES ('91', '130321', '河北省', '秦皇岛市', '青龙满族自治县', '河北省青龙满族自治县');
INSERT INTO  s_area_code  VALUES ('92', '130322', '河北省', '秦皇岛市', '昌黎县', '河北省昌黎县');
INSERT INTO  s_area_code  VALUES ('93', '130323', '河北省', '秦皇岛市', '抚宁县', '河北省抚宁县');
INSERT INTO  s_area_code  VALUES ('94', '130324', '河北省', '秦皇岛市', '卢龙县', '河北省卢龙县');
INSERT INTO  s_area_code  VALUES ('95', '130400', '河北省', '邯郸市', '邯郸市', '河北省邯郸市');
INSERT INTO  s_area_code  VALUES ('96', '130401', '河北省', '邯郸市', '市辖区', '河北省邯郸市市辖区');
INSERT INTO  s_area_code  VALUES ('97', '130402', '河北省', '邯郸市', '邯山区', '河北省邯郸市邯山区');
INSERT INTO  s_area_code  VALUES ('98', '130403', '河北省', '邯郸市', '丛台区', '河北省邯郸市丛台区');
INSERT INTO  s_area_code  VALUES ('99', '130404', '河北省', '邯郸市', '复兴区', '河北省邯郸市复兴区');
INSERT INTO  s_area_code  VALUES ('100', '130406', '河北省', '邯郸市', '峰峰矿区', '河北省邯郸市峰峰矿区');
INSERT INTO  s_area_code  VALUES ('101', '130421', '河北省', '邯郸市', '邯郸县', '河北省邯郸县');
INSERT INTO  s_area_code  VALUES ('102', '130423', '河北省', '邯郸市', '临漳县', '河北省临漳县');
INSERT INTO  s_area_code  VALUES ('103', '130424', '河北省', '邯郸市', '成安县', '河北省成安县');
INSERT INTO  s_area_code  VALUES ('104', '130425', '河北省', '邯郸市', '大名县', '河北省大名县');
INSERT INTO  s_area_code  VALUES ('105', '130426', '河北省', '邯郸市', '涉 县', '河北省涉 县');
INSERT INTO  s_area_code  VALUES ('106', '130427', '河北省', '邯郸市', '磁 县', '河北省磁 县');
INSERT INTO  s_area_code  VALUES ('107', '130428', '河北省', '邯郸市', '肥乡县', '河北省肥乡县');
INSERT INTO  s_area_code  VALUES ('108', '130429', '河北省', '邯郸市', '永年县', '河北省永年县');
INSERT INTO  s_area_code  VALUES ('109', '130430', '河北省', '邯郸市', '邱 县', '河北省邱 县');
INSERT INTO  s_area_code  VALUES ('110', '130431', '河北省', '邯郸市', '鸡泽县', '河北省鸡泽县');
INSERT INTO  s_area_code  VALUES ('111', '130432', '河北省', '邯郸市', '广平县', '河北省广平县');
INSERT INTO  s_area_code  VALUES ('112', '130433', '河北省', '邯郸市', '馆陶县', '河北省馆陶县');
INSERT INTO  s_area_code  VALUES ('113', '130434', '河北省', '邯郸市', '魏 县', '河北省魏 县');
INSERT INTO  s_area_code  VALUES ('114', '130435', '河北省', '邯郸市', '曲周县', '河北省曲周县');
INSERT INTO  s_area_code  VALUES ('115', '130481', '河北省', '邯郸市', '武安市', '河北省武安市');
INSERT INTO  s_area_code  VALUES ('116', '130500', '河北省', '邢台市', '', '河北省邢台市');
INSERT INTO  s_area_code  VALUES ('117', '130501', '河北省', '邢台市', '市辖区', '河北省邢台市市辖区');
INSERT INTO  s_area_code  VALUES ('118', '130502', '河北省', '邢台市', '桥东区', '河北省邢台市桥东区');
INSERT INTO  s_area_code  VALUES ('119', '130503', '河北省', '邢台市', '桥西区', '河北省邢台市桥西区');
INSERT INTO  s_area_code  VALUES ('120', '130521', '河北省', '邢台市', '邢台县', '河北省邢台县');
INSERT INTO  s_area_code  VALUES ('121', '130522', '河北省', '邢台市', '临城县', '河北省临城县');
INSERT INTO  s_area_code  VALUES ('122', '130523', '河北省', '邢台市', '内丘县', '河北省内丘县');
INSERT INTO  s_area_code  VALUES ('123', '130524', '河北省', '邢台市', '柏乡县', '河北省柏乡县');
INSERT INTO  s_area_code  VALUES ('124', '130525', '河北省', '邢台市', '隆尧县', '河北省隆尧县');
INSERT INTO  s_area_code  VALUES ('125', '130526', '河北省', '邢台市', '任 县', '河北省任 县');
INSERT INTO  s_area_code  VALUES ('126', '130527', '河北省', '邢台市', '南和县', '河北省南和县');
INSERT INTO  s_area_code  VALUES ('127', '130528', '河北省', '邢台市', '宁晋县', '河北省宁晋县');
INSERT INTO  s_area_code  VALUES ('128', '130529', '河北省', '邢台市', '巨鹿县', '河北省巨鹿县');
INSERT INTO  s_area_code  VALUES ('129', '130530', '河北省', '邢台市', '新河县', '河北省新河县');
INSERT INTO  s_area_code  VALUES ('130', '130531', '河北省', '邢台市', '广宗县', '河北省广宗县');
INSERT INTO  s_area_code  VALUES ('131', '130532', '河北省', '邢台市', '平乡县', '河北省平乡县');
INSERT INTO  s_area_code  VALUES ('132', '130533', '河北省', '邢台市', '威 县', '河北省威 县');
INSERT INTO  s_area_code  VALUES ('133', '130534', '河北省', '邢台市', '清河县', '河北省清河县');
INSERT INTO  s_area_code  VALUES ('134', '130535', '河北省', '邢台市', '临西县', '河北省临西县');
INSERT INTO  s_area_code  VALUES ('135', '130581', '河北省', '邢台市', '南宫市', '河北省南宫市');
INSERT INTO  s_area_code  VALUES ('136', '130582', '河北省', '邢台市', '沙河市', '河北省沙河市');
INSERT INTO  s_area_code  VALUES ('137', '130600', '河北省', '保定市', '', '河北省保定市');
INSERT INTO  s_area_code  VALUES ('138', '130601', '河北省', '保定市', '市辖区', '河北省保定市市辖区');
INSERT INTO  s_area_code  VALUES ('139', '130602', '河北省', '保定市', '新市区', '河北省保定市新市区');
INSERT INTO  s_area_code  VALUES ('140', '130603', '河北省', '保定市', '北市区', '河北省保定市北市区');
INSERT INTO  s_area_code  VALUES ('141', '130604', '河北省', '保定市', '南市区', '河北省保定市南市区');
INSERT INTO  s_area_code  VALUES ('142', '130621', '河北省', '保定市', '满城县', '河北省满城县');
INSERT INTO  s_area_code  VALUES ('143', '130622', '河北省', '保定市', '清苑县', '河北省清苑县');
INSERT INTO  s_area_code  VALUES ('144', '130623', '河北省', '保定市', '涞水县', '河北省涞水县');
INSERT INTO  s_area_code  VALUES ('145', '130624', '河北省', '保定市', '阜平县', '河北省阜平县');
INSERT INTO  s_area_code  VALUES ('146', '130625', '河北省', '保定市', '徐水县', '河北省徐水县');
INSERT INTO  s_area_code  VALUES ('147', '130626', '河北省', '保定市', '定兴县', '河北省定兴县');
INSERT INTO  s_area_code  VALUES ('148', '130627', '河北省', '保定市', '唐 县', '河北省唐 县');
INSERT INTO  s_area_code  VALUES ('149', '130628', '河北省', '保定市', '高阳县', '河北省高阳县');
INSERT INTO  s_area_code  VALUES ('150', '130629', '河北省', '保定市', '容城县', '河北省容城县');
INSERT INTO  s_area_code  VALUES ('151', '130630', '河北省', '保定市', '涞源县', '河北省涞源县');
INSERT INTO  s_area_code  VALUES ('152', '130631', '河北省', '保定市', '望都县', '河北省望都县');
INSERT INTO  s_area_code  VALUES ('153', '130632', '河北省', '保定市', '安新县', '河北省安新县');
INSERT INTO  s_area_code  VALUES ('154', '130633', '河北省', '保定市', '易 县', '河北省易 县');
INSERT INTO  s_area_code  VALUES ('155', '130634', '河北省', '保定市', '曲阳县', '河北省曲阳县');
INSERT INTO  s_area_code  VALUES ('156', '130635', '河北省', '保定市', '蠡 县', '河北省蠡 县');
INSERT INTO  s_area_code  VALUES ('157', '130636', '河北省', '保定市', '顺平县', '河北省顺平县');
INSERT INTO  s_area_code  VALUES ('158', '130637', '河北省', '保定市', '博野县', '河北省博野县');
INSERT INTO  s_area_code  VALUES ('159', '130638', '河北省', '保定市', '雄 县', '河北省雄 县');
INSERT INTO  s_area_code  VALUES ('160', '130681', '河北省', '保定市', '涿州市', '河北省涿州市');
INSERT INTO  s_area_code  VALUES ('161', '130682', '河北省', '保定市', '定州市', '河北省定州市');
INSERT INTO  s_area_code  VALUES ('162', '130683', '河北省', '保定市', '安国市', '河北省安国市');
INSERT INTO  s_area_code  VALUES ('163', '130684', '河北省', '保定市', '高碑店市', '河北省高碑店市');
INSERT INTO  s_area_code  VALUES ('164', '130700', '河北省', '张家口市', '', '河北省张家口市');
INSERT INTO  s_area_code  VALUES ('165', '130701', '河北省', '张家口市', '市辖区', '河北省张家口市市辖区');
INSERT INTO  s_area_code  VALUES ('166', '130702', '河北省', '张家口市', '桥东区', '河北省张家口市桥东区');
INSERT INTO  s_area_code  VALUES ('167', '130703', '河北省', '张家口市', '桥西区', '河北省张家口市桥西区');
INSERT INTO  s_area_code  VALUES ('168', '130705', '河北省', '张家口市', '宣化区', '河北省张家口市宣化区');
INSERT INTO  s_area_code  VALUES ('169', '130706', '河北省', '张家口市', '下花园区', '河北省张家口市下花园区');
INSERT INTO  s_area_code  VALUES ('170', '130721', '河北省', '张家口市', '宣化县', '河北省宣化县');
INSERT INTO  s_area_code  VALUES ('171', '130722', '河北省', '张家口市', '张北县', '河北省张北县');
INSERT INTO  s_area_code  VALUES ('172', '130723', '河北省', '张家口市', '康保县', '河北省康保县');
INSERT INTO  s_area_code  VALUES ('173', '130724', '河北省', '张家口市', '沽源县', '河北省沽源县');
INSERT INTO  s_area_code  VALUES ('174', '130725', '河北省', '张家口市', '尚义县', '河北省尚义县');
INSERT INTO  s_area_code  VALUES ('175', '130726', '河北省', '张家口市', '蔚 县', '河北省蔚 县');
INSERT INTO  s_area_code  VALUES ('176', '130727', '河北省', '张家口市', '阳原县', '河北省阳原县');
INSERT INTO  s_area_code  VALUES ('177', '130728', '河北省', '张家口市', '怀安县', '河北省怀安县');
INSERT INTO  s_area_code  VALUES ('178', '130729', '河北省', '张家口市', '万全县', '河北省万全县');
INSERT INTO  s_area_code  VALUES ('179', '130730', '河北省', '张家口市', '怀来县', '河北省怀来县');
INSERT INTO  s_area_code  VALUES ('180', '130731', '河北省', '张家口市', '涿鹿县', '河北省涿鹿县');
INSERT INTO  s_area_code  VALUES ('181', '130732', '河北省', '张家口市', '赤城县', '河北省赤城县');
INSERT INTO  s_area_code  VALUES ('182', '130733', '河北省', '张家口市', '崇礼县', '河北省崇礼县');
INSERT INTO  s_area_code  VALUES ('183', '130800', '河北省', '承德市', '', '河北省承德市');
INSERT INTO  s_area_code  VALUES ('184', '130801', '河北省', '承德市', '市辖区', '河北省市辖区');
INSERT INTO  s_area_code  VALUES ('185', '130802', '河北省', '承德市', '双桥区', '河北省承德市双桥区');
INSERT INTO  s_area_code  VALUES ('186', '130803', '河北省', '承德市', '双滦区', '河北省承德市双滦区');
INSERT INTO  s_area_code  VALUES ('187', '130804', '河北省', '承德市', '鹰手营子矿区', '河北省承德市鹰手营子矿区');
INSERT INTO  s_area_code  VALUES ('188', '130821', '河北省', '承德市', '承德县', '河北省承德县');
INSERT INTO  s_area_code  VALUES ('189', '130822', '河北省', '承德市', '兴隆县', '河北省兴隆县');
INSERT INTO  s_area_code  VALUES ('190', '130823', '河北省', '承德市', '平泉县', '河北省平泉县');
INSERT INTO  s_area_code  VALUES ('191', '130824', '河北省', '承德市', '滦平县', '河北省滦平县');
INSERT INTO  s_area_code  VALUES ('192', '130825', '河北省', '承德市', '隆化县', '河北省隆化县');
INSERT INTO  s_area_code  VALUES ('193', '130826', '河北省', '承德市', '丰宁满族自治县', '河北省丰宁满族自治县');
INSERT INTO  s_area_code  VALUES ('194', '130827', '河北省', '承德市', '宽城满族自治县', '河北省宽城满族自治县');
INSERT INTO  s_area_code  VALUES ('195', '130828', '河北省', '承德市', '围场满族蒙古族自治县', '河北省围场满族蒙古族自治县');
INSERT INTO  s_area_code  VALUES ('196', '130900', '河北省', '沧州市', '', '河北省沧州市');
INSERT INTO  s_area_code  VALUES ('197', '130901', '河北省', '沧州市', '市辖区', '河北省沧州市市辖区');
INSERT INTO  s_area_code  VALUES ('198', '130902', '河北省', '沧州市', '新华区', '河北省沧州市新华区');
INSERT INTO  s_area_code  VALUES ('199', '130903', '河北省', '沧州市', '运河区', '河北省沧州市运河区');
INSERT INTO  s_area_code  VALUES ('200', '130921', '河北省', '沧州市', '沧 县', '河北省沧 县');
INSERT INTO  s_area_code  VALUES ('201', '130922', '河北省', '沧州市', '青 县', '河北省青 县');
INSERT INTO  s_area_code  VALUES ('202', '130923', '河北省', '沧州市', '东光县', '河北省东光县');
INSERT INTO  s_area_code  VALUES ('203', '130924', '河北省', '沧州市', '海兴县', '河北省海兴县');
INSERT INTO  s_area_code  VALUES ('204', '130925', '河北省', '沧州市', '盐山县', '河北省盐山县');
INSERT INTO  s_area_code  VALUES ('205', '130926', '河北省', '沧州市', '肃宁县', '河北省肃宁县');
INSERT INTO  s_area_code  VALUES ('206', '130927', '河北省', '沧州市', '南皮县', '河北省南皮县');
INSERT INTO  s_area_code  VALUES ('207', '130928', '河北省', '沧州市', '吴桥县', '河北省吴桥县');
INSERT INTO  s_area_code  VALUES ('208', '130929', '河北省', '沧州市', '献 县', '河北省献 县');
INSERT INTO  s_area_code  VALUES ('209', '130930', '河北省', '沧州市', '孟村回族自治县', '河北省孟村回族自治县');
INSERT INTO  s_area_code  VALUES ('210', '130981', '河北省', '沧州市', '泊头市', '河北省泊头市');
INSERT INTO  s_area_code  VALUES ('211', '130982', '河北省', '沧州市', '任丘市', '河北省任丘市');
INSERT INTO  s_area_code  VALUES ('212', '130983', '河北省', '沧州市', '黄骅市', '河北省黄骅市');
INSERT INTO  s_area_code  VALUES ('213', '130984', '河北省', '沧州市', '河间市', '河北省河间市');
INSERT INTO  s_area_code  VALUES ('214', '131000', '河北省', '廊坊市', '', '河北省廊坊市');
INSERT INTO  s_area_code  VALUES ('215', '131001', '河北省', '廊坊市', '市辖区', '河北省廊坊市市辖区');
INSERT INTO  s_area_code  VALUES ('216', '131002', '河北省', '廊坊市', '安次区', '河北省廊坊市安次区');
INSERT INTO  s_area_code  VALUES ('217', '131003', '河北省', '廊坊市', '广阳区', '河北省廊坊市广阳区');
INSERT INTO  s_area_code  VALUES ('218', '131022', '河北省', '廊坊市', '固安县', '河北省固安县');
INSERT INTO  s_area_code  VALUES ('219', '131023', '河北省', '廊坊市', '永清县', '河北省永清县');
INSERT INTO  s_area_code  VALUES ('220', '131024', '河北省', '廊坊市', '香河县', '河北省香河县');
INSERT INTO  s_area_code  VALUES ('221', '131025', '河北省', '廊坊市', '大城县', '河北省大城县');
INSERT INTO  s_area_code  VALUES ('222', '131026', '河北省', '廊坊市', '文安县', '河北省文安县');
INSERT INTO  s_area_code  VALUES ('223', '131028', '河北省', '廊坊市', '大厂回族自治县', '河北省大厂回族自治县');
INSERT INTO  s_area_code  VALUES ('224', '131081', '河北省', '廊坊市', '霸州市', '河北省霸州市');
INSERT INTO  s_area_code  VALUES ('225', '131082', '河北省', '廊坊市', '三河市', '河北省三河市');
INSERT INTO  s_area_code  VALUES ('226', '131100', '河北省', '衡水市', '', '河北省衡水市');
INSERT INTO  s_area_code  VALUES ('227', '131101', '河北省', '衡水市', '市辖区', '河北省市辖区');
INSERT INTO  s_area_code  VALUES ('228', '131102', '河北省', '衡水市', '桃城区', '河北省衡水市桃城区');
INSERT INTO  s_area_code  VALUES ('229', '131121', '河北省', '衡水市', '枣强县', '河北省枣强县');
INSERT INTO  s_area_code  VALUES ('230', '131122', '河北省', '衡水市', '武邑县', '河北省武邑县');
INSERT INTO  s_area_code  VALUES ('231', '131123', '河北省', '衡水市', '武强县', '河北省武强县');
INSERT INTO  s_area_code  VALUES ('232', '131124', '河北省', '衡水市', '饶阳县', '河北省饶阳县');
INSERT INTO  s_area_code  VALUES ('233', '131125', '河北省', '衡水市', '安平县', '河北省安平县');
INSERT INTO  s_area_code  VALUES ('234', '131126', '河北省', '衡水市', '故城县', '河北省故城县');
INSERT INTO  s_area_code  VALUES ('235', '131127', '河北省', '衡水市', '景 县', '河北省景 县');
INSERT INTO  s_area_code  VALUES ('236', '131128', '河北省', '衡水市', '阜城县', '河北省阜城县');
INSERT INTO  s_area_code  VALUES ('237', '131181', '河北省', '衡水市', '冀州市', '河北省冀州市');
INSERT INTO  s_area_code  VALUES ('238', '131182', '河北省', '衡水市', '深州市', '河北省深州市');
INSERT INTO  s_area_code  VALUES ('239', '140000', '山西省', '', '', '山西省');
INSERT INTO  s_area_code  VALUES ('240', '140100', '山西省', '太原市', '', '山西省太原市');
INSERT INTO  s_area_code  VALUES ('241', '140101', '山西省', '太原市', '市辖区', '山西省市辖区');
INSERT INTO  s_area_code  VALUES ('242', '140105', '山西省', '太原市', '小店区', '山西省太原市小店区');
INSERT INTO  s_area_code  VALUES ('243', '140106', '山西省', '太原市', '迎泽区', '山西省太原市迎泽区');
INSERT INTO  s_area_code  VALUES ('244', '140107', '山西省', '太原市', '杏花岭区', '山西省太原市杏花岭区');
INSERT INTO  s_area_code  VALUES ('245', '140108', '山西省', '太原市', '尖草坪区', '山西省太原市尖草坪区');
INSERT INTO  s_area_code  VALUES ('246', '140109', '山西省', '太原市', '万柏林区', '山西省太原市万柏林区');
INSERT INTO  s_area_code  VALUES ('247', '140110', '山西省', '太原市', '晋源区', '山西省太原市晋源区');
INSERT INTO  s_area_code  VALUES ('248', '140121', '山西省', '太原市', '清徐县', '山西省清徐县');
INSERT INTO  s_area_code  VALUES ('249', '140122', '山西省', '太原市', '阳曲县', '山西省阳曲县');
INSERT INTO  s_area_code  VALUES ('250', '140123', '山西省', '太原市', '娄烦县', '山西省娄烦县');
INSERT INTO  s_area_code  VALUES ('251', '140181', '山西省', '太原市', '古交市', '山西省古交市');
INSERT INTO  s_area_code  VALUES ('252', '140200', '山西省', '大同市', '', '山西省大同市');
INSERT INTO  s_area_code  VALUES ('253', '140201', '山西省', '大同市', '市辖区', '山西省大同市市辖区');
INSERT INTO  s_area_code  VALUES ('254', '140202', '山西省', '大同市', '城 区', '山西省大同市城 区');
INSERT INTO  s_area_code  VALUES ('255', '140203', '山西省', '大同市', '矿 区', '山西省大同市矿 区');
INSERT INTO  s_area_code  VALUES ('256', '140211', '山西省', '大同市', '南郊区', '山西省大同市南郊区');
INSERT INTO  s_area_code  VALUES ('257', '140212', '山西省', '大同市', '新荣区', '山西省大同市新荣区');
INSERT INTO  s_area_code  VALUES ('258', '140221', '山西省', '大同市', '阳高县', '山西省阳高县');
INSERT INTO  s_area_code  VALUES ('259', '140222', '山西省', '大同市', '天镇县', '山西省天镇县');
INSERT INTO  s_area_code  VALUES ('260', '140223', '山西省', '大同市', '广灵县', '山西省广灵县');
INSERT INTO  s_area_code  VALUES ('261', '140224', '山西省', '大同市', '灵丘县', '山西省灵丘县');
INSERT INTO  s_area_code  VALUES ('262', '140225', '山西省', '大同市', '浑源县', '山西省浑源县');
INSERT INTO  s_area_code  VALUES ('263', '140226', '山西省', '大同市', '左云县', '山西省左云县');
INSERT INTO  s_area_code  VALUES ('264', '140227', '山西省', '大同市', '大同县', '山西省大同县');
INSERT INTO  s_area_code  VALUES ('265', '140300', '山西省', '阳泉市', '', '山西省阳泉市');
INSERT INTO  s_area_code  VALUES ('266', '140301', '山西省', '阳泉市', '市辖区', '山西省阳泉市市辖区');
INSERT INTO  s_area_code  VALUES ('267', '140302', '山西省', '阳泉市', '城 区', '山西省阳泉市城 区');
INSERT INTO  s_area_code  VALUES ('268', '140303', '山西省', '阳泉市', '矿 区', '山西省阳泉市矿 区');
INSERT INTO  s_area_code  VALUES ('269', '140311', '山西省', '阳泉市', '郊 区', '山西省阳泉市郊 区');
INSERT INTO  s_area_code  VALUES ('270', '140321', '山西省', '阳泉市', '平定县', '山西省平定县');
INSERT INTO  s_area_code  VALUES ('271', '140322', '山西省', '阳泉市', '盂 县', '山西省盂 县');
INSERT INTO  s_area_code  VALUES ('272', '140400', '山西省', '长治市', '', '山西省长治市');
INSERT INTO  s_area_code  VALUES ('273', '140401', '山西省', '长治市', '市辖区', '山西省长治市市辖区');
INSERT INTO  s_area_code  VALUES ('274', '140402', '山西省', '长治市', '城 区', '山西省长治市城 区');
INSERT INTO  s_area_code  VALUES ('275', '140411', '山西省', '长治市', '郊 区', '山西省长治市郊 区');
INSERT INTO  s_area_code  VALUES ('276', '140421', '山西省', '长治市', '长治县', '山西省长治县');
INSERT INTO  s_area_code  VALUES ('277', '140423', '山西省', '长治市', '襄垣县', '山西省襄垣县');
INSERT INTO  s_area_code  VALUES ('278', '140424', '山西省', '长治市', '屯留县', '山西省屯留县');
INSERT INTO  s_area_code  VALUES ('279', '140425', '山西省', '长治市', '平顺县', '山西省平顺县');
INSERT INTO  s_area_code  VALUES ('280', '140426', '山西省', '长治市', '黎城县', '山西省黎城县');
INSERT INTO  s_area_code  VALUES ('281', '140427', '山西省', '长治市', '壶关县', '山西省壶关县');
INSERT INTO  s_area_code  VALUES ('282', '140428', '山西省', '长治市', '长子县', '山西省长子县');
INSERT INTO  s_area_code  VALUES ('283', '140429', '山西省', '长治市', '武乡县', '山西省武乡县');
INSERT INTO  s_area_code  VALUES ('284', '140430', '山西省', '长治市', '沁 县', '山西省沁 县');
INSERT INTO  s_area_code  VALUES ('285', '140431', '山西省', '长治市', '沁源县', '山西省沁源县');
INSERT INTO  s_area_code  VALUES ('286', '140481', '山西省', '长治市', '潞城市', '山西省潞城市');
INSERT INTO  s_area_code  VALUES ('287', '140500', '山西省', '晋城市', '', '山西省晋城市');
INSERT INTO  s_area_code  VALUES ('288', '140501', '山西省', '晋城市', '市辖区', '山西省晋城市市辖区');
INSERT INTO  s_area_code  VALUES ('289', '140502', '山西省', '晋城市', '城 区', '山西省晋城市城 区');
INSERT INTO  s_area_code  VALUES ('290', '140521', '山西省', '晋城市', '沁水县', '山西省沁水县');
INSERT INTO  s_area_code  VALUES ('291', '140522', '山西省', '晋城市', '阳城县', '山西省阳城县');
INSERT INTO  s_area_code  VALUES ('292', '140524', '山西省', '晋城市', '陵川县', '山西省陵川县');
INSERT INTO  s_area_code  VALUES ('293', '140525', '山西省', '晋城市', '泽州县', '山西省泽州县');
INSERT INTO  s_area_code  VALUES ('294', '140581', '山西省', '晋城市', '高平市', '山西省高平市');
INSERT INTO  s_area_code  VALUES ('295', '140600', '山西省', '朔州市', '', '山西省朔州市');
INSERT INTO  s_area_code  VALUES ('296', '140601', '山西省', '朔州市', '市辖区', '山西省朔州市市辖区');
INSERT INTO  s_area_code  VALUES ('297', '140602', '山西省', '朔州市', '朔城区', '山西省朔州市朔城区');
INSERT INTO  s_area_code  VALUES ('298', '140603', '山西省', '朔州市', '平鲁区', '山西省朔州市平鲁区');
INSERT INTO  s_area_code  VALUES ('299', '140621', '山西省', '朔州市', '山阴县', '山西省山阴县');
INSERT INTO  s_area_code  VALUES ('300', '140622', '山西省', '朔州市', '应 县', '山西省应 县');
INSERT INTO  s_area_code  VALUES ('301', '140623', '山西省', '朔州市', '右玉县', '山西省右玉县');
INSERT INTO  s_area_code  VALUES ('302', '140624', '山西省', '朔州市', '怀仁县', '山西省怀仁县');
INSERT INTO  s_area_code  VALUES ('303', '140700', '山西省', '晋中市', '', '山西省晋中市');
INSERT INTO  s_area_code  VALUES ('304', '140701', '山西省', '晋中市', '市辖区', '山西省晋中市市辖区');
INSERT INTO  s_area_code  VALUES ('305', '140702', '山西省', '晋中市', '榆次区', '山西省晋中市榆次区');
INSERT INTO  s_area_code  VALUES ('306', '140721', '山西省', '晋中市', '榆社县', '山西省榆社县');
INSERT INTO  s_area_code  VALUES ('307', '140722', '山西省', '晋中市', '左权县', '山西省左权县');
INSERT INTO  s_area_code  VALUES ('308', '140723', '山西省', '晋中市', '和顺县', '山西省和顺县');
INSERT INTO  s_area_code  VALUES ('309', '140724', '山西省', '晋中市', '昔阳县', '山西省昔阳县');
INSERT INTO  s_area_code  VALUES ('310', '140725', '山西省', '晋中市', '寿阳县', '山西省寿阳县');
INSERT INTO  s_area_code  VALUES ('311', '140726', '山西省', '晋中市', '太谷县', '山西省太谷县');
INSERT INTO  s_area_code  VALUES ('312', '140727', '山西省', '晋中市', '祁 县', '山西省祁 县');
INSERT INTO  s_area_code  VALUES ('313', '140728', '山西省', '晋中市', '平遥县', '山西省平遥县');
INSERT INTO  s_area_code  VALUES ('314', '140729', '山西省', '晋中市', '灵石县', '山西省灵石县');
INSERT INTO  s_area_code  VALUES ('315', '140781', '山西省', '晋中市', '介休市', '山西省介休市');
INSERT INTO  s_area_code  VALUES ('316', '140800', '山西省', '运城市', '', '山西省运城市');
INSERT INTO  s_area_code  VALUES ('317', '140801', '山西省', '运城市', '市辖区', '山西省运城市市辖区');
INSERT INTO  s_area_code  VALUES ('318', '140802', '山西省', '运城市', '盐湖区', '山西省运城市盐湖区');
INSERT INTO  s_area_code  VALUES ('319', '140821', '山西省', '运城市', '临猗县', '山西省临猗县');
INSERT INTO  s_area_code  VALUES ('320', '140822', '山西省', '运城市', '万荣县', '山西省万荣县');
INSERT INTO  s_area_code  VALUES ('321', '140823', '山西省', '运城市', '闻喜县', '山西省闻喜县');
INSERT INTO  s_area_code  VALUES ('322', '140824', '山西省', '运城市', '稷山县', '山西省稷山县');
INSERT INTO  s_area_code  VALUES ('323', '140825', '山西省', '运城市', '新绛县', '山西省新绛县');
INSERT INTO  s_area_code  VALUES ('324', '140826', '山西省', '运城市', '绛县', '山西省绛县');
INSERT INTO  s_area_code  VALUES ('325', '140827', '山西省', '运城市', '垣曲县', '山西省垣曲县');
INSERT INTO  s_area_code  VALUES ('326', '140828', '山西省', '运城市', '夏县', '山西省夏县');
INSERT INTO  s_area_code  VALUES ('327', '140829', '山西省', '运城市', '平陆县', '山西省平陆县');
INSERT INTO  s_area_code  VALUES ('328', '140830', '山西省', '运城市', '芮城县', '山西省芮城县');
INSERT INTO  s_area_code  VALUES ('329', '140881', '山西省', '运城市', '永济市', '山西省永济市');
INSERT INTO  s_area_code  VALUES ('330', '140882', '山西省', '运城市', '河津市', '山西省河津市');
INSERT INTO  s_area_code  VALUES ('331', '140900', '山西省', '忻州市', '', '山西省忻州市');
INSERT INTO  s_area_code  VALUES ('332', '140901', '山西省', '忻州市', '市辖区', '山西省忻州市市辖区');
INSERT INTO  s_area_code  VALUES ('333', '140902', '山西省', '忻州市', '忻府区', '山西省忻州市忻府区');
INSERT INTO  s_area_code  VALUES ('334', '140921', '山西省', '忻州市', '定襄县', '山西省定襄县');
INSERT INTO  s_area_code  VALUES ('335', '140922', '山西省', '忻州市', '五台县', '山西省五台县');
INSERT INTO  s_area_code  VALUES ('336', '140923', '山西省', '忻州市', '代县', '山西省代县');
INSERT INTO  s_area_code  VALUES ('337', '140924', '山西省', '忻州市', '繁峙县', '山西省繁峙县');
INSERT INTO  s_area_code  VALUES ('338', '140925', '山西省', '忻州市', '宁武县', '山西省宁武县');
INSERT INTO  s_area_code  VALUES ('339', '140926', '山西省', '忻州市', '静乐县', '山西省静乐县');
INSERT INTO  s_area_code  VALUES ('340', '140927', '山西省', '忻州市', '神池县', '山西省神池县');
INSERT INTO  s_area_code  VALUES ('341', '140928', '山西省', '忻州市', '五寨县', '山西省五寨县');
INSERT INTO  s_area_code  VALUES ('342', '140929', '山西省', '忻州市', '岢岚县', '山西省岢岚县');
INSERT INTO  s_area_code  VALUES ('343', '140930', '山西省', '忻州市', '河曲县', '山西省河曲县');
INSERT INTO  s_area_code  VALUES ('344', '140931', '山西省', '忻州市', '保德县', '山西省保德县');
INSERT INTO  s_area_code  VALUES ('345', '140932', '山西省', '忻州市', '偏关县', '山西省偏关县');
INSERT INTO  s_area_code  VALUES ('346', '140981', '山西省', '忻州市', '原平市', '山西省原平市');
INSERT INTO  s_area_code  VALUES ('347', '141000', '山西省', '临汾市', '', '山西省临汾市');
INSERT INTO  s_area_code  VALUES ('348', '141001', '山西省', '临汾市', '市辖区', '山西省临汾市市辖区');
INSERT INTO  s_area_code  VALUES ('349', '141002', '山西省', '临汾市', '尧都区', '山西省临汾市尧都区');
INSERT INTO  s_area_code  VALUES ('350', '141021', '山西省', '临汾市', '曲沃县', '山西省曲沃县');
INSERT INTO  s_area_code  VALUES ('351', '141022', '山西省', '临汾市', '翼城县', '山西省翼城县');
INSERT INTO  s_area_code  VALUES ('352', '141023', '山西省', '临汾市', '襄汾县', '山西省襄汾县');
INSERT INTO  s_area_code  VALUES ('353', '141024', '山西省', '临汾市', '洪洞县', '山西省洪洞县');
INSERT INTO  s_area_code  VALUES ('354', '141025', '山西省', '临汾市', '古 县', '山西省古 县');
INSERT INTO  s_area_code  VALUES ('355', '141026', '山西省', '临汾市', '安泽县', '山西省安泽县');
INSERT INTO  s_area_code  VALUES ('356', '141027', '山西省', '临汾市', '浮山县', '山西省浮山县');
INSERT INTO  s_area_code  VALUES ('357', '141028', '山西省', '临汾市', '吉 县', '山西省吉 县');
INSERT INTO  s_area_code  VALUES ('358', '141029', '山西省', '临汾市', '乡宁县', '山西省乡宁县');
INSERT INTO  s_area_code  VALUES ('359', '141030', '山西省', '临汾市', '大宁县', '山西省大宁县');
INSERT INTO  s_area_code  VALUES ('360', '141031', '山西省', '临汾市', '隰 县', '山西省隰 县');
INSERT INTO  s_area_code  VALUES ('361', '141032', '山西省', '临汾市', '永和县', '山西省永和县');
INSERT INTO  s_area_code  VALUES ('362', '141033', '山西省', '临汾市', '蒲 县', '山西省蒲 县');
INSERT INTO  s_area_code  VALUES ('363', '141034', '山西省', '临汾市', '汾西县', '山西省汾西县');
INSERT INTO  s_area_code  VALUES ('364', '141081', '山西省', '临汾市', '侯马市', '山西省侯马市');
INSERT INTO  s_area_code  VALUES ('365', '141082', '山西省', '临汾市', '霍州市', '山西省霍州市');
INSERT INTO  s_area_code  VALUES ('366', '141100', '山西省', '吕梁市', '', '山西省吕梁市');
INSERT INTO  s_area_code  VALUES ('367', '141101', '山西省', '吕梁市', '市辖区', '山西省吕梁市市辖区');
INSERT INTO  s_area_code  VALUES ('368', '141102', '山西省', '吕梁市', '离石区', '山西省吕梁市离石区');
INSERT INTO  s_area_code  VALUES ('369', '141121', '山西省', '吕梁市', '文水县', '山西省文水县');
INSERT INTO  s_area_code  VALUES ('370', '141122', '山西省', '吕梁市', '交城县', '山西省交城县');
INSERT INTO  s_area_code  VALUES ('371', '141123', '山西省', '吕梁市', '兴 县', '山西省兴 县');
INSERT INTO  s_area_code  VALUES ('372', '141124', '山西省', '吕梁市', '临 县', '山西省临 县');
INSERT INTO  s_area_code  VALUES ('373', '141125', '山西省', '吕梁市', '柳林县', '山西省柳林县');
INSERT INTO  s_area_code  VALUES ('374', '141126', '山西省', '吕梁市', '石楼县', '山西省石楼县');
INSERT INTO  s_area_code  VALUES ('375', '141127', '山西省', '吕梁市', '岚 县', '山西省岚 县');
INSERT INTO  s_area_code  VALUES ('376', '141128', '山西省', '吕梁市', '方山县', '山西省方山县');
INSERT INTO  s_area_code  VALUES ('377', '141129', '山西省', '吕梁市', '中阳县', '山西省中阳县');
INSERT INTO  s_area_code  VALUES ('378', '141130', '山西省', '吕梁市', '交口县', '山西省交口县');
INSERT INTO  s_area_code  VALUES ('379', '141181', '山西省', '吕梁市', '孝义市', '山西省孝义市');
INSERT INTO  s_area_code  VALUES ('380', '141182', '山西省', '吕梁市', '汾阳市', '山西省汾阳市');
INSERT INTO  s_area_code  VALUES ('381', '142200', '山西省', '忻州市', '忻州地区', '山西省忻州地区 ');
INSERT INTO  s_area_code  VALUES ('382', '142201', '山西省', '忻州市', '忻州市', '山西省 忻州市 ');
INSERT INTO  s_area_code  VALUES ('383', '142202', '山西省', '忻州市', '原平市 ', '山西省 原平市 ');
INSERT INTO  s_area_code  VALUES ('384', '142222', '山西省', '忻州市', '定襄县', '山西省 定襄县 ');
INSERT INTO  s_area_code  VALUES ('385', '142223', '山西省', '忻州市', '五台县', '山西省 五台县 ');
INSERT INTO  s_area_code  VALUES ('386', '142225', '山西省', '忻州市', '代 县', '山西省 代 县 ');
INSERT INTO  s_area_code  VALUES ('387', '142226', '山西省', '忻州市', ' 繁峙县', '山西省 繁峙县 ');
INSERT INTO  s_area_code  VALUES ('388', '142227', '山西省', '忻州市', '宁武县', '山西省 宁武县 ');
INSERT INTO  s_area_code  VALUES ('389', '142228', '山西省', '忻州市', '静乐县', '山西省 静乐县 ');
INSERT INTO  s_area_code  VALUES ('390', '142229', '山西省', '忻州市', ' 神池县', '山西省 神池县 ');
INSERT INTO  s_area_code  VALUES ('391', '142230', '山西省', '忻州市', '五寨县', '山西省 五寨县 ');
INSERT INTO  s_area_code  VALUES ('392', '142231', '山西省', '忻州市', '岢岚县 ', '山西省 岢岚县 ');
INSERT INTO  s_area_code  VALUES ('393', '142232', '山西省', '忻州市', '河曲县', '山西省 河曲县 ');
INSERT INTO  s_area_code  VALUES ('394', '142233', '山西省', '忻州市', '保德县 ', '山西省 保德县 ');
INSERT INTO  s_area_code  VALUES ('395', '142234', '山西省', '忻州市', '偏关县', '山西省 偏关县 ');
INSERT INTO  s_area_code  VALUES ('396', '142301', '山西省', '吕梁市', '孝义市', '山西省吕梁地区孝义市');
INSERT INTO  s_area_code  VALUES ('397', '142302', '山西省', '吕梁市', '离石市', '山西省吕梁地区离石市');
INSERT INTO  s_area_code  VALUES ('398', '142303', '山西省', '吕梁市', '汾阳市', '山西省吕梁地区汾阳市');
INSERT INTO  s_area_code  VALUES ('399', '142322', '山西省', '吕梁市', '文水县', '山西省吕梁地区文水县');
INSERT INTO  s_area_code  VALUES ('400', '142323', '山西省', '吕梁市', '交城县', '山西省吕梁地区交城县');
INSERT INTO  s_area_code  VALUES ('401', '142325', '山西省', '吕梁市', '兴县', '山西省吕梁地区兴县');
INSERT INTO  s_area_code  VALUES ('402', '142326', '山西省', '吕梁市', '临县', '山西省吕梁地区临县');
INSERT INTO  s_area_code  VALUES ('403', '142327', '山西省', '吕梁市', '柳林县', '山西省吕梁地区柳林县');
INSERT INTO  s_area_code  VALUES ('404', '142328', '山西省', '吕梁市', '石楼县', '山西省吕梁地区石楼县');
INSERT INTO  s_area_code  VALUES ('405', '142329', '山西省', '吕梁市', '岚县', '山西省吕梁地区岚县');
INSERT INTO  s_area_code  VALUES ('406', '142330', '山西省', '吕梁市', '方山县', '山西省吕梁地区方山县');
INSERT INTO  s_area_code  VALUES ('407', '142332', '山西省', '吕梁市', '中阳县', '山西省吕梁地区中阳县');
INSERT INTO  s_area_code  VALUES ('408', '142333', '山西省', '吕梁市', '交口县', '山西省吕梁地区交口县');
INSERT INTO  s_area_code  VALUES ('409', '142600', '山西省', ' 临汾市', '临汾地区', '山西省临汾地区 ');
INSERT INTO  s_area_code  VALUES ('410', '142601', '山西省', ' 临汾市', '临汾市', '山西省 临汾市 ');
INSERT INTO  s_area_code  VALUES ('411', '142602', '山西省', ' 临汾市', '侯马市', '山西省 侯马市 ');
INSERT INTO  s_area_code  VALUES ('412', '142603', '山西省', ' 临汾市', '霍州市', '山西省 霍州市 ');
INSERT INTO  s_area_code  VALUES ('413', '142621', '山西省', ' 临汾市', '曲沃县', '山西省 曲沃县 ');
INSERT INTO  s_area_code  VALUES ('414', '142622', '山西省', ' 临汾市', '翼城县', '山西省 翼城县 ');
INSERT INTO  s_area_code  VALUES ('415', '142623', '山西省', ' 临汾市', '襄汾县', '山西省 襄汾县 ');
INSERT INTO  s_area_code  VALUES ('416', '142625', '山西省', ' 临汾市', '洪洞县', '山西省 洪洞县 ');
INSERT INTO  s_area_code  VALUES ('417', '142627', '山西省', ' 临汾市', '古县', '山西省 古县 ');
INSERT INTO  s_area_code  VALUES ('418', '142628', '山西省', ' 临汾市', '安泽县', '山西省 安泽县 ');
INSERT INTO  s_area_code  VALUES ('419', '142629', '山西省', ' 临汾市', '浮山县', '山西省 浮山县 ');
INSERT INTO  s_area_code  VALUES ('420', '142630', '山西省', ' 临汾市', '吉县', '山西省 吉县 ');
INSERT INTO  s_area_code  VALUES ('421', '142631', '山西省', ' 临汾市', '乡宁县', '山西省 乡宁县 ');
INSERT INTO  s_area_code  VALUES ('422', '142632', '山西省', ' 临汾市', '蒲县', '山西省 蒲县 ');
INSERT INTO  s_area_code  VALUES ('423', '142633', '山西省', ' 临汾市', '大宁县', '山西省 大宁县 ');
INSERT INTO  s_area_code  VALUES ('424', '142634', '山西省', ' 临汾市', '永和县', '山西省 永和县 ');
INSERT INTO  s_area_code  VALUES ('425', '142635', '山西省', ' 临汾市', ' 隰县', '山西省 隰县 ');
INSERT INTO  s_area_code  VALUES ('426', '142636', '山西省', ' 临汾市', '汾西县', '山西省 汾西县 ');
INSERT INTO  s_area_code  VALUES ('427', '142700', '山西省', '运城市', '运城地区', '山西省运城地区 ');
INSERT INTO  s_area_code  VALUES ('428', '142701', '山西省', '运城市', '运城市', '山西省 运城市 ');
INSERT INTO  s_area_code  VALUES ('429', '142702', '山西省', '运城市', '永济市', '山西省 永济市 ');
INSERT INTO  s_area_code  VALUES ('430', '142703', '山西省', '运城市', '河津市', '山西省 河津市 ');
INSERT INTO  s_area_code  VALUES ('431', '142723', '山西省', '运城市', '芮城县', '山西省 芮城县 ');
INSERT INTO  s_area_code  VALUES ('432', '142724', '山西省', '运城市', '临猗县', '山西省 临猗县 ');
INSERT INTO  s_area_code  VALUES ('433', '142725', '山西省', '运城市', '万荣县', '山西省 万荣县 ');
INSERT INTO  s_area_code  VALUES ('434', '142726', '山西省', '运城市', '新绛县 ', '山西省 新绛县 ');
INSERT INTO  s_area_code  VALUES ('435', '142727', '山西省', '运城市', '稷山县', '山西省 稷山县 ');
INSERT INTO  s_area_code  VALUES ('436', '142729', '山西省', '运城市', '闻喜县', '山西省 闻喜县 ');
INSERT INTO  s_area_code  VALUES ('437', '142730', '山西省', '运城市', '夏 县', '山西省 夏 县 ');
INSERT INTO  s_area_code  VALUES ('438', '142731', '山西省', '运城市', '绛 县', '山西省 绛 县 ');
INSERT INTO  s_area_code  VALUES ('439', '142732', '山西省', '运城市', '平陆县', '山西省 平陆县 ');
INSERT INTO  s_area_code  VALUES ('440', '142733', '山西省', '运城市', '垣曲县', '山西省 垣曲县 ');
INSERT INTO  s_area_code  VALUES ('441', '150000', '内蒙古自治区', '', '', '内蒙古自治区');
INSERT INTO  s_area_code  VALUES ('442', '150100', '内蒙古自治区', '呼和浩特市', '', '内蒙古自治区呼和浩特市');
INSERT INTO  s_area_code  VALUES ('443', '150101', '内蒙古自治区', '呼和浩特市', '市辖区', '内蒙古自治区呼和浩特市市辖区');
INSERT INTO  s_area_code  VALUES ('444', '150102', '内蒙古自治区', '呼和浩特市', '新城区', '内蒙古自治区呼和浩特市新城区');
INSERT INTO  s_area_code  VALUES ('445', '150103', '内蒙古自治区', '呼和浩特市', '回民区', '内蒙古自治区呼和浩特市回民区');
INSERT INTO  s_area_code  VALUES ('446', '150104', '内蒙古自治区', '呼和浩特市', '玉泉区', '内蒙古自治区呼和浩特市玉泉区');
INSERT INTO  s_area_code  VALUES ('447', '150105', '内蒙古自治区', '呼和浩特市', '赛罕区', '内蒙古自治区呼和浩特市赛罕区');
INSERT INTO  s_area_code  VALUES ('448', '150121', '内蒙古自治区', '呼和浩特市', '土默特左旗', '内蒙古自治区土默特左旗');
INSERT INTO  s_area_code  VALUES ('449', '150122', '内蒙古自治区', '呼和浩特市', '托克托县', '内蒙古自治区托克托县');
INSERT INTO  s_area_code  VALUES ('450', '150123', '内蒙古自治区', '呼和浩特市', '和林格尔县', '内蒙古自治区和林格尔县');
INSERT INTO  s_area_code  VALUES ('451', '150124', '内蒙古自治区', '呼和浩特市', '清水河县', '内蒙古自治区清水河县');
INSERT INTO  s_area_code  VALUES ('452', '150125', '内蒙古自治区', '呼和浩特市', '武川县', '内蒙古自治区武川县');
INSERT INTO  s_area_code  VALUES ('453', '150200', '内蒙古自治区', '包头市', '', '内蒙古自治区包头市');
INSERT INTO  s_area_code  VALUES ('454', '150201', '内蒙古自治区', '包头市', '市辖区', '内蒙古自治区包头市市辖区');
INSERT INTO  s_area_code  VALUES ('455', '150202', '内蒙古自治区', '包头市', '东河区', '内蒙古自治区包头市东河区');
INSERT INTO  s_area_code  VALUES ('456', '150203', '内蒙古自治区', '包头市', '昆都仑区', '内蒙古自治区包头市昆都仑区');
INSERT INTO  s_area_code  VALUES ('457', '150204', '内蒙古自治区', '包头市', '青山区', '内蒙古自治区包头市青山区');
INSERT INTO  s_area_code  VALUES ('458', '150205', '内蒙古自治区', '包头市', '石拐区', '内蒙古自治区包头市石拐区');
INSERT INTO  s_area_code  VALUES ('459', '150206', '内蒙古自治区', '包头市', '白云矿区', '内蒙古自治区包头市白云矿区');
INSERT INTO  s_area_code  VALUES ('460', '150207', '内蒙古自治区', '包头市', '九原区', '内蒙古自治区包头市九原区');
INSERT INTO  s_area_code  VALUES ('461', '150221', '内蒙古自治区', '包头市', '土默特右旗', '内蒙古自治区土默特右旗');
INSERT INTO  s_area_code  VALUES ('462', '150222', '内蒙古自治区', '包头市', '固阳县', '内蒙古自治区固阳县');
INSERT INTO  s_area_code  VALUES ('463', '150223', '内蒙古自治区', '包头市', '达尔罕茂明安联合旗', '内蒙古自治区达尔罕茂明安联合旗');
INSERT INTO  s_area_code  VALUES ('464', '150300', '内蒙古自治区', '乌海市', '', '内蒙古自治区乌海市');
INSERT INTO  s_area_code  VALUES ('465', '150301', '内蒙古自治区', '乌海市', '市辖区', '内蒙古自治区乌海市市辖区');
INSERT INTO  s_area_code  VALUES ('466', '150302', '内蒙古自治区', '乌海市', '海勃湾区', '内蒙古自治区乌海市海勃湾区');
INSERT INTO  s_area_code  VALUES ('467', '150303', '内蒙古自治区', '乌海市', '海南区', '内蒙古自治区乌海市海南区');
INSERT INTO  s_area_code  VALUES ('468', '150304', '内蒙古自治区', '乌海市', '乌达区', '内蒙古自治区乌海市乌达区');
INSERT INTO  s_area_code  VALUES ('469', '150400', '内蒙古自治区', '赤峰市', '', '内蒙古自治区赤峰市');
INSERT INTO  s_area_code  VALUES ('470', '150401', '内蒙古自治区', '赤峰市', '市辖区', '内蒙古自治区赤峰市市辖区');
INSERT INTO  s_area_code  VALUES ('471', '150402', '内蒙古自治区', '赤峰市', '红山区', '内蒙古自治区赤峰市红山区');
INSERT INTO  s_area_code  VALUES ('472', '150403', '内蒙古自治区', '赤峰市', '元宝山区', '内蒙古自治区赤峰市元宝山区');
INSERT INTO  s_area_code  VALUES ('473', '150404', '内蒙古自治区', '赤峰市', '松山区', '内蒙古自治区赤峰市松山区');
INSERT INTO  s_area_code  VALUES ('474', '150421', '内蒙古自治区', '赤峰市', '阿鲁科尔沁旗', '内蒙古自治区阿鲁科尔沁旗');
INSERT INTO  s_area_code  VALUES ('475', '150422', '内蒙古自治区', '赤峰市', '巴林左旗', '内蒙古自治区巴林左旗');
INSERT INTO  s_area_code  VALUES ('476', '150423', '内蒙古自治区', '赤峰市', '巴林右旗', '内蒙古自治区巴林右旗');
INSERT INTO  s_area_code  VALUES ('477', '150424', '内蒙古自治区', '赤峰市', '林西县', '内蒙古自治区林西县');
INSERT INTO  s_area_code  VALUES ('478', '150425', '内蒙古自治区', '赤峰市', '克什克腾旗', '内蒙古自治区克什克腾旗');
INSERT INTO  s_area_code  VALUES ('479', '150426', '内蒙古自治区', '赤峰市', '翁牛特旗', '内蒙古自治区翁牛特旗');
INSERT INTO  s_area_code  VALUES ('480', '150428', '内蒙古自治区', '赤峰市', '喀喇沁旗', '内蒙古自治区喀喇沁旗');
INSERT INTO  s_area_code  VALUES ('481', '150429', '内蒙古自治区', '赤峰市', '宁城县', '内蒙古自治区宁城县');
INSERT INTO  s_area_code  VALUES ('482', '150430', '内蒙古自治区', '赤峰市', '敖汉旗', '内蒙古自治区敖汉旗');
INSERT INTO  s_area_code  VALUES ('483', '150500', '内蒙古自治区', '通辽市', '', '内蒙古自治区通辽市');
INSERT INTO  s_area_code  VALUES ('484', '150501', '内蒙古自治区', '通辽市', '市辖区', '内蒙古自治区通辽市市辖区');
INSERT INTO  s_area_code  VALUES ('485', '150502', '内蒙古自治区', '通辽市', '科尔沁区', '内蒙古自治区通辽市科尔沁区');
INSERT INTO  s_area_code  VALUES ('486', '150521', '内蒙古自治区', '通辽市', '科尔沁左翼中旗', '内蒙古自治区科尔沁左翼中旗');
INSERT INTO  s_area_code  VALUES ('487', '150522', '内蒙古自治区', '通辽市', '科尔沁左翼后旗', '内蒙古自治区科尔沁左翼后旗');
INSERT INTO  s_area_code  VALUES ('488', '150523', '内蒙古自治区', '通辽市', '开鲁县', '内蒙古自治区开鲁县');
INSERT INTO  s_area_code  VALUES ('489', '150524', '内蒙古自治区', '通辽市', '库伦旗', '内蒙古自治区库伦旗');
INSERT INTO  s_area_code  VALUES ('490', '150525', '内蒙古自治区', '通辽市', '奈曼旗', '内蒙古自治区奈曼旗');
INSERT INTO  s_area_code  VALUES ('491', '150526', '内蒙古自治区', '通辽市', '扎鲁特旗', '内蒙古自治区扎鲁特旗');
INSERT INTO  s_area_code  VALUES ('492', '150581', '内蒙古自治区', '通辽市', '霍林郭勒市', '内蒙古自治区霍林郭勒市');
INSERT INTO  s_area_code  VALUES ('493', '150600', '内蒙古自治区', '鄂尔多斯市', '', '内蒙古自治区鄂尔多斯市');
INSERT INTO  s_area_code  VALUES ('494', '150602', '内蒙古自治区', '鄂尔多斯市', '东胜区', '内蒙古自治区鄂尔多斯市东胜区');
INSERT INTO  s_area_code  VALUES ('495', '150621', '内蒙古自治区', '鄂尔多斯市', '达拉特旗', '内蒙古自治区达拉特旗');
INSERT INTO  s_area_code  VALUES ('496', '150622', '内蒙古自治区', '鄂尔多斯市', '准格尔旗', '内蒙古自治区准格尔旗');
INSERT INTO  s_area_code  VALUES ('497', '150623', '内蒙古自治区', '鄂尔多斯市', '鄂托克前旗', '内蒙古自治区鄂托克前旗');
INSERT INTO  s_area_code  VALUES ('498', '150624', '内蒙古自治区', '鄂尔多斯市', '鄂托克旗', '内蒙古自治区鄂托克旗');
INSERT INTO  s_area_code  VALUES ('499', '150625', '内蒙古自治区', '鄂尔多斯市', '杭锦旗', '内蒙古自治区杭锦旗');
INSERT INTO  s_area_code  VALUES ('500', '150626', '内蒙古自治区', '鄂尔多斯市', '乌审旗', '内蒙古自治区乌审旗');
INSERT INTO  s_area_code  VALUES ('501', '150627', '内蒙古自治区', '鄂尔多斯市', '伊金霍洛旗', '内蒙古自治区伊金霍洛旗');
INSERT INTO  s_area_code  VALUES ('502', '150700', '内蒙古自治区', '呼伦贝尔市', '', '内蒙古自治区呼伦贝尔市');
INSERT INTO  s_area_code  VALUES ('503', '150701', '内蒙古自治区', '呼伦贝尔市', '市辖区', '内蒙古自治区呼伦贝尔市市辖区');
INSERT INTO  s_area_code  VALUES ('504', '150702', '内蒙古自治区', '呼伦贝尔市', '海拉尔区', '内蒙古自治区呼伦贝尔市海拉尔区');
INSERT INTO  s_area_code  VALUES ('505', '150721', '内蒙古自治区', '呼伦贝尔市', '阿荣旗', '内蒙古自治区阿荣旗');
INSERT INTO  s_area_code  VALUES ('506', '150722', '内蒙古自治区', '呼伦贝尔市', '莫力达瓦达斡尔族自治旗', '内蒙古自治区莫力达瓦达斡尔族自治旗');
INSERT INTO  s_area_code  VALUES ('507', '150723', '内蒙古自治区', '呼伦贝尔市', '鄂伦春自治旗', '内蒙古自治区鄂伦春自治旗');
INSERT INTO  s_area_code  VALUES ('508', '150724', '内蒙古自治区', '呼伦贝尔市', '鄂温克族自治旗', '内蒙古自治区鄂温克族自治旗');
INSERT INTO  s_area_code  VALUES ('509', '150725', '内蒙古自治区', '呼伦贝尔市', '陈巴尔虎旗', '内蒙古自治区陈巴尔虎旗');
INSERT INTO  s_area_code  VALUES ('510', '150726', '内蒙古自治区', '呼伦贝尔市', '新巴尔虎左旗', '内蒙古自治区新巴尔虎左旗');
INSERT INTO  s_area_code  VALUES ('511', '150727', '内蒙古自治区', '呼伦贝尔市', '新巴尔虎右旗', '内蒙古自治区新巴尔虎右旗');
INSERT INTO  s_area_code  VALUES ('512', '150781', '内蒙古自治区', '呼伦贝尔市', '满洲里市', '内蒙古自治区满洲里市');
INSERT INTO  s_area_code  VALUES ('513', '150782', '内蒙古自治区', '呼伦贝尔市', '牙克石市', '内蒙古自治区牙克石市');
INSERT INTO  s_area_code  VALUES ('514', '150783', '内蒙古自治区', '呼伦贝尔市', '扎兰屯市', '内蒙古自治区扎兰屯市');
INSERT INTO  s_area_code  VALUES ('515', '150784', '内蒙古自治区', '呼伦贝尔市', '额尔古纳市', '内蒙古自治区额尔古纳市');
INSERT INTO  s_area_code  VALUES ('516', '150785', '内蒙古自治区', '呼伦贝尔市', '根河市', '内蒙古自治区根河市');
INSERT INTO  s_area_code  VALUES ('517', '150800', '内蒙古自治区', '巴彦淖尔市', '', '内蒙古自治区巴彦淖尔市');
INSERT INTO  s_area_code  VALUES ('518', '150801', '内蒙古自治区', '巴彦淖尔市', '市辖区', '内蒙古自治区巴彦淖尔市市辖区');
INSERT INTO  s_area_code  VALUES ('519', '150802', '内蒙古自治区', '巴彦淖尔市', '临河区', '内蒙古自治区巴彦淖尔市临河区');
INSERT INTO  s_area_code  VALUES ('520', '150821', '内蒙古自治区', '巴彦淖尔市', '五原县', '内蒙古自治区五原县');
INSERT INTO  s_area_code  VALUES ('521', '150822', '内蒙古自治区', '巴彦淖尔市', '磴口县', '内蒙古自治区磴口县');
INSERT INTO  s_area_code  VALUES ('522', '150823', '内蒙古自治区', '巴彦淖尔市', '乌拉特前旗', '内蒙古自治区乌拉特前旗');
INSERT INTO  s_area_code  VALUES ('523', '150824', '内蒙古自治区', '巴彦淖尔市', '乌拉特中旗', '内蒙古自治区乌拉特中旗');
INSERT INTO  s_area_code  VALUES ('524', '150825', '内蒙古自治区', '巴彦淖尔市', '乌拉特后旗', '内蒙古自治区乌拉特后旗');
INSERT INTO  s_area_code  VALUES ('525', '150826', '内蒙古自治区', '巴彦淖尔市', '杭锦后旗', '内蒙古自治区杭锦后旗');
INSERT INTO  s_area_code  VALUES ('526', '150900', '内蒙古自治区', '乌兰察布市', '', '内蒙古自治区乌兰察布市');
INSERT INTO  s_area_code  VALUES ('527', '150901', '内蒙古自治区', '乌兰察布市', '市辖区', '内蒙古自治区乌兰察布市市辖区');
INSERT INTO  s_area_code  VALUES ('528', '150902', '内蒙古自治区', '乌兰察布市', '集宁区', '内蒙古自治区乌兰察布市集宁区');
INSERT INTO  s_area_code  VALUES ('529', '150921', '内蒙古自治区', '乌兰察布市', '卓资县', '内蒙古自治区卓资县');
INSERT INTO  s_area_code  VALUES ('530', '150922', '内蒙古自治区', '乌兰察布市', '化德县', '内蒙古自治区化德县');
INSERT INTO  s_area_code  VALUES ('531', '150923', '内蒙古自治区', '乌兰察布市', '商都县', '内蒙古自治区商都县');
INSERT INTO  s_area_code  VALUES ('532', '150924', '内蒙古自治区', '乌兰察布市', '兴和县', '内蒙古自治区兴和县');
INSERT INTO  s_area_code  VALUES ('533', '150925', '内蒙古自治区', '乌兰察布市', '凉城县', '内蒙古自治区凉城县');
INSERT INTO  s_area_code  VALUES ('534', '150926', '内蒙古自治区', '乌兰察布市', '察哈尔右翼前旗', '内蒙古自治区察哈尔右翼前旗');
INSERT INTO  s_area_code  VALUES ('535', '150927', '内蒙古自治区', '乌兰察布市', '察哈尔右翼中旗', '内蒙古自治区察哈尔右翼中旗');
INSERT INTO  s_area_code  VALUES ('536', '150928', '内蒙古自治区', '乌兰察布市', '察哈尔右翼后旗', '内蒙古自治区察哈尔右翼后旗');
INSERT INTO  s_area_code  VALUES ('537', '150929', '内蒙古自治区', '乌兰察布市', '四子王旗', '内蒙古自治区四子王旗');
INSERT INTO  s_area_code  VALUES ('538', '150981', '内蒙古自治区', '乌兰察布市', '丰镇市', '内蒙古自治区丰镇市');
INSERT INTO  s_area_code  VALUES ('539', '152200', '内蒙古自治区', '兴安盟', '', '内蒙古自治区兴安盟');
INSERT INTO  s_area_code  VALUES ('540', '152201', '内蒙古自治区', '兴安盟', '乌兰浩特市', '内蒙古自治区乌兰浩特市');
INSERT INTO  s_area_code  VALUES ('541', '152202', '内蒙古自治区', '兴安盟', '阿尔山市', '内蒙古自治区阿尔山市');
INSERT INTO  s_area_code  VALUES ('542', '152221', '内蒙古自治区', '兴安盟', '科尔沁右翼前旗', '内蒙古自治区科尔沁右翼前旗');
INSERT INTO  s_area_code  VALUES ('543', '152222', '内蒙古自治区', '兴安盟', '科尔沁右翼中旗', '内蒙古自治区科尔沁右翼中旗');
INSERT INTO  s_area_code  VALUES ('544', '152223', '内蒙古自治区', '兴安盟', '扎赉特旗', '内蒙古自治区扎赉特旗');
INSERT INTO  s_area_code  VALUES ('545', '152224', '内蒙古自治区', '兴安盟', '突泉县', '内蒙古自治区突泉县');
INSERT INTO  s_area_code  VALUES ('546', '152500', '内蒙古自治区', '锡林郭勒盟', '', '内蒙古自治区锡林郭勒盟');
INSERT INTO  s_area_code  VALUES ('547', '152501', '内蒙古自治区', '锡林郭勒盟', '二连浩特市', '内蒙古自治区二连浩特市');
INSERT INTO  s_area_code  VALUES ('548', '152502', '内蒙古自治区', '锡林郭勒盟', '锡林浩特市', '内蒙古自治区锡林浩特市');
INSERT INTO  s_area_code  VALUES ('549', '152522', '内蒙古自治区', '锡林郭勒盟', '阿巴嘎旗', '内蒙古自治区阿巴嘎旗');
INSERT INTO  s_area_code  VALUES ('550', '152523', '内蒙古自治区', '锡林郭勒盟', '苏尼特左旗', '内蒙古自治区苏尼特左旗');
INSERT INTO  s_area_code  VALUES ('551', '152524', '内蒙古自治区', '锡林郭勒盟', '苏尼特右旗', '内蒙古自治区苏尼特右旗');
INSERT INTO  s_area_code  VALUES ('552', '152525', '内蒙古自治区', '锡林郭勒盟', '东乌珠穆沁旗', '内蒙古自治区东乌珠穆沁旗');
INSERT INTO  s_area_code  VALUES ('553', '152526', '内蒙古自治区', '锡林郭勒盟', '西乌珠穆沁旗', '内蒙古自治区西乌珠穆沁旗');
INSERT INTO  s_area_code  VALUES ('554', '152527', '内蒙古自治区', '锡林郭勒盟', '太仆寺旗', '内蒙古自治区太仆寺旗');
INSERT INTO  s_area_code  VALUES ('555', '152528', '内蒙古自治区', '锡林郭勒盟', '镶黄旗', '内蒙古自治区镶黄旗');
INSERT INTO  s_area_code  VALUES ('556', '152529', '内蒙古自治区', '锡林郭勒盟', '正镶白旗', '内蒙古自治区正镶白旗');
INSERT INTO  s_area_code  VALUES ('557', '152530', '内蒙古自治区', '锡林郭勒盟', '正蓝旗', '内蒙古自治区正蓝旗');
INSERT INTO  s_area_code  VALUES ('558', '152531', '内蒙古自治区', '锡林郭勒盟', '多伦县', '内蒙古自治区多伦县');
INSERT INTO  s_area_code  VALUES ('559', '152600', '内蒙古自治区', '乌兰察布盟', '', '内蒙古自治区乌兰察布盟');
INSERT INTO  s_area_code  VALUES ('560', '152601', '内蒙古自治区', '乌兰察布盟', '集宁市', '内蒙古自治区集宁市');
INSERT INTO  s_area_code  VALUES ('561', '152602', '内蒙古自治区', '乌兰察布盟', '丰镇市', '内蒙古自治区丰镇市');
INSERT INTO  s_area_code  VALUES ('562', '152624', '内蒙古自治区', '乌兰察布盟', '卓资县', '内蒙古自治区卓资县');
INSERT INTO  s_area_code  VALUES ('563', '152625', '内蒙古自治区', '乌兰察布盟', '化德县', '内蒙古自治区化德县');
INSERT INTO  s_area_code  VALUES ('564', '152626', '内蒙古自治区', '乌兰察布盟', '商都县', '内蒙古自治区商都县');
INSERT INTO  s_area_code  VALUES ('565', '152627', '内蒙古自治区', '乌兰察布盟', '兴和县', '内蒙古自治区兴和县');
INSERT INTO  s_area_code  VALUES ('566', '152629', '内蒙古自治区', '乌兰察布盟', '凉城县', '内蒙古自治区凉城县');
INSERT INTO  s_area_code  VALUES ('567', '152630', '内蒙古自治区', '', '', '内蒙古自治区察哈尔右翼前旗');
INSERT INTO  s_area_code  VALUES ('568', '152631', '内蒙古自治区', '', '', '内蒙古自治区察哈尔右翼中旗');
INSERT INTO  s_area_code  VALUES ('569', '152632', '内蒙古自治区', '', '', '内蒙古自治区察哈尔右翼后旗');
INSERT INTO  s_area_code  VALUES ('570', '152634', '内蒙古自治区', '', '', '内蒙古自治区四子王旗');
INSERT INTO  s_area_code  VALUES ('571', '152800', '内蒙古自治区', '', '', '内蒙古自治区');
INSERT INTO  s_area_code  VALUES ('572', '152801', '内蒙古自治区', '', '', '内蒙古自治区临河市');
INSERT INTO  s_area_code  VALUES ('573', '152822', '内蒙古自治区', '', '', '内蒙古自治区五原县');
INSERT INTO  s_area_code  VALUES ('574', '152823', '内蒙古自治区', '', '', '内蒙古自治区磴口县');
INSERT INTO  s_area_code  VALUES ('575', '152824', '内蒙古自治区', '', '', '内蒙古自治区乌拉特前旗');
INSERT INTO  s_area_code  VALUES ('576', '152825', '内蒙古自治区', '', '', '内蒙古自治区乌拉特中旗');
INSERT INTO  s_area_code  VALUES ('577', '152826', '内蒙古自治区', '', '', '内蒙古自治区乌拉特后旗');
INSERT INTO  s_area_code  VALUES ('578', '152827', '内蒙古自治区', '', '', '内蒙古自治区杭锦后旗');
INSERT INTO  s_area_code  VALUES ('579', '152900', '内蒙古自治区', '阿拉善盟', '', '内蒙古自治区阿拉善盟');
INSERT INTO  s_area_code  VALUES ('580', '152921', '内蒙古自治区', '阿拉善盟', '阿拉善左旗', '内蒙古自治区阿拉善左旗');
INSERT INTO  s_area_code  VALUES ('581', '152922', '内蒙古自治区', '阿拉善盟', '阿拉善右旗', '内蒙古自治区阿拉善右旗');
INSERT INTO  s_area_code  VALUES ('582', '152923', '内蒙古自治区', '阿拉善盟', '额济纳旗', '内蒙古自治区额济纳旗');
INSERT INTO  s_area_code  VALUES ('583', '210000', '辽宁省', '', '', '辽宁省');
INSERT INTO  s_area_code  VALUES ('584', '210100', '辽宁省', '沈阳市', '', '辽宁省沈阳市');
INSERT INTO  s_area_code  VALUES ('585', '210101', '辽宁省', '沈阳市', '市辖区', '辽宁省沈阳市市辖区');
INSERT INTO  s_area_code  VALUES ('586', '210102', '辽宁省', '沈阳市', '和平区', '辽宁省沈阳市和平区');
INSERT INTO  s_area_code  VALUES ('587', '210103', '辽宁省', '沈阳市', '沈河区', '辽宁省沈阳市沈河区');
INSERT INTO  s_area_code  VALUES ('588', '210104', '辽宁省', '沈阳市', '大东区', '辽宁省沈阳市大东区');
INSERT INTO  s_area_code  VALUES ('589', '210105', '辽宁省', '沈阳市', '皇姑区', '辽宁省沈阳市皇姑区');
INSERT INTO  s_area_code  VALUES ('590', '210106', '辽宁省', '沈阳市', '铁西区', '辽宁省沈阳市铁西区');
INSERT INTO  s_area_code  VALUES ('591', '210111', '辽宁省', '沈阳市', '苏家屯区', '辽宁省沈阳市苏家屯区');
INSERT INTO  s_area_code  VALUES ('592', '210112', '辽宁省', '沈阳市', '东陵区', '辽宁省沈阳市东陵区');
INSERT INTO  s_area_code  VALUES ('593', '210113', '辽宁省', '沈阳市', '新城子区', '辽宁省沈阳市新城子区');
INSERT INTO  s_area_code  VALUES ('594', '210114', '辽宁省', '沈阳市', '于洪区', '辽宁省沈阳市于洪区');
INSERT INTO  s_area_code  VALUES ('595', '210122', '辽宁省', '沈阳市', '辽中县', '辽宁省辽中县');
INSERT INTO  s_area_code  VALUES ('596', '210123', '辽宁省', '沈阳市', '康平县', '辽宁省康平县');
INSERT INTO  s_area_code  VALUES ('597', '210124', '辽宁省', '沈阳市', '法库县', '辽宁省法库县');
INSERT INTO  s_area_code  VALUES ('598', '210181', '辽宁省', '沈阳市', '新民市', '辽宁省新民市');
INSERT INTO  s_area_code  VALUES ('599', '210200', '辽宁省', '大连市', '', '辽宁省大连市');
INSERT INTO  s_area_code  VALUES ('600', '210201', '辽宁省', '大连市', '市辖区', '辽宁省大连市市辖区');
INSERT INTO  s_area_code  VALUES ('601', '210202', '辽宁省', '大连市', '中山区', '辽宁省大连市中山区');
INSERT INTO  s_area_code  VALUES ('602', '210203', '辽宁省', '大连市', '西岗区', '辽宁省大连市西岗区');
INSERT INTO  s_area_code  VALUES ('603', '210204', '辽宁省', '大连市', '沙河口区', '辽宁省大连市沙河口区');
INSERT INTO  s_area_code  VALUES ('604', '210211', '辽宁省', '大连市', '甘井子区', '辽宁省大连市甘井子区');
INSERT INTO  s_area_code  VALUES ('605', '210212', '辽宁省', '大连市', '旅顺口区', '辽宁省大连市旅顺口区');
INSERT INTO  s_area_code  VALUES ('606', '210213', '辽宁省', '大连市', '金州区', '辽宁省大连市金州区');
INSERT INTO  s_area_code  VALUES ('607', '210224', '辽宁省', '大连市', '长海县', '辽宁省长海县');
INSERT INTO  s_area_code  VALUES ('608', '210281', '辽宁省', '大连市', '瓦房店市', '辽宁省瓦房店市');
INSERT INTO  s_area_code  VALUES ('609', '210282', '辽宁省', '大连市', '普兰店市', '辽宁省普兰店市');
INSERT INTO  s_area_code  VALUES ('610', '210283', '辽宁省', '大连市', '庄河市', '辽宁省庄河市');
INSERT INTO  s_area_code  VALUES ('611', '210300', '辽宁省', '鞍山市', '', '辽宁省鞍山市');
INSERT INTO  s_area_code  VALUES ('612', '210301', '辽宁省', '鞍山市', '市辖区', '辽宁省鞍山市市辖区');
INSERT INTO  s_area_code  VALUES ('613', '210302', '辽宁省', '鞍山市', '铁东区', '辽宁省鞍山市铁东区');
INSERT INTO  s_area_code  VALUES ('614', '210303', '辽宁省', '鞍山市', '铁西区', '辽宁省鞍山市铁西区');
INSERT INTO  s_area_code  VALUES ('615', '210304', '辽宁省', '鞍山市', '立山区', '辽宁省鞍山市立山区');
INSERT INTO  s_area_code  VALUES ('616', '210311', '辽宁省', '鞍山市', '千山区', '辽宁省鞍山市千山区');
INSERT INTO  s_area_code  VALUES ('617', '210321', '辽宁省', '鞍山市', '台安县', '辽宁省台安县');
INSERT INTO  s_area_code  VALUES ('618', '210323', '辽宁省', '鞍山市', '岫岩满族自治县', '辽宁省岫岩满族自治县');
INSERT INTO  s_area_code  VALUES ('619', '210381', '辽宁省', '鞍山市', '海城市', '辽宁省海城市');
INSERT INTO  s_area_code  VALUES ('620', '210400', '辽宁省', '抚顺市', '', '辽宁省抚顺市');
INSERT INTO  s_area_code  VALUES ('621', '210401', '辽宁省', '抚顺市', '市辖区', '辽宁省抚顺市市辖区');
INSERT INTO  s_area_code  VALUES ('622', '210402', '辽宁省', '抚顺市', '新抚区', '辽宁省抚顺市新抚区');
INSERT INTO  s_area_code  VALUES ('623', '210403', '辽宁省', '抚顺市', '东洲区', '辽宁省抚顺市东洲区');
INSERT INTO  s_area_code  VALUES ('624', '210404', '辽宁省', '抚顺市', '望花区', '辽宁省抚顺市望花区');
INSERT INTO  s_area_code  VALUES ('625', '210411', '辽宁省', '抚顺市', '顺城区', '辽宁省抚顺市顺城区');
INSERT INTO  s_area_code  VALUES ('626', '210421', '辽宁省', '抚顺市', '抚顺县', '辽宁省抚顺县');
INSERT INTO  s_area_code  VALUES ('627', '210422', '辽宁省', '抚顺市', '新宾满族自治县', '辽宁省新宾满族自治县');
INSERT INTO  s_area_code  VALUES ('628', '210423', '辽宁省', '抚顺市', '清原满族自治县', '辽宁省清原满族自治县');
INSERT INTO  s_area_code  VALUES ('629', '210500', '辽宁省', '本溪市', '', '辽宁省本溪市');
INSERT INTO  s_area_code  VALUES ('630', '210501', '辽宁省', '本溪市', '市辖区', '辽宁省本溪市市辖区');
INSERT INTO  s_area_code  VALUES ('631', '210502', '辽宁省', '本溪市', '平山区', '辽宁省本溪市平山区');
INSERT INTO  s_area_code  VALUES ('632', '210503', '辽宁省', '本溪市', '溪湖区', '辽宁省本溪市溪湖区');
INSERT INTO  s_area_code  VALUES ('633', '210504', '辽宁省', '本溪市', '明山区', '辽宁省本溪市明山区');
INSERT INTO  s_area_code  VALUES ('634', '210505', '辽宁省', '本溪市', '南芬区', '辽宁省本溪市南芬区');
INSERT INTO  s_area_code  VALUES ('635', '210521', '辽宁省', '本溪市', '本溪满族自治县', '辽宁省本溪满族自治县');
INSERT INTO  s_area_code  VALUES ('636', '210522', '辽宁省', '本溪市', '桓仁满族自治县', '辽宁省桓仁满族自治县');
INSERT INTO  s_area_code  VALUES ('637', '210600', '辽宁省', '丹东市', '', '辽宁省丹东市');
INSERT INTO  s_area_code  VALUES ('638', '210601', '辽宁省', '丹东市', '市辖区', '辽宁省丹东市市辖区');
INSERT INTO  s_area_code  VALUES ('639', '210602', '辽宁省', '丹东市', '元宝区', '辽宁省丹东市元宝区');
INSERT INTO  s_area_code  VALUES ('640', '210603', '辽宁省', '丹东市', '振兴区', '辽宁省丹东市振兴区');
INSERT INTO  s_area_code  VALUES ('641', '210604', '辽宁省', '丹东市', '振安区', '辽宁省丹东市振安区');
INSERT INTO  s_area_code  VALUES ('642', '210624', '辽宁省', '丹东市', '宽甸满族自治县', '辽宁省宽甸满族自治县');
INSERT INTO  s_area_code  VALUES ('643', '210681', '辽宁省', '丹东市', '东港市', '辽宁省东港市');
INSERT INTO  s_area_code  VALUES ('644', '210682', '辽宁省', '丹东市', '凤城市', '辽宁省凤城市');
INSERT INTO  s_area_code  VALUES ('645', '210700', '辽宁省', '锦州市', '', '辽宁省锦州市');
INSERT INTO  s_area_code  VALUES ('646', '210701', '辽宁省', '锦州市', '市辖区', '辽宁省锦州市市辖区');
INSERT INTO  s_area_code  VALUES ('647', '210702', '辽宁省', '锦州市', '古塔区', '辽宁省锦州市古塔区');
INSERT INTO  s_area_code  VALUES ('648', '210703', '辽宁省', '锦州市', '凌河区', '辽宁省锦州市凌河区');
INSERT INTO  s_area_code  VALUES ('649', '210711', '辽宁省', '锦州市', '太和区', '辽宁省锦州市太和区');
INSERT INTO  s_area_code  VALUES ('650', '210726', '辽宁省', '锦州市', '黑山县', '辽宁省黑山县');
INSERT INTO  s_area_code  VALUES ('651', '210727', '辽宁省', '锦州市', '义 县', '辽宁省义 县');
INSERT INTO  s_area_code  VALUES ('652', '210781', '辽宁省', '锦州市', '凌海市', '辽宁省凌海市');
INSERT INTO  s_area_code  VALUES ('653', '210782', '辽宁省', '锦州市', '北宁市', '辽宁省北宁市');
INSERT INTO  s_area_code  VALUES ('654', '210800', '辽宁省', '营口市', '', '辽宁省营口市');
INSERT INTO  s_area_code  VALUES ('655', '210801', '辽宁省', '营口市', '市辖区', '辽宁省营口市市辖区');
INSERT INTO  s_area_code  VALUES ('656', '210802', '辽宁省', '营口市', '站前区', '辽宁省营口市站前区');
INSERT INTO  s_area_code  VALUES ('657', '210803', '辽宁省', '营口市', '西市区', '辽宁省营口市西市区');
INSERT INTO  s_area_code  VALUES ('658', '210804', '辽宁省', '营口市', '鲅鱼圈区', '辽宁省营口市鲅鱼圈区');
INSERT INTO  s_area_code  VALUES ('659', '210811', '辽宁省', '营口市', '老边区', '辽宁省营口市老边区');
INSERT INTO  s_area_code  VALUES ('660', '210881', '辽宁省', '营口市', '盖州市', '辽宁省盖州市');
INSERT INTO  s_area_code  VALUES ('661', '210882', '辽宁省', '营口市', '大石桥市', '辽宁省大石桥市');
INSERT INTO  s_area_code  VALUES ('662', '210900', '辽宁省', '阜新市', '阜新市', '辽宁省阜新市阜新市');
INSERT INTO  s_area_code  VALUES ('663', '210901', '辽宁省', '阜新市', '市辖区', '辽宁省阜新市市辖区');
INSERT INTO  s_area_code  VALUES ('664', '210902', '辽宁省', '阜新市', '海州区', '辽宁省阜新市海州区');
INSERT INTO  s_area_code  VALUES ('665', '210903', '辽宁省', '阜新市', '新邱区', '辽宁省阜新市新邱区');
INSERT INTO  s_area_code  VALUES ('666', '210904', '辽宁省', '阜新市', '太平区', '辽宁省阜新市太平区');
INSERT INTO  s_area_code  VALUES ('667', '210905', '辽宁省', '阜新市', '清河门区', '辽宁省阜新市清河门区');
INSERT INTO  s_area_code  VALUES ('668', '210911', '辽宁省', '阜新市', '细河区', '辽宁省阜新市细河区');
INSERT INTO  s_area_code  VALUES ('669', '210921', '辽宁省', '阜新市', '阜新蒙古族自治县', '辽宁省阜新蒙古族自治县');
INSERT INTO  s_area_code  VALUES ('670', '210922', '辽宁省', '阜新市', '彰武县', '辽宁省彰武县');
INSERT INTO  s_area_code  VALUES ('671', '211000', '辽宁省', '辽阳市', '', '辽宁省辽阳市');
INSERT INTO  s_area_code  VALUES ('672', '211001', '辽宁省', '辽阳市', '市辖区', '辽宁省辽阳市市辖区');
INSERT INTO  s_area_code  VALUES ('673', '211002', '辽宁省', '辽阳市', '白塔区', '辽宁省辽阳市白塔区');
INSERT INTO  s_area_code  VALUES ('674', '211003', '辽宁省', '辽阳市', '文圣区', '辽宁省辽阳市文圣区');
INSERT INTO  s_area_code  VALUES ('675', '211004', '辽宁省', '辽阳市', '宏伟区', '辽宁省辽阳市宏伟区');
INSERT INTO  s_area_code  VALUES ('676', '211005', '辽宁省', '辽阳市', '弓长岭区', '辽宁省辽阳市弓长岭区');
INSERT INTO  s_area_code  VALUES ('677', '211011', '辽宁省', '辽阳市', '太子河区', '辽宁省辽阳市太子河区');
INSERT INTO  s_area_code  VALUES ('678', '211021', '辽宁省', '辽阳市', '辽阳县', '辽宁省辽阳县');
INSERT INTO  s_area_code  VALUES ('679', '211081', '辽宁省', '辽阳市', '灯塔市', '辽宁省灯塔市');
INSERT INTO  s_area_code  VALUES ('680', '211100', '辽宁省', '盘锦市', '', '辽宁省盘锦市');
INSERT INTO  s_area_code  VALUES ('681', '211101', '辽宁省', '盘锦市', '市辖区', '辽宁省盘锦市市辖区');
INSERT INTO  s_area_code  VALUES ('682', '211102', '辽宁省', '盘锦市', '双台子区', '辽宁省盘锦市双台子区');
INSERT INTO  s_area_code  VALUES ('683', '211103', '辽宁省', '盘锦市', '兴隆台区', '辽宁省盘锦市兴隆台区');
INSERT INTO  s_area_code  VALUES ('684', '211121', '辽宁省', '盘锦市', '大洼县', '辽宁省大洼县');
INSERT INTO  s_area_code  VALUES ('685', '211122', '辽宁省', '盘锦市', '盘山县', '辽宁省盘山县');
INSERT INTO  s_area_code  VALUES ('686', '211200', '辽宁省', '铁岭市', '', '辽宁省铁岭市');
INSERT INTO  s_area_code  VALUES ('687', '211201', '辽宁省', '铁岭市', '市辖区', '辽宁省铁岭市市辖区');
INSERT INTO  s_area_code  VALUES ('688', '211202', '辽宁省', '铁岭市', '银州区', '辽宁省铁岭市银州区');
INSERT INTO  s_area_code  VALUES ('689', '211204', '辽宁省', '铁岭市', '清河区', '辽宁省铁岭市清河区');
INSERT INTO  s_area_code  VALUES ('690', '211221', '辽宁省', '铁岭市', '铁岭县', '辽宁省铁岭县');
INSERT INTO  s_area_code  VALUES ('691', '211223', '辽宁省', '铁岭市', '西丰县', '辽宁省西丰县');
INSERT INTO  s_area_code  VALUES ('692', '211224', '辽宁省', '铁岭市', '昌图县', '辽宁省昌图县');
INSERT INTO  s_area_code  VALUES ('693', '211281', '辽宁省', '铁岭市', '调兵山市', '辽宁省调兵山市');
INSERT INTO  s_area_code  VALUES ('694', '211282', '辽宁省', '铁岭市', '开原市', '辽宁省开原市');
INSERT INTO  s_area_code  VALUES ('695', '211300', '辽宁省', '朝阳市', '', '辽宁省朝阳市');
INSERT INTO  s_area_code  VALUES ('696', '211301', '辽宁省', '朝阳市', '市辖区', '辽宁省朝阳市市辖区');
INSERT INTO  s_area_code  VALUES ('697', '211302', '辽宁省', '朝阳市', '双塔区', '辽宁省朝阳市双塔区');
INSERT INTO  s_area_code  VALUES ('698', '211303', '辽宁省', '朝阳市', '龙城区', '辽宁省朝阳市龙城区');
INSERT INTO  s_area_code  VALUES ('699', '211321', '辽宁省', '朝阳市', '朝阳县', '辽宁省朝阳县');
INSERT INTO  s_area_code  VALUES ('700', '211322', '辽宁省', '朝阳市', '建平县', '辽宁省建平县');
INSERT INTO  s_area_code  VALUES ('701', '211324', '辽宁省', '朝阳市', '喀喇沁左翼蒙古族自治县', '辽宁省喀喇沁左翼蒙古族自治县');
INSERT INTO  s_area_code  VALUES ('702', '211381', '辽宁省', '朝阳市', '北票市', '辽宁省北票市');
INSERT INTO  s_area_code  VALUES ('703', '211382', '辽宁省', '朝阳市', '凌源市', '辽宁省凌源市');
INSERT INTO  s_area_code  VALUES ('704', '211400', '辽宁省', '葫芦岛市', '', '辽宁省葫芦岛市');
INSERT INTO  s_area_code  VALUES ('705', '211401', '辽宁省', '葫芦岛市', '市辖区', '辽宁省葫芦岛市市辖区');
INSERT INTO  s_area_code  VALUES ('706', '211402', '辽宁省', '葫芦岛市', '连山区', '辽宁省葫芦岛市连山区');
INSERT INTO  s_area_code  VALUES ('707', '211403', '辽宁省', '葫芦岛市', '龙港区', '辽宁省葫芦岛市龙港区');
INSERT INTO  s_area_code  VALUES ('708', '211404', '辽宁省', '葫芦岛市', '南票区', '辽宁省葫芦岛市南票区');
INSERT INTO  s_area_code  VALUES ('709', '211421', '辽宁省', '葫芦岛市', '绥中县', '辽宁省绥中县');
INSERT INTO  s_area_code  VALUES ('710', '211422', '辽宁省', '葫芦岛市', '建昌县', '辽宁省建昌县');
INSERT INTO  s_area_code  VALUES ('711', '211481', '辽宁省', '葫芦岛市', '兴城市', '辽宁省兴城市');
INSERT INTO  s_area_code  VALUES ('712', '220000', '吉林省', '', '', '吉林省');
INSERT INTO  s_area_code  VALUES ('713', '220100', '吉林省', '长春市', '', '吉林省长春市');
INSERT INTO  s_area_code  VALUES ('714', '220101', '吉林省', '长春市', '市辖区', '吉林省长春市市辖区');
INSERT INTO  s_area_code  VALUES ('715', '220102', '吉林省', '长春市', '南关区', '吉林省长春市南关区');
INSERT INTO  s_area_code  VALUES ('716', '220103', '吉林省', '长春市', '宽城区', '吉林省长春市宽城区');
INSERT INTO  s_area_code  VALUES ('717', '220104', '吉林省', '长春市', '朝阳区', '吉林省长春市朝阳区');
INSERT INTO  s_area_code  VALUES ('718', '220105', '吉林省', '长春市', '二道区', '吉林省长春市二道区');
INSERT INTO  s_area_code  VALUES ('719', '220106', '吉林省', '长春市', '绿园区', '吉林省长春市绿园区');
INSERT INTO  s_area_code  VALUES ('720', '220112', '吉林省', '长春市', '双阳区', '吉林省长春市双阳区');
INSERT INTO  s_area_code  VALUES ('721', '220122', '吉林省', '长春市', '农安县', '吉林省农安县');
INSERT INTO  s_area_code  VALUES ('722', '220181', '吉林省', '长春市', '九台市', '吉林省九台市');
INSERT INTO  s_area_code  VALUES ('723', '220182', '吉林省', '长春市', '榆树市', '吉林省榆树市');
INSERT INTO  s_area_code  VALUES ('724', '220183', '吉林省', '长春市', '德惠市', '吉林省德惠市');
INSERT INTO  s_area_code  VALUES ('725', '220200', '吉林省', '吉林市', '', '吉林省吉林市');
INSERT INTO  s_area_code  VALUES ('726', '220201', '吉林省', '吉林市', '市辖区', '吉林省吉林市市辖区');
INSERT INTO  s_area_code  VALUES ('727', '220202', '吉林省', '吉林市', '昌邑区', '吉林省吉林市昌邑区');
INSERT INTO  s_area_code  VALUES ('728', '220203', '吉林省', '吉林市', '龙潭区', '吉林省吉林市龙潭区');
INSERT INTO  s_area_code  VALUES ('729', '220204', '吉林省', '吉林市', '船营区', '吉林省吉林市船营区');
INSERT INTO  s_area_code  VALUES ('730', '220211', '吉林省', '吉林市', '丰满区', '吉林省吉林市丰满区');
INSERT INTO  s_area_code  VALUES ('731', '220221', '吉林省', '吉林市', '永吉县', '吉林省永吉县');
INSERT INTO  s_area_code  VALUES ('732', '220281', '吉林省', '吉林市', '蛟河市', '吉林省蛟河市');
INSERT INTO  s_area_code  VALUES ('733', '220282', '吉林省', '吉林市', '桦甸市', '吉林省桦甸市');
INSERT INTO  s_area_code  VALUES ('734', '220283', '吉林省', '吉林市', '舒兰市', '吉林省舒兰市');
INSERT INTO  s_area_code  VALUES ('735', '220284', '吉林省', '吉林市', '磐石市', '吉林省磐石市');
INSERT INTO  s_area_code  VALUES ('736', '220300', '吉林省', '四平市', '四平市', '吉林省四平市四平市');
INSERT INTO  s_area_code  VALUES ('737', '220301', '吉林省', '四平市', '市辖区', '吉林省四平市市辖区');
INSERT INTO  s_area_code  VALUES ('738', '220302', '吉林省', '四平市', '铁西区', '吉林省四平市铁西区');
INSERT INTO  s_area_code  VALUES ('739', '220303', '吉林省', '四平市', '铁东区', '吉林省四平市铁东区');
INSERT INTO  s_area_code  VALUES ('740', '220322', '吉林省', '四平市', '梨树县', '吉林省梨树县');
INSERT INTO  s_area_code  VALUES ('741', '220323', '吉林省', '四平市', '伊通满族自治县', '吉林省伊通满族自治县');
INSERT INTO  s_area_code  VALUES ('742', '220381', '吉林省', '四平市', '公主岭市', '吉林省公主岭市');
INSERT INTO  s_area_code  VALUES ('743', '220382', '吉林省', '四平市', '双辽市', '吉林省双辽市');
INSERT INTO  s_area_code  VALUES ('744', '220400', '吉林省', '辽源市', '', '吉林省辽源市');
INSERT INTO  s_area_code  VALUES ('745', '220401', '吉林省', '辽源市', '市辖区', '吉林省辽源市市辖区');
INSERT INTO  s_area_code  VALUES ('746', '220402', '吉林省', '辽源市', '龙山区', '吉林省辽源市龙山区');
INSERT INTO  s_area_code  VALUES ('747', '220403', '吉林省', '辽源市', '西安区', '吉林省辽源市西安区');
INSERT INTO  s_area_code  VALUES ('748', '220421', '吉林省', '辽源市', '东丰县', '吉林省东丰县');
INSERT INTO  s_area_code  VALUES ('749', '220422', '吉林省', '辽源市', '东辽县', '吉林省东辽县');
INSERT INTO  s_area_code  VALUES ('750', '220500', '吉林省', '通化市', '', '吉林省通化市');
INSERT INTO  s_area_code  VALUES ('751', '220501', '吉林省', '通化市', '市辖区', '吉林省通化市市辖区');
INSERT INTO  s_area_code  VALUES ('752', '220502', '吉林省', '通化市', '东昌区', '吉林省通化市东昌区');
INSERT INTO  s_area_code  VALUES ('753', '220503', '吉林省', '通化市', '二道江区', '吉林省通化市二道江区');
INSERT INTO  s_area_code  VALUES ('754', '220521', '吉林省', '通化市', '通化县', '吉林省通化县');
INSERT INTO  s_area_code  VALUES ('755', '220523', '吉林省', '通化市', '辉南县', '吉林省辉南县');
INSERT INTO  s_area_code  VALUES ('756', '220524', '吉林省', '通化市', '柳河县', '吉林省柳河县');
INSERT INTO  s_area_code  VALUES ('757', '220581', '吉林省', '通化市', '梅河口市', '吉林省梅河口市');
INSERT INTO  s_area_code  VALUES ('758', '220582', '吉林省', '通化市', '集安市', '吉林省集安市');
INSERT INTO  s_area_code  VALUES ('759', '220600', '吉林省', '白山市', '', '吉林省白山市');
INSERT INTO  s_area_code  VALUES ('760', '220601', '吉林省', '白山市', '市辖区', '吉林省白山市市辖区');
INSERT INTO  s_area_code  VALUES ('761', '220602', '吉林省', '白山市', '八道江区', '吉林省白山市八道江区');
INSERT INTO  s_area_code  VALUES ('762', '220621', '吉林省', '白山市', '抚松县', '吉林省抚松县');
INSERT INTO  s_area_code  VALUES ('763', '220622', '吉林省', '白山市', '靖宇县', '吉林省靖宇县');
INSERT INTO  s_area_code  VALUES ('764', '220623', '吉林省', '白山市', '长白朝鲜族自治县', '吉林省长白朝鲜族自治县');
INSERT INTO  s_area_code  VALUES ('765', '220625', '吉林省', '白山市', '江源县', '吉林省江源县');
INSERT INTO  s_area_code  VALUES ('766', '220681', '吉林省', '白山市', '临江市', '吉林省临江市');
INSERT INTO  s_area_code  VALUES ('767', '220700', '吉林省', '松原市', '', '吉林省松原市');
INSERT INTO  s_area_code  VALUES ('768', '220701', '吉林省', '松原市', '市辖区', '吉林省松原市市辖区');
INSERT INTO  s_area_code  VALUES ('769', '220702', '吉林省', '松原市', '宁江区', '吉林省松原市宁江区');
INSERT INTO  s_area_code  VALUES ('770', '220721', '吉林省', '松原市', '前郭尔罗斯蒙古族自治县', '吉林省前郭尔罗斯蒙古族自治县');
INSERT INTO  s_area_code  VALUES ('771', '220722', '吉林省', '松原市', '长岭县', '吉林省长岭县');
INSERT INTO  s_area_code  VALUES ('772', '220723', '吉林省', '松原市', '乾安县', '吉林省乾安县');
INSERT INTO  s_area_code  VALUES ('773', '220724', '吉林省', '松原市', '扶余县', '吉林省扶余县');
INSERT INTO  s_area_code  VALUES ('774', '220800', '吉林省', '白城市', '', '吉林省白城市');
INSERT INTO  s_area_code  VALUES ('775', '220801', '吉林省', '白城市', '市辖区', '吉林省市辖区');
INSERT INTO  s_area_code  VALUES ('776', '220802', '吉林省', '白城市', '洮北区', '吉林省洮北区');
INSERT INTO  s_area_code  VALUES ('777', '220821', '吉林省', '白城市', '镇赉县', '吉林省镇赉县');
INSERT INTO  s_area_code  VALUES ('778', '220822', '吉林省', '白城市', '通榆县', '吉林省通榆县');
INSERT INTO  s_area_code  VALUES ('779', '220881', '吉林省', '白城市', '洮南市', '吉林省洮南市');
INSERT INTO  s_area_code  VALUES ('780', '220882', '吉林省', '白城市', '大安市', '吉林省大安市');
INSERT INTO  s_area_code  VALUES ('781', '222400', '吉林省', '延边朝鲜族自治州', '', '吉林省延边朝鲜族自治州');
INSERT INTO  s_area_code  VALUES ('782', '222401', '吉林省', '延边朝鲜族自治州', '延吉市', '吉林省延吉市');
INSERT INTO  s_area_code  VALUES ('783', '222402', '吉林省', '延边朝鲜族自治州', '图们市', '吉林省图们市');
INSERT INTO  s_area_code  VALUES ('784', '222403', '吉林省', '延边朝鲜族自治州', '敦化市', '吉林省敦化市');
INSERT INTO  s_area_code  VALUES ('785', '222404', '吉林省', '延边朝鲜族自治州', '珲春市', '吉林省珲春市');
INSERT INTO  s_area_code  VALUES ('786', '222405', '吉林省', '延边朝鲜族自治州', '龙井市', '吉林省龙井市');
INSERT INTO  s_area_code  VALUES ('787', '222406', '吉林省', '延边朝鲜族自治州', '和龙市', '吉林省和龙市');
INSERT INTO  s_area_code  VALUES ('788', '222424', '吉林省', '延边朝鲜族自治州', '汪清县', '吉林省汪清县');
INSERT INTO  s_area_code  VALUES ('789', '222426', '吉林省', '延边朝鲜族自治州', '安图县', '吉林省安图县');
INSERT INTO  s_area_code  VALUES ('790', '230000', '黑龙江省', '', '', '黑龙江省');
INSERT INTO  s_area_code  VALUES ('791', '230100', '黑龙江省', '哈尔滨市', '', '黑龙江省哈尔滨市');
INSERT INTO  s_area_code  VALUES ('792', '230101', '黑龙江省', '哈尔滨市', '市辖区', '黑龙江省哈尔滨市市辖区');
INSERT INTO  s_area_code  VALUES ('793', '230102', '黑龙江省', '哈尔滨市', '道里区', '黑龙江省哈尔滨市道里区');
INSERT INTO  s_area_code  VALUES ('794', '230103', '黑龙江省', '哈尔滨市', '南岗区', '黑龙江省哈尔滨市南岗区');
INSERT INTO  s_area_code  VALUES ('795', '230104', '黑龙江省', '哈尔滨市', '道外区', '黑龙江省哈尔滨市道外区');
INSERT INTO  s_area_code  VALUES ('796', '230105', '黑龙江省', '哈尔滨市', '呼兰', '黑龙江哈尔滨市呼兰县');
INSERT INTO  s_area_code  VALUES ('797', '230106', '黑龙江省', '哈尔滨市', '香坊区', '黑龙江省哈尔滨市香坊区');
INSERT INTO  s_area_code  VALUES ('798', '230107', '黑龙江省', '哈尔滨市', '动力区', '黑龙江省哈尔滨市动力区');
INSERT INTO  s_area_code  VALUES ('799', '230108', '黑龙江省', '哈尔滨市', '平房区', '黑龙江省哈尔滨市平房区');
INSERT INTO  s_area_code  VALUES ('800', '230109', '黑龙江省', '哈尔滨市', '松北区', '黑龙江省哈尔滨市松北区');
INSERT INTO  s_area_code  VALUES ('801', '230111', '黑龙江省', '哈尔滨市', '呼兰区', '黑龙江省哈尔滨市呼兰区');
INSERT INTO  s_area_code  VALUES ('802', '230121', '黑龙江省', '哈尔滨市', '太平区', '黑龙江哈尔滨市太平区');
INSERT INTO  s_area_code  VALUES ('803', '230123', '黑龙江省', '哈尔滨市', '依兰县', '黑龙江省依兰县');
INSERT INTO  s_area_code  VALUES ('804', '230124', '黑龙江省', '哈尔滨市', '方正县', '黑龙江省方正县');
INSERT INTO  s_area_code  VALUES ('805', '230125', '黑龙江省', '哈尔滨市', '宾 县', '黑龙江省宾 县');
INSERT INTO  s_area_code  VALUES ('806', '230126', '黑龙江省', '哈尔滨市', '巴彦县', '黑龙江省巴彦县');
INSERT INTO  s_area_code  VALUES ('807', '230127', '黑龙江省', '哈尔滨市', '木兰县', '黑龙江省木兰县');
INSERT INTO  s_area_code  VALUES ('808', '230128', '黑龙江省', '哈尔滨市', '通河县', '黑龙江省通河县');
INSERT INTO  s_area_code  VALUES ('809', '230129', '黑龙江省', '哈尔滨市', '延寿县', '黑龙江省延寿县');
INSERT INTO  s_area_code  VALUES ('810', '230181', '黑龙江省', '哈尔滨市', '阿城市', '黑龙江省阿城市');
INSERT INTO  s_area_code  VALUES ('811', '230182', '黑龙江省', '哈尔滨市', '双城市', '黑龙江省双城市');
INSERT INTO  s_area_code  VALUES ('812', '230183', '黑龙江省', '哈尔滨市', '尚志市', '黑龙江省尚志市');
INSERT INTO  s_area_code  VALUES ('813', '230184', '黑龙江省', '哈尔滨市', '五常市', '黑龙江省五常市');
INSERT INTO  s_area_code  VALUES ('814', '230200', '黑龙江省', '齐齐哈尔市', '', '黑龙江省齐齐哈尔市');
INSERT INTO  s_area_code  VALUES ('815', '230201', '黑龙江省', '齐齐哈尔市', '市辖区', '黑龙江省齐齐哈尔市市辖区');
INSERT INTO  s_area_code  VALUES ('816', '230202', '黑龙江省', '齐齐哈尔市', '龙沙区', '黑龙江省齐齐哈尔市龙沙区');
INSERT INTO  s_area_code  VALUES ('817', '230203', '黑龙江省', '齐齐哈尔市', '建华区', '黑龙江省齐齐哈尔市建华区');
INSERT INTO  s_area_code  VALUES ('818', '230204', '黑龙江省', '齐齐哈尔市', '铁锋区', '黑龙江省齐齐哈尔市铁锋区');
INSERT INTO  s_area_code  VALUES ('819', '230205', '黑龙江省', '齐齐哈尔市', '昂昂溪区', '黑龙江省齐齐哈尔市昂昂溪区');
INSERT INTO  s_area_code  VALUES ('820', '230206', '黑龙江省', '齐齐哈尔市', '富拉尔基区', '黑龙江省齐齐哈尔市富拉尔基区');
INSERT INTO  s_area_code  VALUES ('821', '230207', '黑龙江省', '齐齐哈尔市', '碾子山区', '黑龙江省齐齐哈尔市碾子山区');
INSERT INTO  s_area_code  VALUES ('822', '230208', '黑龙江省', '齐齐哈尔市', '梅里斯达斡尔族区', '黑龙江省齐齐哈尔市梅里斯达斡尔族区');
INSERT INTO  s_area_code  VALUES ('823', '230221', '黑龙江省', '齐齐哈尔市', '龙江县', '黑龙江省龙江县');
INSERT INTO  s_area_code  VALUES ('824', '230223', '黑龙江省', '齐齐哈尔市', '依安县', '黑龙江省依安县');
INSERT INTO  s_area_code  VALUES ('825', '230224', '黑龙江省', '齐齐哈尔市', '泰来县', '黑龙江省泰来县');
INSERT INTO  s_area_code  VALUES ('826', '230225', '黑龙江省', '齐齐哈尔市', '甘南县', '黑龙江省甘南县');
INSERT INTO  s_area_code  VALUES ('827', '230227', '黑龙江省', '齐齐哈尔市', '富裕县', '黑龙江省富裕县');
INSERT INTO  s_area_code  VALUES ('828', '230229', '黑龙江省', '齐齐哈尔市', '克山县', '黑龙江省克山县');
INSERT INTO  s_area_code  VALUES ('829', '230230', '黑龙江省', '齐齐哈尔市', '克东县', '黑龙江省克东县');
INSERT INTO  s_area_code  VALUES ('830', '230231', '黑龙江省', '齐齐哈尔市', '拜泉县', '黑龙江省拜泉县');
INSERT INTO  s_area_code  VALUES ('831', '230281', '黑龙江省', '齐齐哈尔市', '讷河市', '黑龙江省讷河市');
INSERT INTO  s_area_code  VALUES ('832', '230300', '黑龙江省', '鸡西市', '', '黑龙江省鸡西市');
INSERT INTO  s_area_code  VALUES ('833', '230301', '黑龙江省', '鸡西市', '市辖区', '黑龙江省鸡西市市辖区');
INSERT INTO  s_area_code  VALUES ('834', '230302', '黑龙江省', '鸡西市', '鸡冠区', '黑龙江省鸡西市鸡冠区');
INSERT INTO  s_area_code  VALUES ('835', '230303', '黑龙江省', '鸡西市', '恒山区', '黑龙江省鸡西市恒山区');
INSERT INTO  s_area_code  VALUES ('836', '230304', '黑龙江省', '鸡西市', '滴道区', '黑龙江省鸡西市滴道区');
INSERT INTO  s_area_code  VALUES ('837', '230305', '黑龙江省', '鸡西市', '梨树区', '黑龙江省鸡西市梨树区');
INSERT INTO  s_area_code  VALUES ('838', '230306', '黑龙江省', '鸡西市', '城子河区', '黑龙江省鸡西市城子河区');
INSERT INTO  s_area_code  VALUES ('839', '230307', '黑龙江省', '鸡西市', '麻山区', '黑龙江省鸡西市麻山区');
INSERT INTO  s_area_code  VALUES ('840', '230321', '黑龙江省', '鸡西市', '鸡东县', '黑龙江省鸡东县');
INSERT INTO  s_area_code  VALUES ('841', '230381', '黑龙江省', '鸡西市', '虎林市', '黑龙江省虎林市');
INSERT INTO  s_area_code  VALUES ('842', '230382', '黑龙江省', '鸡西市', '密山市', '黑龙江省密山市');
INSERT INTO  s_area_code  VALUES ('843', '230400', '黑龙江省', '鹤岗市', '', '黑龙江省鹤岗市');
INSERT INTO  s_area_code  VALUES ('844', '230401', '黑龙江省', '鹤岗市', '市辖区', '黑龙江省鹤岗市市辖区');
INSERT INTO  s_area_code  VALUES ('845', '230402', '黑龙江省', '鹤岗市', '向阳区', '黑龙江省鹤岗市向阳区');
INSERT INTO  s_area_code  VALUES ('846', '230403', '黑龙江省', '鹤岗市', '工农区', '黑龙江省鹤岗市工农区');
INSERT INTO  s_area_code  VALUES ('847', '230404', '黑龙江省', '鹤岗市', '南山区', '黑龙江省鹤岗市南山区');
INSERT INTO  s_area_code  VALUES ('848', '230405', '黑龙江省', '鹤岗市', '兴安区', '黑龙江省鹤岗市兴安区');
INSERT INTO  s_area_code  VALUES ('849', '230406', '黑龙江省', '鹤岗市', '东山区', '黑龙江省鹤岗市东山区');
INSERT INTO  s_area_code  VALUES ('850', '230407', '黑龙江省', '鹤岗市', '兴山区', '黑龙江省鹤岗市兴山区');
INSERT INTO  s_area_code  VALUES ('851', '230421', '黑龙江省', '鹤岗市', '萝北县', '黑龙江省萝北县');
INSERT INTO  s_area_code  VALUES ('852', '230422', '黑龙江省', '鹤岗市', '绥滨县', '黑龙江省绥滨县');
INSERT INTO  s_area_code  VALUES ('853', '230500', '黑龙江省', '双鸭山市', '', '黑龙江省双鸭山市');
INSERT INTO  s_area_code  VALUES ('854', '230501', '黑龙江省', '双鸭山市', '市辖区', '黑龙江省双鸭山市市辖区');
INSERT INTO  s_area_code  VALUES ('855', '230502', '黑龙江省', '双鸭山市', '尖山区', '黑龙江省双鸭山市尖山区');
INSERT INTO  s_area_code  VALUES ('856', '230503', '黑龙江省', '双鸭山市', '岭东区', '黑龙江省双鸭山市岭东区');
INSERT INTO  s_area_code  VALUES ('857', '230505', '黑龙江省', '双鸭山市', '四方台区', '黑龙江省双鸭山市四方台区');
INSERT INTO  s_area_code  VALUES ('858', '230506', '黑龙江省', '双鸭山市', '宝山区', '黑龙江省双鸭山市宝山区');
INSERT INTO  s_area_code  VALUES ('859', '230521', '黑龙江省', '双鸭山市', '集贤县', '黑龙江省集贤县');
INSERT INTO  s_area_code  VALUES ('860', '230522', '黑龙江省', '双鸭山市', '友谊县', '黑龙江省友谊县');
INSERT INTO  s_area_code  VALUES ('861', '230523', '黑龙江省', '双鸭山市', '宝清县', '黑龙江省宝清县');
INSERT INTO  s_area_code  VALUES ('862', '230524', '黑龙江省', '双鸭山市', '饶河县', '黑龙江省饶河县');
INSERT INTO  s_area_code  VALUES ('863', '230600', '黑龙江省', '大庆市', '', '黑龙江省大庆市');
INSERT INTO  s_area_code  VALUES ('864', '230601', '黑龙江省', '大庆市', '市辖区', '黑龙江省大庆市市辖区');
INSERT INTO  s_area_code  VALUES ('865', '230602', '黑龙江省', '大庆市', '萨尔图区', '黑龙江省大庆市萨尔图区');
INSERT INTO  s_area_code  VALUES ('866', '230603', '黑龙江省', '大庆市', '龙凤区', '黑龙江省大庆市龙凤区');
INSERT INTO  s_area_code  VALUES ('867', '230604', '黑龙江省', '大庆市', '让胡路区', '黑龙江省大庆市让胡路区');
INSERT INTO  s_area_code  VALUES ('868', '230605', '黑龙江省', '大庆市', '红岗区', '黑龙江省大庆市红岗区');
INSERT INTO  s_area_code  VALUES ('869', '230606', '黑龙江省', '大庆市', '大同区', '黑龙江省大庆市大同区');
INSERT INTO  s_area_code  VALUES ('870', '230621', '黑龙江省', '大庆市', '肇州县', '黑龙江省肇州县');
INSERT INTO  s_area_code  VALUES ('871', '230622', '黑龙江省', '大庆市', '肇源县', '黑龙江省肇源县');
INSERT INTO  s_area_code  VALUES ('872', '230623', '黑龙江省', '大庆市', '林甸县', '黑龙江省林甸县');
INSERT INTO  s_area_code  VALUES ('873', '230624', '黑龙江省', '大庆市', '杜尔伯特蒙古族自治县', '黑龙江省杜尔伯特蒙古族自治县');
INSERT INTO  s_area_code  VALUES ('874', '230700', '黑龙江省', '伊春市', '', '黑龙江省伊春市');
INSERT INTO  s_area_code  VALUES ('875', '230701', '黑龙江省', '伊春市', '市辖区', '黑龙江省伊春市市辖区');
INSERT INTO  s_area_code  VALUES ('876', '230702', '黑龙江省', '伊春市', '伊春区', '黑龙江省伊春市伊春区');
INSERT INTO  s_area_code  VALUES ('877', '230703', '黑龙江省', '伊春市', '南岔区', '黑龙江省伊春市南岔区');
INSERT INTO  s_area_code  VALUES ('878', '230704', '黑龙江省', '伊春市', '友好区', '黑龙江省伊春市友好区');
INSERT INTO  s_area_code  VALUES ('879', '230705', '黑龙江省', '伊春市', '西林区', '黑龙江省伊春市西林区');
INSERT INTO  s_area_code  VALUES ('880', '230706', '黑龙江省', '伊春市', '翠峦区', '黑龙江省伊春市翠峦区');
INSERT INTO  s_area_code  VALUES ('881', '230707', '黑龙江省', '伊春市', '新青区', '黑龙江省伊春市新青区');
INSERT INTO  s_area_code  VALUES ('882', '230708', '黑龙江省', '伊春市', '美溪区', '黑龙江省伊春市美溪区');
INSERT INTO  s_area_code  VALUES ('883', '230709', '黑龙江省', '伊春市', '金山屯区', '黑龙江省伊春市金山屯区');
INSERT INTO  s_area_code  VALUES ('884', '230710', '黑龙江省', '伊春市', '五营区', '黑龙江省伊春市五营区');
INSERT INTO  s_area_code  VALUES ('885', '230711', '黑龙江省', '伊春市', '乌马河区', '黑龙江省伊春市乌马河区');
INSERT INTO  s_area_code  VALUES ('886', '230712', '黑龙江省', '伊春市', '汤旺河区', '黑龙江省伊春市汤旺河区');
INSERT INTO  s_area_code  VALUES ('887', '230713', '黑龙江省', '伊春市', '带岭区', '黑龙江省伊春市带岭区');
INSERT INTO  s_area_code  VALUES ('888', '230714', '黑龙江省', '伊春市', '乌伊岭区', '黑龙江省伊春市乌伊岭区');
INSERT INTO  s_area_code  VALUES ('889', '230715', '黑龙江省', '伊春市', '红星区', '黑龙江省伊春市红星区');
INSERT INTO  s_area_code  VALUES ('890', '230716', '黑龙江省', '伊春市', '上甘岭区', '黑龙江省伊春市上甘岭区');
INSERT INTO  s_area_code  VALUES ('891', '230722', '黑龙江省', '伊春市', '嘉荫县', '黑龙江省嘉荫县');
INSERT INTO  s_area_code  VALUES ('892', '230781', '黑龙江省', '伊春市', '铁力市', '黑龙江省铁力市');
INSERT INTO  s_area_code  VALUES ('893', '230800', '黑龙江省', '佳木斯市', '', '黑龙江省佳木斯市');
INSERT INTO  s_area_code  VALUES ('894', '230801', '黑龙江省', '佳木斯市', '市辖区', '黑龙江省佳木斯市市辖区');
INSERT INTO  s_area_code  VALUES ('895', '230802', '黑龙江省', '佳木斯市', '永红区', '黑龙江省佳木斯市永红区');
INSERT INTO  s_area_code  VALUES ('896', '230803', '黑龙江省', '佳木斯市', '向阳区', '黑龙江省佳木斯市向阳区');
INSERT INTO  s_area_code  VALUES ('897', '230804', '黑龙江省', '佳木斯市', '前进区', '黑龙江省佳木斯市前进区');
INSERT INTO  s_area_code  VALUES ('898', '230805', '黑龙江省', '佳木斯市', '东风区', '黑龙江省佳木斯市东风区');
INSERT INTO  s_area_code  VALUES ('899', '230811', '黑龙江省', '佳木斯市', '郊 区', '黑龙江省佳木斯市郊 区');
INSERT INTO  s_area_code  VALUES ('900', '230822', '黑龙江省', '佳木斯市', '桦南县', '黑龙江省桦南县');
INSERT INTO  s_area_code  VALUES ('901', '230826', '黑龙江省', '佳木斯市', '桦川县', '黑龙江省桦川县');
INSERT INTO  s_area_code  VALUES ('902', '230828', '黑龙江省', '佳木斯市', '汤原县', '黑龙江省汤原县');
INSERT INTO  s_area_code  VALUES ('903', '230833', '黑龙江省', '佳木斯市', '抚远县', '黑龙江省抚远县');
INSERT INTO  s_area_code  VALUES ('904', '230881', '黑龙江省', '佳木斯市', '同江市', '黑龙江省同江市');
INSERT INTO  s_area_code  VALUES ('905', '230882', '黑龙江省', '佳木斯市', '富锦市', '黑龙江省富锦市');
INSERT INTO  s_area_code  VALUES ('906', '230900', '黑龙江省', '七台河市', '', '黑龙江省七台河市');
INSERT INTO  s_area_code  VALUES ('907', '230901', '黑龙江省', '七台河市', '市辖区', '黑龙江省七台河市市辖区');
INSERT INTO  s_area_code  VALUES ('908', '230902', '黑龙江省', '七台河市', '新兴区', '黑龙江省七台河市新兴区');
INSERT INTO  s_area_code  VALUES ('909', '230903', '黑龙江省', '七台河市', '桃山区', '黑龙江省七台河市桃山区');
INSERT INTO  s_area_code  VALUES ('910', '230904', '黑龙江省', '七台河市', '茄子河区', '黑龙江省七台河市茄子河区');
INSERT INTO  s_area_code  VALUES ('911', '230921', '黑龙江省', '七台河市', '勃利县', '黑龙江省勃利县');
INSERT INTO  s_area_code  VALUES ('912', '231000', '黑龙江省', '牡丹江市', '', '黑龙江省牡丹江市');
INSERT INTO  s_area_code  VALUES ('913', '231001', '黑龙江省', '牡丹江市', '市辖区', '黑龙江省牡丹江市市辖区');
INSERT INTO  s_area_code  VALUES ('914', '231002', '黑龙江省', '牡丹江市', '东安区', '黑龙江省牡丹江市东安区');
INSERT INTO  s_area_code  VALUES ('915', '231003', '黑龙江省', '牡丹江市', '阳明区', '黑龙江省牡丹江市阳明区');
INSERT INTO  s_area_code  VALUES ('916', '231004', '黑龙江省', '牡丹江市', '爱民区', '黑龙江省牡丹江市爱民区');
INSERT INTO  s_area_code  VALUES ('917', '231005', '黑龙江省', '牡丹江市', '西安区', '黑龙江省牡丹江市西安区');
INSERT INTO  s_area_code  VALUES ('918', '231024', '黑龙江省', '牡丹江市', '东宁县', '黑龙江省东宁县');
INSERT INTO  s_area_code  VALUES ('919', '231025', '黑龙江省', '牡丹江市', '林口县', '黑龙江省林口县');
INSERT INTO  s_area_code  VALUES ('920', '231081', '黑龙江省', '牡丹江市', '绥芬河市', '黑龙江省绥芬河市');
INSERT INTO  s_area_code  VALUES ('921', '231083', '黑龙江省', '牡丹江市', '海林市', '黑龙江省海林市');
INSERT INTO  s_area_code  VALUES ('922', '231084', '黑龙江省', '牡丹江市', '宁安市', '黑龙江省宁安市');
INSERT INTO  s_area_code  VALUES ('923', '231085', '黑龙江省', '牡丹江市', '穆棱市', '黑龙江省穆棱市');
INSERT INTO  s_area_code  VALUES ('924', '231100', '黑龙江省', '黑河市', '', '黑龙江省黑河市');
INSERT INTO  s_area_code  VALUES ('925', '231101', '黑龙江省', '黑河市', '市辖区', '黑龙江省黑河市市辖区');
INSERT INTO  s_area_code  VALUES ('926', '231102', '黑龙江省', '黑河市', '爱辉区', '黑龙江省黑河市爱辉区');
INSERT INTO  s_area_code  VALUES ('927', '231121', '黑龙江省', '黑河市', '嫩江县', '黑龙江省嫩江县');
INSERT INTO  s_area_code  VALUES ('928', '231123', '黑龙江省', '黑河市', '逊克县', '黑龙江省逊克县');
INSERT INTO  s_area_code  VALUES ('929', '231124', '黑龙江省', '黑河市', '孙吴县', '黑龙江省孙吴县');
INSERT INTO  s_area_code  VALUES ('930', '231181', '黑龙江省', '黑河市', '北安市', '黑龙江省北安市');
INSERT INTO  s_area_code  VALUES ('931', '231182', '黑龙江省', '黑河市', '五大连池市', '黑龙江省五大连池市');
INSERT INTO  s_area_code  VALUES ('932', '231200', '黑龙江省', '绥化市', '', '黑龙江省绥化市');
INSERT INTO  s_area_code  VALUES ('933', '231201', '黑龙江省', '绥化市', '市辖区', '黑龙江省绥化市市辖区');
INSERT INTO  s_area_code  VALUES ('934', '231202', '黑龙江省', '绥化市', '北林区', '黑龙江省绥化市北林区');
INSERT INTO  s_area_code  VALUES ('935', '231221', '黑龙江省', '绥化市', '望奎县', '黑龙江省望奎县');
INSERT INTO  s_area_code  VALUES ('936', '231222', '黑龙江省', '绥化市', '兰西县', '黑龙江省兰西县');
INSERT INTO  s_area_code  VALUES ('937', '231223', '黑龙江省', '绥化市', '青冈县', '黑龙江省青冈县');
INSERT INTO  s_area_code  VALUES ('938', '231224', '黑龙江省', '绥化市', '庆安县', '黑龙江省庆安县');
INSERT INTO  s_area_code  VALUES ('939', '231225', '黑龙江省', '绥化市', '明水县', '黑龙江省明水县');
INSERT INTO  s_area_code  VALUES ('940', '231226', '黑龙江省', '绥化市', '绥棱县', '黑龙江省绥棱县');
INSERT INTO  s_area_code  VALUES ('941', '231281', '黑龙江省', '绥化市', '安达市', '黑龙江省安达市');
INSERT INTO  s_area_code  VALUES ('942', '231282', '黑龙江省', '绥化市', '肇东市', '黑龙江省肇东市');
INSERT INTO  s_area_code  VALUES ('943', '231283', '黑龙江省', '绥化市', '海伦市', '黑龙江省海伦市');
INSERT INTO  s_area_code  VALUES ('944', '232700', '黑龙江省', '大兴安岭地区', '', '黑龙江省大兴安岭地区');
INSERT INTO  s_area_code  VALUES ('945', '232721', '黑龙江省', '大兴安岭地区', '呼玛县', '黑龙江省呼玛县');
INSERT INTO  s_area_code  VALUES ('946', '232722', '黑龙江省', '大兴安岭地区', '塔河县', '黑龙江省塔河县');
INSERT INTO  s_area_code  VALUES ('947', '232723', '黑龙江省', '大兴安岭地区', '漠河县', '黑龙江省漠河县');
INSERT INTO  s_area_code  VALUES ('948', '310000', '上海市', '', '', '上海市');
INSERT INTO  s_area_code  VALUES ('949', '310100', '上海市', '上海市', '市辖区', '上海市市辖区');
INSERT INTO  s_area_code  VALUES ('950', '310101', '上海市', '上海市', '黄浦区', '上海市黄浦区');
INSERT INTO  s_area_code  VALUES ('951', '310102', '上海市', '上海市', '南市区', '上海市南市区 ');
INSERT INTO  s_area_code  VALUES ('952', '310103', '上海市', '上海市', '卢湾区', '上海市卢湾区');
INSERT INTO  s_area_code  VALUES ('953', '310104', '上海市', '上海市', '徐汇区', '上海市徐汇区');
INSERT INTO  s_area_code  VALUES ('954', '310105', '上海市', '上海市', '长宁区', '上海市长宁区');
INSERT INTO  s_area_code  VALUES ('955', '310106', '上海市', '上海市', '静安区', '上海市静安区');
INSERT INTO  s_area_code  VALUES ('956', '310107', '上海市', '上海市', '普陀区', '上海市普陀区');
INSERT INTO  s_area_code  VALUES ('957', '310108', '上海市', '上海市', '闸北区', '上海市闸北区');
INSERT INTO  s_area_code  VALUES ('958', '310109', '上海市', '上海市', '虹口区', '上海市虹口区');
INSERT INTO  s_area_code  VALUES ('959', '310110', '上海市', '上海市', '杨浦区', '上海市杨浦区');
INSERT INTO  s_area_code  VALUES ('960', '310112', '上海市', '上海市', '闵行区', '上海市闵行区');
INSERT INTO  s_area_code  VALUES ('961', '310113', '上海市', '上海市', '宝山区', '上海市宝山区');
INSERT INTO  s_area_code  VALUES ('962', '310114', '上海市', '上海市', '嘉定区', '上海市嘉定区');
INSERT INTO  s_area_code  VALUES ('963', '310115', '上海市', '上海市', '浦东新区', '上海市浦东新区');
INSERT INTO  s_area_code  VALUES ('964', '310116', '上海市', '上海市', '金山区', '上海市金山区');
INSERT INTO  s_area_code  VALUES ('965', '310117', '上海市', '上海市', '松江区', '上海市松江区');
INSERT INTO  s_area_code  VALUES ('966', '310118', '上海市', '上海市', '青浦区', '上海市青浦区');
INSERT INTO  s_area_code  VALUES ('967', '310119', '上海市', '上海市', '南汇区', '上海市南汇区');
INSERT INTO  s_area_code  VALUES ('968', '310120', '上海市', '上海市', '奉贤区', '上海市奉贤区');
INSERT INTO  s_area_code  VALUES ('969', '310200', '上海市', '上海市', '县', '上海市县');
INSERT INTO  s_area_code  VALUES ('970', '310230', '上海市', '上海市', '崇明县', '上海市崇明县');
INSERT INTO  s_area_code  VALUES ('971', '320000', '江苏省', '', '', '江苏省');
INSERT INTO  s_area_code  VALUES ('972', '320100', '江苏省', '南京市', '', '江苏省南京市');
INSERT INTO  s_area_code  VALUES ('973', '320101', '江苏省', '南京市', '市辖区', '江苏省南京市市辖区');
INSERT INTO  s_area_code  VALUES ('974', '320102', '江苏省', '南京市', '玄武区', '江苏省南京市玄武区');
INSERT INTO  s_area_code  VALUES ('975', '320103', '江苏省', '南京市', '白下区', '江苏省南京市白下区');
INSERT INTO  s_area_code  VALUES ('976', '320104', '江苏省', '南京市', '秦淮区', '江苏省南京市秦淮区');
INSERT INTO  s_area_code  VALUES ('977', '320105', '江苏省', '南京市', '建邺区', '江苏省南京市建邺区');
INSERT INTO  s_area_code  VALUES ('978', '320106', '江苏省', '南京市', '鼓楼区', '江苏省南京市鼓楼区');
INSERT INTO  s_area_code  VALUES ('979', '320107', '江苏省', '南京市', '下关区', '江苏省南京市下关区');
INSERT INTO  s_area_code  VALUES ('980', '320111', '江苏省', '南京市', '浦口区', '江苏省南京市浦口区');
INSERT INTO  s_area_code  VALUES ('981', '320113', '江苏省', '南京市', '栖霞区', '江苏省南京市栖霞区');
INSERT INTO  s_area_code  VALUES ('982', '320114', '江苏省', '南京市', '雨花台区', '江苏省南京市雨花台区');
INSERT INTO  s_area_code  VALUES ('983', '320115', '江苏省', '南京市', '江宁区', '江苏省南京市江宁区');
INSERT INTO  s_area_code  VALUES ('984', '320116', '江苏省', '南京市', '六合区', '江苏省南京市六合区');
INSERT INTO  s_area_code  VALUES ('985', '320124', '江苏省', '南京市', '溧水县', '江苏省溧水县');
INSERT INTO  s_area_code  VALUES ('986', '320125', '江苏省', '南京市', '高淳县', '江苏省高淳县');
INSERT INTO  s_area_code  VALUES ('987', '320200', '江苏省', '无锡市', '', '江苏省无锡市');
INSERT INTO  s_area_code  VALUES ('988', '320201', '江苏省', '无锡市', '市辖区', '江苏省无锡市市辖区');
INSERT INTO  s_area_code  VALUES ('989', '320202', '江苏省', '无锡市', '崇安区', '江苏省无锡市崇安区');
INSERT INTO  s_area_code  VALUES ('990', '320203', '江苏省', '无锡市', '南长区', '江苏省无锡市南长区');
INSERT INTO  s_area_code  VALUES ('991', '320204', '江苏省', '无锡市', '北塘区', '江苏省无锡市北塘区');
INSERT INTO  s_area_code  VALUES ('992', '320205', '江苏省', '无锡市', '锡山区', '江苏省无锡市锡山区');
INSERT INTO  s_area_code  VALUES ('993', '320206', '江苏省', '无锡市', '惠山区', '江苏省无锡市惠山区');
INSERT INTO  s_area_code  VALUES ('994', '320211', '江苏省', '无锡市', '滨湖区', '江苏省无锡市滨湖区');
INSERT INTO  s_area_code  VALUES ('995', '320281', '江苏省', '无锡市', '江阴市', '江苏省无锡市江阴市');
INSERT INTO  s_area_code  VALUES ('996', '320282', '江苏省', '无锡市', '宜兴市', '江苏省无锡市宜兴市');
INSERT INTO  s_area_code  VALUES ('997', '320300', '江苏省', '徐州市', '', '江苏省徐州市');
INSERT INTO  s_area_code  VALUES ('998', '320301', '江苏省', '徐州市', '市辖区', '江苏省徐州市市辖区');
INSERT INTO  s_area_code  VALUES ('999', '320302', '江苏省', '徐州市', '鼓楼区', '江苏省徐州市鼓楼区');
INSERT INTO  s_area_code  VALUES ('1000', '320303', '江苏省', '徐州市', '云龙区', '江苏省徐州市云龙区');
INSERT INTO  s_area_code  VALUES ('1001', '320304', '江苏省', '徐州市', '九里区', '江苏省徐州市九里区');
INSERT INTO  s_area_code  VALUES ('1002', '320305', '江苏省', '徐州市', '贾汪区', '江苏省徐州市贾汪区');
INSERT INTO  s_area_code  VALUES ('1003', '320311', '江苏省', '徐州市', '泉山区', '江苏省徐州市泉山区');
INSERT INTO  s_area_code  VALUES ('1004', '320321', '江苏省', '徐州市', '丰 县', '江苏省丰 县');
INSERT INTO  s_area_code  VALUES ('1005', '320322', '江苏省', '徐州市', '沛 县', '江苏省沛 县');
INSERT INTO  s_area_code  VALUES ('1006', '320323', '江苏省', '徐州市', '铜山县', '江苏省铜山县');
INSERT INTO  s_area_code  VALUES ('1007', '320324', '江苏省', '徐州市', '睢宁县', '江苏省睢宁县');
INSERT INTO  s_area_code  VALUES ('1008', '320381', '江苏省', '徐州市', '新沂市', '江苏省新沂市');
INSERT INTO  s_area_code  VALUES ('1009', '320382', '江苏省', '徐州市', '邳州市', '江苏省邳州市');
INSERT INTO  s_area_code  VALUES ('1010', '320400', '江苏省', '常州市', '', '江苏省常州市');
INSERT INTO  s_area_code  VALUES ('1011', '320401', '江苏省', '常州市', '市辖区', '江苏省常州市市辖区');
INSERT INTO  s_area_code  VALUES ('1012', '320402', '江苏省', '常州市', '天宁区', '江苏省常州市天宁区');
INSERT INTO  s_area_code  VALUES ('1013', '320404', '江苏省', '常州市', '钟楼区', '江苏省常州市钟楼区');
INSERT INTO  s_area_code  VALUES ('1014', '320405', '江苏省', '常州市', '戚墅堰区', '江苏省常州市戚墅堰区');
INSERT INTO  s_area_code  VALUES ('1015', '320411', '江苏省', '常州市', '新北区', '江苏省常州市新北区');
INSERT INTO  s_area_code  VALUES ('1016', '320412', '江苏省', '常州市', '武进区', '江苏省常州市武进区');
INSERT INTO  s_area_code  VALUES ('1017', '320481', '江苏省', '常州市', '溧阳市', '江苏省溧阳市');
INSERT INTO  s_area_code  VALUES ('1018', '320482', '江苏省', '常州市', '金坛市', '江苏省金坛市');
INSERT INTO  s_area_code  VALUES ('1019', '320500', '江苏省', '苏州市', '', '江苏省苏州市');
INSERT INTO  s_area_code  VALUES ('1020', '320501', '江苏省', '苏州市', '市辖区', '江苏省苏州市市辖区');
INSERT INTO  s_area_code  VALUES ('1021', '320502', '江苏省', '苏州市', '沧浪区', '江苏省苏州市沧浪区');
INSERT INTO  s_area_code  VALUES ('1022', '320503', '江苏省', '苏州市', '平江区', '江苏省苏州市平江区');
INSERT INTO  s_area_code  VALUES ('1023', '320504', '江苏省', '苏州市', '金阊区', '江苏省苏州市金阊区');
INSERT INTO  s_area_code  VALUES ('1024', '320505', '江苏省', '苏州市', '虎丘区', '江苏省苏州市虎丘区');
INSERT INTO  s_area_code  VALUES ('1025', '320506', '江苏省', '苏州市', '吴中区', '江苏省苏州市吴中区');
INSERT INTO  s_area_code  VALUES ('1026', '320507', '江苏省', '苏州市', '相城区', '江苏省苏州市相城区');
INSERT INTO  s_area_code  VALUES ('1027', '320511', '江苏省', '苏州市', ' 郊区', '江苏省苏州市 郊区 ');
INSERT INTO  s_area_code  VALUES ('1028', '320581', '江苏省', '苏州市', '常熟市', '江苏省常熟市');
INSERT INTO  s_area_code  VALUES ('1029', '320582', '江苏省', '苏州市', '张家港市', '江苏省张家港市');
INSERT INTO  s_area_code  VALUES ('1030', '320583', '江苏省', '苏州市', '昆山市', '江苏省昆山市');
INSERT INTO  s_area_code  VALUES ('1031', '320584', '江苏省', '苏州市', '吴江市', '江苏省吴江市');
INSERT INTO  s_area_code  VALUES ('1032', '320585', '江苏省', '苏州市', '太仓市', '江苏省太仓市');
INSERT INTO  s_area_code  VALUES ('1033', '320600', '江苏省', '南通市', '', '江苏省南通市');
INSERT INTO  s_area_code  VALUES ('1034', '320601', '江苏省', '南通市', '市辖区', '江苏省南通市市辖区');
INSERT INTO  s_area_code  VALUES ('1035', '320602', '江苏省', '南通市', '崇川区', '江苏省南通市崇川区');
INSERT INTO  s_area_code  VALUES ('1036', '320611', '江苏省', '南通市', '港闸区', '江苏省南通市港闸区');
INSERT INTO  s_area_code  VALUES ('1037', '320621', '江苏省', '南通市', '海安县', '江苏省海安县');
INSERT INTO  s_area_code  VALUES ('1038', '320623', '江苏省', '南通市', '如东县', '江苏省如东县');
INSERT INTO  s_area_code  VALUES ('1039', '320681', '江苏省', '南通市', '启东市', '江苏省启东市');
INSERT INTO  s_area_code  VALUES ('1040', '320682', '江苏省', '南通市', '如皋市', '江苏省如皋市');
INSERT INTO  s_area_code  VALUES ('1041', '320683', '江苏省', '南通市', '通州市', '江苏省通州市');
INSERT INTO  s_area_code  VALUES ('1042', '320684', '江苏省', '南通市', '海门市', '江苏省海门市');
INSERT INTO  s_area_code  VALUES ('1043', '320700', '江苏省', '连云港市', '', '江苏省连云港市');
INSERT INTO  s_area_code  VALUES ('1044', '320701', '江苏省', '连云港市', '市辖区', '江苏省连云港市市辖区');
INSERT INTO  s_area_code  VALUES ('1045', '320703', '江苏省', '连云港市', '连云区', '江苏省连云港市连云区');
INSERT INTO  s_area_code  VALUES ('1046', '320705', '江苏省', '连云港市', '新浦区', '江苏省连云港市新浦区');
INSERT INTO  s_area_code  VALUES ('1047', '320706', '江苏省', '连云港市', '海州区', '江苏省连云港市海州区');
INSERT INTO  s_area_code  VALUES ('1048', '320721', '江苏省', '连云港市', '赣榆县', '江苏省赣榆县');
INSERT INTO  s_area_code  VALUES ('1049', '320722', '江苏省', '连云港市', '东海县', '江苏省东海县');
INSERT INTO  s_area_code  VALUES ('1050', '320723', '江苏省', '连云港市', '灌云县', '江苏省灌云县');
INSERT INTO  s_area_code  VALUES ('1051', '320724', '江苏省', '连云港市', '灌南县', '江苏省灌南县');
INSERT INTO  s_area_code  VALUES ('1052', '320800', '江苏省', '淮安市', '', '江苏省淮安市');
INSERT INTO  s_area_code  VALUES ('1053', '320801', '江苏省', '淮安市', '市辖区', '江苏省淮安市市辖区');
INSERT INTO  s_area_code  VALUES ('1054', '320802', '江苏省', '淮安市', '清河区', '江苏省淮安市清河区');
INSERT INTO  s_area_code  VALUES ('1055', '320803', '江苏省', '淮安市', '楚州区', '江苏省淮安市楚州区');
INSERT INTO  s_area_code  VALUES ('1056', '320804', '江苏省', '淮安市', '淮阴区', '江苏省淮安市淮阴区');
INSERT INTO  s_area_code  VALUES ('1057', '320811', '江苏省', '淮安市', '清浦区', '江苏省淮安市清浦区');
INSERT INTO  s_area_code  VALUES ('1058', '320826', '江苏省', '淮安市', '涟水县', '江苏省涟水县');
INSERT INTO  s_area_code  VALUES ('1059', '320829', '江苏省', '淮安市', '洪泽县', '江苏省洪泽县');
INSERT INTO  s_area_code  VALUES ('1060', '320830', '江苏省', '淮安市', '盱眙县', '江苏省盱眙县');
INSERT INTO  s_area_code  VALUES ('1061', '320831', '江苏省', '淮安市', '金湖县', '江苏省金湖县');
INSERT INTO  s_area_code  VALUES ('1062', '320900', '江苏省', '盐城市', '', '江苏省盐城市');
INSERT INTO  s_area_code  VALUES ('1063', '320901', '江苏省', '盐城市', '市辖区', '江苏省盐城市市辖区');
INSERT INTO  s_area_code  VALUES ('1064', '320902', '江苏省', '盐城市', '亭湖区', '江苏省盐城市亭湖区');
INSERT INTO  s_area_code  VALUES ('1065', '320903', '江苏省', '盐城市', '盐都区', '江苏省盐城市盐都区');
INSERT INTO  s_area_code  VALUES ('1066', '320921', '江苏省', '盐城市', '响水县', '江苏省响水县');
INSERT INTO  s_area_code  VALUES ('1067', '320922', '江苏省', '盐城市', '滨海县', '江苏省滨海县');
INSERT INTO  s_area_code  VALUES ('1068', '320923', '江苏省', '盐城市', '阜宁县', '江苏省阜宁县');
INSERT INTO  s_area_code  VALUES ('1069', '320924', '江苏省', '盐城市', '射阳县', '江苏省射阳县');
INSERT INTO  s_area_code  VALUES ('1070', '320925', '江苏省', '盐城市', '建湖县', '江苏省建湖县');
INSERT INTO  s_area_code  VALUES ('1071', '320928', '江苏省', '盐城市', '盐都县', '江苏省盐都县');
INSERT INTO  s_area_code  VALUES ('1072', '320981', '江苏省', '盐城市', '东台市', '江苏省东台市');
INSERT INTO  s_area_code  VALUES ('1073', '320982', '江苏省', '盐城市', '大丰市', '江苏省大丰市');
INSERT INTO  s_area_code  VALUES ('1074', '321000', '江苏省', '扬州市', '', '江苏省扬州市');
INSERT INTO  s_area_code  VALUES ('1075', '321001', '江苏省', '扬州市', '市辖区', '江苏省扬州市市辖区');
INSERT INTO  s_area_code  VALUES ('1076', '321002', '江苏省', '扬州市', '广陵区', '江苏省扬州市广陵区');
INSERT INTO  s_area_code  VALUES ('1077', '321003', '江苏省', '扬州市', '邗江区', '江苏省扬州市邗江区');
INSERT INTO  s_area_code  VALUES ('1078', '321011', '江苏省', '扬州市', '维扬区', '江苏省扬州市维扬区');
INSERT INTO  s_area_code  VALUES ('1079', '321023', '江苏省', '扬州市', '宝应县', '江苏省宝应县');
INSERT INTO  s_area_code  VALUES ('1080', '321081', '江苏省', '扬州市', '仪征市', '江苏省仪征市');
INSERT INTO  s_area_code  VALUES ('1081', '321084', '江苏省', '扬州市', '高邮市', '江苏省高邮市');
INSERT INTO  s_area_code  VALUES ('1082', '321088', '江苏省', '扬州市', '江都市', '江苏省江都市');
INSERT INTO  s_area_code  VALUES ('1083', '321100', '江苏省', '镇江市', '', '江苏省镇江市');
INSERT INTO  s_area_code  VALUES ('1084', '321101', '江苏省', '镇江市', '市辖区', '江苏省镇江市市辖区');
INSERT INTO  s_area_code  VALUES ('1085', '321102', '江苏省', '镇江市', '京口区', '江苏省镇江市京口区');
INSERT INTO  s_area_code  VALUES ('1086', '321111', '江苏省', '镇江市', '润州区', '江苏省镇江市润州区');
INSERT INTO  s_area_code  VALUES ('1087', '321112', '江苏省', '镇江市', '丹徒区', '江苏省镇江市丹徒区');
INSERT INTO  s_area_code  VALUES ('1088', '321181', '江苏省', '镇江市', '丹阳市', '江苏省丹阳市');
INSERT INTO  s_area_code  VALUES ('1089', '321182', '江苏省', '镇江市', '扬中市', '江苏省扬中市');
INSERT INTO  s_area_code  VALUES ('1090', '321183', '江苏省', '镇江市', '句容市', '江苏省句容市');
INSERT INTO  s_area_code  VALUES ('1091', '321200', '江苏省', '泰州市', '', '江苏省泰州市');
INSERT INTO  s_area_code  VALUES ('1092', '321201', '江苏省', '泰州市', '市辖区', '江苏省泰州市市辖区');
INSERT INTO  s_area_code  VALUES ('1093', '321202', '江苏省', '泰州市', '海陵区', '江苏省泰州市海陵区');
INSERT INTO  s_area_code  VALUES ('1094', '321203', '江苏省', '泰州市', '高港区', '江苏省泰州市高港区');
INSERT INTO  s_area_code  VALUES ('1095', '321281', '江苏省', '泰州市', '兴化市', '江苏省兴化市');
INSERT INTO  s_area_code  VALUES ('1096', '321282', '江苏省', '泰州市', '靖江市', '江苏省靖江市');
INSERT INTO  s_area_code  VALUES ('1097', '321283', '江苏省', '泰州市', '泰兴市', '江苏省泰兴市');
INSERT INTO  s_area_code  VALUES ('1098', '321284', '江苏省', '泰州市', '姜堰市', '江苏省姜堰市');
INSERT INTO  s_area_code  VALUES ('1099', '321300', '江苏省', '宿迁市', '', '江苏省宿迁市');
INSERT INTO  s_area_code  VALUES ('1100', '321301', '江苏省', '宿迁市', '市辖区', '江苏省宿迁市市辖区');
INSERT INTO  s_area_code  VALUES ('1101', '321302', '江苏省', '宿迁市', '宿城区', '江苏省宿迁市宿城区');
INSERT INTO  s_area_code  VALUES ('1102', '321311', '江苏省', '宿迁市', '宿豫区', '江苏省宿迁市宿豫区');
INSERT INTO  s_area_code  VALUES ('1103', '321321', '江苏省', '宿迁市', '宿豫县', '江苏省宿迁市宿豫县');
INSERT INTO  s_area_code  VALUES ('1104', '321322', '江苏省', '宿迁市', '沭阳县', '江苏省沭阳县');
INSERT INTO  s_area_code  VALUES ('1105', '321323', '江苏省', '宿迁市', '泗阳县', '江苏省泗阳县');
INSERT INTO  s_area_code  VALUES ('1106', '321324', '江苏省', '宿迁市', '泗洪县', '江苏省泗洪县');
INSERT INTO  s_area_code  VALUES ('1107', '330000', '浙江省', '', '', '浙江省');
INSERT INTO  s_area_code  VALUES ('1108', '330100', '浙江省', '杭州市', '', '浙江省杭州市');
INSERT INTO  s_area_code  VALUES ('1109', '330101', '浙江省', '杭州市', '市辖区', '浙江省杭州市市辖区');
INSERT INTO  s_area_code  VALUES ('1110', '330102', '浙江省', '杭州市', '上城区', '浙江省杭州市上城区');
INSERT INTO  s_area_code  VALUES ('1111', '330103', '浙江省', '杭州市', '下城区', '浙江省杭州市下城区');
INSERT INTO  s_area_code  VALUES ('1112', '330104', '浙江省', '杭州市', '江干区', '浙江省杭州市江干区');
INSERT INTO  s_area_code  VALUES ('1113', '330105', '浙江省', '杭州市', '拱墅区', '浙江省杭州市拱墅区');
INSERT INTO  s_area_code  VALUES ('1114', '330106', '浙江省', '杭州市', '西湖区', '浙江省杭州市西湖区');
INSERT INTO  s_area_code  VALUES ('1115', '330108', '浙江省', '杭州市', '滨江区', '浙江省杭州市滨江区');
INSERT INTO  s_area_code  VALUES ('1116', '330109', '浙江省', '杭州市', '萧山区', '浙江省杭州市萧山区');
INSERT INTO  s_area_code  VALUES ('1117', '330110', '浙江省', '杭州市', '余杭区', '浙江省杭州市余杭区');
INSERT INTO  s_area_code  VALUES ('1118', '330122', '浙江省', '杭州市', '桐庐县', '浙江省桐庐县');
INSERT INTO  s_area_code  VALUES ('1119', '330127', '浙江省', '杭州市', '淳安县', '浙江省淳安县');
INSERT INTO  s_area_code  VALUES ('1120', '330182', '浙江省', '杭州市', '建德市', '浙江省建德市');
INSERT INTO  s_area_code  VALUES ('1121', '330183', '浙江省', '杭州市', '富阳市', '浙江省富阳市');
INSERT INTO  s_area_code  VALUES ('1122', '330185', '浙江省', '杭州市', '临安市', '浙江省临安市');
INSERT INTO  s_area_code  VALUES ('1123', '330200', '浙江省', '宁波市', '', '浙江省宁波市');
INSERT INTO  s_area_code  VALUES ('1124', '330201', '浙江省', '宁波市', '市辖区', '浙江省宁波市市辖区');
INSERT INTO  s_area_code  VALUES ('1125', '330203', '浙江省', '宁波市', '海曙区', '浙江省宁波市海曙区');
INSERT INTO  s_area_code  VALUES ('1126', '330204', '浙江省', '宁波市', '江东区', '浙江省宁波市江东区');
INSERT INTO  s_area_code  VALUES ('1127', '330205', '浙江省', '宁波市', '江北区', '浙江省宁波市江北区');
INSERT INTO  s_area_code  VALUES ('1128', '330206', '浙江省', '宁波市', '北仑区', '浙江省宁波市北仑区');
INSERT INTO  s_area_code  VALUES ('1129', '330211', '浙江省', '宁波市', '镇海区', '浙江省宁波市镇海区');
INSERT INTO  s_area_code  VALUES ('1130', '330212', '浙江省', '宁波市', '鄞州区', '浙江省宁波市鄞州区');
INSERT INTO  s_area_code  VALUES ('1131', '330225', '浙江省', '宁波市', '象山县', '浙江省象山县');
INSERT INTO  s_area_code  VALUES ('1132', '330226', '浙江省', '宁波市', '宁海县', '浙江省宁海县');
INSERT INTO  s_area_code  VALUES ('1133', '330281', '浙江省', '宁波市', '余姚市', '浙江省余姚市');
INSERT INTO  s_area_code  VALUES ('1134', '330282', '浙江省', '宁波市', '慈溪市', '浙江省慈溪市');
INSERT INTO  s_area_code  VALUES ('1135', '330283', '浙江省', '宁波市', '奉化市', '浙江省奉化市');
INSERT INTO  s_area_code  VALUES ('1136', '330300', '浙江省', '温州市', '', '浙江省温州市');
INSERT INTO  s_area_code  VALUES ('1137', '330301', '浙江省', '温州市', '市辖区', '浙江省温州市市辖区');
INSERT INTO  s_area_code  VALUES ('1138', '330302', '浙江省', '温州市', '鹿城区', '浙江省温州市鹿城区');
INSERT INTO  s_area_code  VALUES ('1139', '330303', '浙江省', '温州市', '龙湾区', '浙江省温州市龙湾区');
INSERT INTO  s_area_code  VALUES ('1140', '330304', '浙江省', '温州市', '瓯海区', '浙江省温州市瓯海区');
INSERT INTO  s_area_code  VALUES ('1141', '330322', '浙江省', '温州市', '洞头县', '浙江省洞头县');
INSERT INTO  s_area_code  VALUES ('1142', '330324', '浙江省', '温州市', '永嘉县', '浙江省永嘉县');
INSERT INTO  s_area_code  VALUES ('1143', '330326', '浙江省', '温州市', '平阳县', '浙江省平阳县');
INSERT INTO  s_area_code  VALUES ('1144', '330327', '浙江省', '温州市', '苍南县', '浙江省苍南县');
INSERT INTO  s_area_code  VALUES ('1145', '330328', '浙江省', '温州市', '文成县', '浙江省文成县');
INSERT INTO  s_area_code  VALUES ('1146', '330329', '浙江省', '温州市', '泰顺县', '浙江省泰顺县');
INSERT INTO  s_area_code  VALUES ('1147', '330381', '浙江省', '温州市', '瑞安市', '浙江省瑞安市');
INSERT INTO  s_area_code  VALUES ('1148', '330382', '浙江省', '温州市', '乐清市', '浙江省乐清市');
INSERT INTO  s_area_code  VALUES ('1149', '330400', '浙江省', '嘉兴市', '', '浙江省嘉兴市');
INSERT INTO  s_area_code  VALUES ('1150', '330401', '浙江省', '嘉兴市', '市辖区', '浙江省嘉兴市市辖区');
INSERT INTO  s_area_code  VALUES ('1151', '330402', '浙江省', '嘉兴市', '秀城区', '浙江省嘉兴市秀城区');
INSERT INTO  s_area_code  VALUES ('1152', '330411', '浙江省', '嘉兴市', '秀洲区', '浙江省嘉兴市秀洲区');
INSERT INTO  s_area_code  VALUES ('1153', '330421', '浙江省', '嘉兴市', '嘉善县', '浙江省嘉善县');
INSERT INTO  s_area_code  VALUES ('1154', '330424', '浙江省', '嘉兴市', '海盐县', '浙江省海盐县');
INSERT INTO  s_area_code  VALUES ('1155', '330481', '浙江省', '嘉兴市', '海宁市', '浙江省海宁市');
INSERT INTO  s_area_code  VALUES ('1156', '330482', '浙江省', '嘉兴市', '平湖市', '浙江省平湖市');
INSERT INTO  s_area_code  VALUES ('1157', '330483', '浙江省', '嘉兴市', '桐乡市', '浙江省桐乡市');
INSERT INTO  s_area_code  VALUES ('1158', '330500', '浙江省', '湖州市', '', '浙江省湖州市');
INSERT INTO  s_area_code  VALUES ('1159', '330501', '浙江省', '湖州市', '市辖区', '浙江省湖州市市辖区');
INSERT INTO  s_area_code  VALUES ('1160', '330502', '浙江省', '湖州市', '吴兴区', '浙江省湖州市吴兴区');
INSERT INTO  s_area_code  VALUES ('1161', '330503', '浙江省', '湖州市', '南浔区', '浙江省湖州市南浔区');
INSERT INTO  s_area_code  VALUES ('1162', '330521', '浙江省', '湖州市', '德清县', '浙江省德清县');
INSERT INTO  s_area_code  VALUES ('1163', '330522', '浙江省', '湖州市', '长兴县', '浙江省长兴县');
INSERT INTO  s_area_code  VALUES ('1164', '330523', '浙江省', '湖州市', '安吉县', '浙江省安吉县');
INSERT INTO  s_area_code  VALUES ('1165', '330600', '浙江省', '绍兴市', '', '浙江省绍兴市');
INSERT INTO  s_area_code  VALUES ('1166', '330601', '浙江省', '绍兴市', '市辖区', '浙江省绍兴市市辖区');
INSERT INTO  s_area_code  VALUES ('1167', '330602', '浙江省', '绍兴市', '越城区', '浙江省绍兴市越城区');
INSERT INTO  s_area_code  VALUES ('1168', '330621', '浙江省', '绍兴市', '绍兴县', '浙江省绍兴县');
INSERT INTO  s_area_code  VALUES ('1169', '330624', '浙江省', '绍兴市', '新昌县', '浙江省新昌县');
INSERT INTO  s_area_code  VALUES ('1170', '330681', '浙江省', '绍兴市', '诸暨市', '浙江省诸暨市');
INSERT INTO  s_area_code  VALUES ('1171', '330682', '浙江省', '绍兴市', '上虞市', '浙江省上虞市');
INSERT INTO  s_area_code  VALUES ('1172', '330683', '浙江省', '绍兴市', '嵊州市', '浙江省嵊州市');
INSERT INTO  s_area_code  VALUES ('1173', '330700', '浙江省', '金华市', '', '浙江省金华市');
INSERT INTO  s_area_code  VALUES ('1174', '330701', '浙江省', '金华市', '市辖区', '浙江省金华市市辖区');
INSERT INTO  s_area_code  VALUES ('1175', '330702', '浙江省', '金华市', '婺城区', '浙江省金华市婺城区');
INSERT INTO  s_area_code  VALUES ('1176', '330703', '浙江省', '金华市', '金东区', '浙江省金华市金东区');
INSERT INTO  s_area_code  VALUES ('1177', '330723', '浙江省', '金华市', '武义县', '浙江省武义县');
INSERT INTO  s_area_code  VALUES ('1178', '330726', '浙江省', '金华市', '浦江县', '浙江省浦江县');
INSERT INTO  s_area_code  VALUES ('1179', '330727', '浙江省', '金华市', '磐安县', '浙江省磐安县');
INSERT INTO  s_area_code  VALUES ('1180', '330781', '浙江省', '金华市', '兰溪市', '浙江省兰溪市');
INSERT INTO  s_area_code  VALUES ('1181', '330782', '浙江省', '金华市', '义乌市', '浙江省义乌市');
INSERT INTO  s_area_code  VALUES ('1182', '330783', '浙江省', '金华市', '东阳市', '浙江省东阳市');
INSERT INTO  s_area_code  VALUES ('1183', '330784', '浙江省', '金华市', '永康市', '浙江省永康市');
INSERT INTO  s_area_code  VALUES ('1184', '330800', '浙江省', '衢州市', '', '浙江省衢州市');
INSERT INTO  s_area_code  VALUES ('1185', '330801', '浙江省', '衢州市', '市辖区', '浙江省衢州市市辖区');
INSERT INTO  s_area_code  VALUES ('1186', '330802', '浙江省', '衢州市', '柯城区', '浙江省衢州市柯城区');
INSERT INTO  s_area_code  VALUES ('1187', '330803', '浙江省', '衢州市', '衢江区', '浙江省衢州市衢江区');
INSERT INTO  s_area_code  VALUES ('1188', '330822', '浙江省', '衢州市', '常山县', '浙江省常山县');
INSERT INTO  s_area_code  VALUES ('1189', '330824', '浙江省', '衢州市', '开化县', '浙江省开化县');
INSERT INTO  s_area_code  VALUES ('1190', '330825', '浙江省', '衢州市', '龙游县', '浙江省龙游县');
INSERT INTO  s_area_code  VALUES ('1191', '330881', '浙江省', '衢州市', '江山市', '浙江省江山市');
INSERT INTO  s_area_code  VALUES ('1192', '330900', '浙江省', '舟山市', '', '浙江省舟山市');
INSERT INTO  s_area_code  VALUES ('1193', '330901', '浙江省', '舟山市', '市辖区', '浙江省舟山市市辖区');
INSERT INTO  s_area_code  VALUES ('1194', '330902', '浙江省', '舟山市', '定海区', '浙江省舟山市定海区');
INSERT INTO  s_area_code  VALUES ('1195', '330903', '浙江省', '舟山市', '普陀区', '浙江省舟山市普陀区');
INSERT INTO  s_area_code  VALUES ('1196', '330921', '浙江省', '舟山市', '岱山县', '浙江省岱山县');
INSERT INTO  s_area_code  VALUES ('1197', '330922', '浙江省', '舟山市', '嵊泗县', '浙江省嵊泗县');
INSERT INTO  s_area_code  VALUES ('1198', '331000', '浙江省', '台州市', '', '浙江省台州市');
INSERT INTO  s_area_code  VALUES ('1199', '331001', '浙江省', '台州市', '市辖区', '浙江省台州市市辖区');
INSERT INTO  s_area_code  VALUES ('1200', '331002', '浙江省', '台州市', '椒江区', '浙江省台州市椒江区');
INSERT INTO  s_area_code  VALUES ('1201', '331003', '浙江省', '台州市', '黄岩区', '浙江省台州市黄岩区');
INSERT INTO  s_area_code  VALUES ('1202', '331004', '浙江省', '台州市', '路桥区', '浙江省台州市路桥区');
INSERT INTO  s_area_code  VALUES ('1203', '331021', '浙江省', '台州市', '玉环县', '浙江省玉环县');
INSERT INTO  s_area_code  VALUES ('1204', '331022', '浙江省', '台州市', '三门县', '浙江省三门县');
INSERT INTO  s_area_code  VALUES ('1205', '331023', '浙江省', '台州市', '天台县', '浙江省天台县');
INSERT INTO  s_area_code  VALUES ('1206', '331024', '浙江省', '台州市', '仙居县', '浙江省仙居县');
INSERT INTO  s_area_code  VALUES ('1207', '331081', '浙江省', '台州市', '温岭市', '浙江省温岭市');
INSERT INTO  s_area_code  VALUES ('1208', '331082', '浙江省', '台州市', '临海市', '浙江省临海市');
INSERT INTO  s_area_code  VALUES ('1209', '331100', '浙江省', '丽水市', '', '浙江省丽水市');
INSERT INTO  s_area_code  VALUES ('1210', '331101', '浙江省', '丽水市', '市辖区', '浙江省丽水市市辖区');
INSERT INTO  s_area_code  VALUES ('1211', '331102', '浙江省', '丽水市', '莲都区', '浙江省丽水市莲都区');
INSERT INTO  s_area_code  VALUES ('1212', '331121', '浙江省', '丽水市', '青田县', '浙江省青田县');
INSERT INTO  s_area_code  VALUES ('1213', '331122', '浙江省', '丽水市', '缙云县', '浙江省缙云县');
INSERT INTO  s_area_code  VALUES ('1214', '331123', '浙江省', '丽水市', '遂昌县', '浙江省遂昌县');
INSERT INTO  s_area_code  VALUES ('1215', '331124', '浙江省', '丽水市', '松阳县', '浙江省松阳县');
INSERT INTO  s_area_code  VALUES ('1216', '331125', '浙江省', '丽水市', '云和县', '浙江省云和县');
INSERT INTO  s_area_code  VALUES ('1217', '331126', '浙江省', '丽水市', '庆元县', '浙江省庆元县');
INSERT INTO  s_area_code  VALUES ('1218', '331127', '浙江省', '丽水市', '景宁畲族自治县', '浙江省景宁畲族自治县');
INSERT INTO  s_area_code  VALUES ('1219', '331181', '浙江省', '丽水市', '龙泉市', '浙江省龙泉市');
INSERT INTO  s_area_code  VALUES ('1220', '332500', '浙江省', '丽水市', '丽水地区 ', '浙江省丽水地区 ');
INSERT INTO  s_area_code  VALUES ('1221', '332501', '浙江省', '丽水市', ' 丽水市', '浙江省 丽水市 ');
INSERT INTO  s_area_code  VALUES ('1222', '332502', '浙江省', '丽水市', ' 龙泉市', '浙江省 龙泉市 ');
INSERT INTO  s_area_code  VALUES ('1223', '332522', '浙江省', '丽水市', ' 青田县', '浙江省 青田县 ');
INSERT INTO  s_area_code  VALUES ('1224', '332523', '浙江省', '丽水市', ' 云和县', '浙江省 云和县 ');
INSERT INTO  s_area_code  VALUES ('1225', '332525', '浙江省', '丽水市', ' 庆元县', '浙江省 庆元县 ');
INSERT INTO  s_area_code  VALUES ('1226', '332526', '浙江省', '丽水市', '缙云县', '浙江省 缙云县 ');
INSERT INTO  s_area_code  VALUES ('1227', '332527', '浙江省', '丽水市', '遂昌县 ', '浙江省 遂昌县 ');
INSERT INTO  s_area_code  VALUES ('1228', '332528', '浙江省', '丽水市', '松阳县', '浙江省 松阳县 ');
INSERT INTO  s_area_code  VALUES ('1229', '332529', '浙江省', '丽水市', ' 景宁畲族自治县', '浙江省 景宁畲族自治县');
INSERT INTO  s_area_code  VALUES ('1230', '340000', '安徽省', '', '', '安徽省');
INSERT INTO  s_area_code  VALUES ('1231', '340100', '安徽省', '合肥市', '', '安徽省合肥市');
INSERT INTO  s_area_code  VALUES ('1232', '340101', '安徽省', '合肥市', '市辖区', '安徽省合肥市市辖区');
INSERT INTO  s_area_code  VALUES ('1233', '340102', '安徽省', '合肥市', '瑶海区', '安徽省合肥市瑶海区');
INSERT INTO  s_area_code  VALUES ('1234', '340103', '安徽省', '合肥市', '庐阳区', '安徽省合肥市庐阳区');
INSERT INTO  s_area_code  VALUES ('1235', '340104', '安徽省', '合肥市', '蜀山区', '安徽省合肥市蜀山区');
INSERT INTO  s_area_code  VALUES ('1236', '340111', '安徽省', '合肥市', '包河区', '安徽省合肥市包河区');
INSERT INTO  s_area_code  VALUES ('1237', '340121', '安徽省', '合肥市', '长丰县', '安徽省长丰县');
INSERT INTO  s_area_code  VALUES ('1238', '340122', '安徽省', '合肥市', '肥东县', '安徽省肥东县');
INSERT INTO  s_area_code  VALUES ('1239', '340123', '安徽省', '合肥市', '肥西县', '安徽省肥西县');
INSERT INTO  s_area_code  VALUES ('1240', '340200', '安徽省', '芜湖市', '', '安徽省芜湖市');
INSERT INTO  s_area_code  VALUES ('1241', '340201', '安徽省', '芜湖市', '市辖区', '安徽省芜湖市市辖区');
INSERT INTO  s_area_code  VALUES ('1242', '340202', '安徽省', '芜湖市', '镜湖区', '安徽省芜湖市镜湖区');
INSERT INTO  s_area_code  VALUES ('1243', '340203', '安徽省', '芜湖市', '马塘区', '安徽省芜湖市马塘区');
INSERT INTO  s_area_code  VALUES ('1244', '340204', '安徽省', '芜湖市', '新芜区', '安徽省芜湖市新芜区');
INSERT INTO  s_area_code  VALUES ('1245', '340207', '安徽省', '芜湖市', '鸠江区', '安徽省芜湖市鸠江区');
INSERT INTO  s_area_code  VALUES ('1246', '340221', '安徽省', '芜湖市', '芜湖县', '安徽省芜湖县');
INSERT INTO  s_area_code  VALUES ('1247', '340222', '安徽省', '芜湖市', '繁昌县', '安徽省繁昌县');
INSERT INTO  s_area_code  VALUES ('1248', '340223', '安徽省', '芜湖市', '南陵县', '安徽省南陵县');
INSERT INTO  s_area_code  VALUES ('1249', '340300', '安徽省', '蚌埠市', '', '安徽省蚌埠市');
INSERT INTO  s_area_code  VALUES ('1250', '340301', '安徽省', '蚌埠市', '市辖区', '安徽省蚌埠市市辖区');
INSERT INTO  s_area_code  VALUES ('1251', '340302', '安徽省', '蚌埠市', '龙子湖区', '安徽省蚌埠市龙子湖区');
INSERT INTO  s_area_code  VALUES ('1252', '340303', '安徽省', '蚌埠市', '蚌山区', '安徽省蚌埠市蚌山区');
INSERT INTO  s_area_code  VALUES ('1253', '340304', '安徽省', '蚌埠市', '禹会区', '安徽省蚌埠市禹会区');
INSERT INTO  s_area_code  VALUES ('1254', '340311', '安徽省', '蚌埠市', '淮上区', '安徽省蚌埠市淮上区');
INSERT INTO  s_area_code  VALUES ('1255', '340321', '安徽省', '蚌埠市', '怀远县', '安徽省怀远县');
INSERT INTO  s_area_code  VALUES ('1256', '340322', '安徽省', '蚌埠市', '五河县', '安徽省五河县');
INSERT INTO  s_area_code  VALUES ('1257', '340323', '安徽省', '蚌埠市', '固镇县', '安徽省固镇县');
INSERT INTO  s_area_code  VALUES ('1258', '340400', '安徽省', '淮南市', '', '安徽省淮南市');
INSERT INTO  s_area_code  VALUES ('1259', '340401', '安徽省', '淮南市', '市辖区', '安徽省淮南市市辖区');
INSERT INTO  s_area_code  VALUES ('1260', '340402', '安徽省', '淮南市', '大通区', '安徽省淮南市大通区');
INSERT INTO  s_area_code  VALUES ('1261', '340403', '安徽省', '淮南市', '田家庵区', '安徽省淮南市田家庵区');
INSERT INTO  s_area_code  VALUES ('1262', '340404', '安徽省', '淮南市', '谢家集区', '安徽省淮南市谢家集区');
INSERT INTO  s_area_code  VALUES ('1263', '340405', '安徽省', '淮南市', '八公山区', '安徽省淮南市八公山区');
INSERT INTO  s_area_code  VALUES ('1264', '340406', '安徽省', '淮南市', '潘集区', '安徽省淮南市潘集区');
INSERT INTO  s_area_code  VALUES ('1265', '340421', '安徽省', '淮南市', '凤台县', '安徽省凤台县');
INSERT INTO  s_area_code  VALUES ('1266', '340500', '安徽省', '马鞍山市', '', '安徽省马鞍山市');
INSERT INTO  s_area_code  VALUES ('1267', '340501', '安徽省', '马鞍山市', '市辖区', '安徽省马鞍山市市辖区');
INSERT INTO  s_area_code  VALUES ('1268', '340502', '安徽省', '马鞍山市', '金家庄区', '安徽省马鞍山市金家庄区');
INSERT INTO  s_area_code  VALUES ('1269', '340503', '安徽省', '马鞍山市', '花山区', '安徽省马鞍山市花山区');
INSERT INTO  s_area_code  VALUES ('1270', '340504', '安徽省', '马鞍山市', '雨山区', '安徽省马鞍山市雨山区');
INSERT INTO  s_area_code  VALUES ('1271', '340521', '安徽省', '马鞍山市', '当涂县', '安徽省当涂县');
INSERT INTO  s_area_code  VALUES ('1272', '340600', '安徽省', '淮北市', '', '安徽省淮北市');
INSERT INTO  s_area_code  VALUES ('1273', '340601', '安徽省', '淮北市', '市辖区', '安徽省淮北市市辖区');
INSERT INTO  s_area_code  VALUES ('1274', '340602', '安徽省', '淮北市', '杜集区', '安徽省淮北市杜集区');
INSERT INTO  s_area_code  VALUES ('1275', '340603', '安徽省', '淮北市', '相山区', '安徽省淮北市相山区');
INSERT INTO  s_area_code  VALUES ('1276', '340604', '安徽省', '淮北市', '烈山区', '安徽省淮北市烈山区');
INSERT INTO  s_area_code  VALUES ('1277', '340621', '安徽省', '淮北市', '濉溪县', '安徽省濉溪县');
INSERT INTO  s_area_code  VALUES ('1278', '340700', '安徽省', '铜陵市', '', '安徽省铜陵市');
INSERT INTO  s_area_code  VALUES ('1279', '340701', '安徽省', '铜陵市', '市辖区', '安徽省铜陵市市辖区');
INSERT INTO  s_area_code  VALUES ('1280', '340702', '安徽省', '铜陵市', '铜官山区', '安徽省铜陵市铜官山区');
INSERT INTO  s_area_code  VALUES ('1281', '340703', '安徽省', '铜陵市', '狮子山区', '安徽省铜陵市狮子山区');
INSERT INTO  s_area_code  VALUES ('1282', '340711', '安徽省', '铜陵市', '郊 区', '安徽省铜陵市郊 区');
INSERT INTO  s_area_code  VALUES ('1283', '340721', '安徽省', '铜陵市', '铜陵县', '安徽省铜陵县');
INSERT INTO  s_area_code  VALUES ('1284', '340800', '安徽省', '安庆市', '', '安徽省安庆市');
INSERT INTO  s_area_code  VALUES ('1285', '340801', '安徽省', '安庆市', '市辖区', '安徽省安庆市市辖区');
INSERT INTO  s_area_code  VALUES ('1286', '340802', '安徽省', '安庆市', '迎江区', '安徽省安庆市迎江区');
INSERT INTO  s_area_code  VALUES ('1287', '340803', '安徽省', '安庆市', '大观区', '安徽省安庆市大观区');
INSERT INTO  s_area_code  VALUES ('1288', '340811', '安徽省', '安庆市', '宜秀区', '安徽省安庆市宜秀区');
INSERT INTO  s_area_code  VALUES ('1289', '340822', '安徽省', '安庆市', '怀宁县', '安徽省怀宁县');
INSERT INTO  s_area_code  VALUES ('1290', '340823', '安徽省', '安庆市', '枞阳县', '安徽省枞阳县');
INSERT INTO  s_area_code  VALUES ('1291', '340824', '安徽省', '安庆市', '潜山县', '安徽省潜山县');
INSERT INTO  s_area_code  VALUES ('1292', '340825', '安徽省', '安庆市', '太湖县', '安徽省太湖县');
INSERT INTO  s_area_code  VALUES ('1293', '340826', '安徽省', '安庆市', '宿松县', '安徽省宿松县');
INSERT INTO  s_area_code  VALUES ('1294', '340827', '安徽省', '安庆市', '望江县', '安徽省望江县');
INSERT INTO  s_area_code  VALUES ('1295', '340828', '安徽省', '安庆市', '岳西县', '安徽省岳西县');
INSERT INTO  s_area_code  VALUES ('1296', '340881', '安徽省', '安庆市', '桐城市', '安徽省桐城市');
INSERT INTO  s_area_code  VALUES ('1297', '341000', '安徽省', '黄山市', '', '安徽省黄山市');
INSERT INTO  s_area_code  VALUES ('1298', '341001', '安徽省', '黄山市', '市辖区', '安徽省黄山市市辖区');
INSERT INTO  s_area_code  VALUES ('1299', '341002', '安徽省', '黄山市', '屯溪区', '安徽省黄山市屯溪区');
INSERT INTO  s_area_code  VALUES ('1300', '341003', '安徽省', '黄山市', '黄山区', '安徽省黄山市黄山区');
INSERT INTO  s_area_code  VALUES ('1301', '341004', '安徽省', '黄山市', '徽州区', '安徽省黄山市徽州区');
INSERT INTO  s_area_code  VALUES ('1302', '341021', '安徽省', '黄山市', '歙 县', '安徽省歙 县');
INSERT INTO  s_area_code  VALUES ('1303', '341022', '安徽省', '黄山市', '休宁县', '安徽省休宁县');
INSERT INTO  s_area_code  VALUES ('1304', '341023', '安徽省', '黄山市', '黟 县', '安徽省黟 县');
INSERT INTO  s_area_code  VALUES ('1305', '341024', '安徽省', '黄山市', '祁门县', '安徽省祁门县');
INSERT INTO  s_area_code  VALUES ('1306', '341100', '安徽省', '滁州市', '', '安徽省滁州市');
INSERT INTO  s_area_code  VALUES ('1307', '341101', '安徽省', '滁州市', '市辖区', '安徽省滁州市市辖区');
INSERT INTO  s_area_code  VALUES ('1308', '341102', '安徽省', '滁州市', '琅琊区', '安徽省滁州市琅琊区');
INSERT INTO  s_area_code  VALUES ('1309', '341103', '安徽省', '滁州市', '南谯区', '安徽省滁州市南谯区');
INSERT INTO  s_area_code  VALUES ('1310', '341122', '安徽省', '滁州市', '来安县', '安徽省来安县');
INSERT INTO  s_area_code  VALUES ('1311', '341124', '安徽省', '滁州市', '全椒县', '安徽省全椒县');
INSERT INTO  s_area_code  VALUES ('1312', '341125', '安徽省', '滁州市', '定远县', '安徽省定远县');
INSERT INTO  s_area_code  VALUES ('1313', '341126', '安徽省', '滁州市', '凤阳县', '安徽省凤阳县');
INSERT INTO  s_area_code  VALUES ('1314', '341181', '安徽省', '滁州市', '天长市', '安徽省天长市');
INSERT INTO  s_area_code  VALUES ('1315', '341182', '安徽省', '滁州市', '明光市', '安徽省明光市');
INSERT INTO  s_area_code  VALUES ('1316', '341200', '安徽省', '阜阳市', '', '安徽省阜阳市');
INSERT INTO  s_area_code  VALUES ('1317', '341201', '安徽省', '阜阳市', '市辖区', '安徽省阜阳市市辖区');
INSERT INTO  s_area_code  VALUES ('1318', '341202', '安徽省', '阜阳市', '颍州区', '安徽省阜阳市颍州区');
INSERT INTO  s_area_code  VALUES ('1319', '341203', '安徽省', '阜阳市', '颍东区', '安徽省阜阳市颍东区');
INSERT INTO  s_area_code  VALUES ('1320', '341204', '安徽省', '阜阳市', '颍泉区', '安徽省阜阳市颍泉区');
INSERT INTO  s_area_code  VALUES ('1321', '341221', '安徽省', '阜阳市', '临泉县', '安徽省临泉县');
INSERT INTO  s_area_code  VALUES ('1322', '341222', '安徽省', '阜阳市', '太和县', '安徽省太和县');
INSERT INTO  s_area_code  VALUES ('1323', '341223', '安徽省', '阜阳市', '涡阳县', '安徽省 涡阳县 ');
INSERT INTO  s_area_code  VALUES ('1324', '341224', '安徽省', '阜阳市', ' 蒙城县 ', '安徽省 蒙城县 ');
INSERT INTO  s_area_code  VALUES ('1325', '341225', '安徽省', '阜阳市', '阜南县', '安徽省阜南县');
INSERT INTO  s_area_code  VALUES ('1326', '341226', '安徽省', '阜阳市', '颍上县', '安徽省颍上县');
INSERT INTO  s_area_code  VALUES ('1327', '341227', '安徽省', '阜阳市', ' 利辛县 ', '安徽省 利辛县 ');
INSERT INTO  s_area_code  VALUES ('1328', '341281', '安徽省', '阜阳市', ' 亳州市', '安徽省 亳州市 ');
INSERT INTO  s_area_code  VALUES ('1329', '341282', '安徽省', '阜阳市', '界首市', '安徽省界首市');
INSERT INTO  s_area_code  VALUES ('1330', '341300', '安徽省', '宿州市', '', '安徽省宿州市');
INSERT INTO  s_area_code  VALUES ('1331', '341301', '安徽省', '宿州市', '市辖区', '安徽省宿州市市辖区');
INSERT INTO  s_area_code  VALUES ('1332', '341302', '安徽省', '宿州市', '埇桥区', '安徽省宿州市埇桥区');
INSERT INTO  s_area_code  VALUES ('1333', '341321', '安徽省', '宿州市', '砀山县', '安徽省砀山县');
INSERT INTO  s_area_code  VALUES ('1334', '341322', '安徽省', '宿州市', '萧 县', '安徽省萧 县');
INSERT INTO  s_area_code  VALUES ('1335', '341323', '安徽省', '宿州市', '灵璧县', '安徽省灵璧县');
INSERT INTO  s_area_code  VALUES ('1336', '341324', '安徽省', '宿州市', '泗 县', '安徽省泗 县');
INSERT INTO  s_area_code  VALUES ('1337', '341400', '安徽省', '巢湖市', '', '安徽省巢湖市');
INSERT INTO  s_area_code  VALUES ('1338', '341401', '安徽省', '巢湖市', '市辖区', '安徽省巢湖市市辖区');
INSERT INTO  s_area_code  VALUES ('1339', '341402', '安徽省', '巢湖市', '居巢区', '安徽省巢湖市居巢区');
INSERT INTO  s_area_code  VALUES ('1340', '341421', '安徽省', '巢湖市', '庐江县', '安徽省庐江县');
INSERT INTO  s_area_code  VALUES ('1341', '341422', '安徽省', '巢湖市', '无为县', '安徽省无为县');
INSERT INTO  s_area_code  VALUES ('1342', '341423', '安徽省', '巢湖市', '含山县', '安徽省含山县');
INSERT INTO  s_area_code  VALUES ('1343', '341424', '安徽省', '巢湖市', '和 县', '安徽省和 县');
INSERT INTO  s_area_code  VALUES ('1344', '341500', '安徽省', '六安市', '', '安徽省六安市');
INSERT INTO  s_area_code  VALUES ('1345', '341501', '安徽省', '六安市', '市辖区', '安徽省六安市市辖区');
INSERT INTO  s_area_code  VALUES ('1346', '341502', '安徽省', '六安市', '金安区', '安徽省六安市金安区');
INSERT INTO  s_area_code  VALUES ('1347', '341503', '安徽省', '六安市', '裕安区', '安徽省六安市裕安区');
INSERT INTO  s_area_code  VALUES ('1348', '341521', '安徽省', '六安市', '寿 县', '安徽省寿 县');
INSERT INTO  s_area_code  VALUES ('1349', '341522', '安徽省', '六安市', '霍邱县', '安徽省霍邱县');
INSERT INTO  s_area_code  VALUES ('1350', '341523', '安徽省', '六安市', '舒城县', '安徽省舒城县');
INSERT INTO  s_area_code  VALUES ('1351', '341524', '安徽省', '六安市', '金寨县', '安徽省金寨县');
INSERT INTO  s_area_code  VALUES ('1352', '341525', '安徽省', '六安市', '霍山县', '安徽省霍山县');
INSERT INTO  s_area_code  VALUES ('1353', '341600', '安徽省', '亳州市', '', '安徽省亳州市');
INSERT INTO  s_area_code  VALUES ('1354', '341601', '安徽省', '亳州市', '市辖区', '安徽省亳州市市辖区');
INSERT INTO  s_area_code  VALUES ('1355', '341602', '安徽省', '亳州市', '谯城区', '安徽省亳州市谯城区');
INSERT INTO  s_area_code  VALUES ('1356', '341621', '安徽省', '亳州市', '涡阳县', '安徽省涡阳县');
INSERT INTO  s_area_code  VALUES ('1357', '341622', '安徽省', '亳州市', '蒙城县', '安徽省蒙城县');
INSERT INTO  s_area_code  VALUES ('1358', '341623', '安徽省', '亳州市', '利辛县', '安徽省利辛县');
INSERT INTO  s_area_code  VALUES ('1359', '341700', '安徽省', '池州市', '', '安徽省池州市');
INSERT INTO  s_area_code  VALUES ('1360', '341701', '安徽省', '池州市', '市辖区', '安徽省池州市市辖区');
INSERT INTO  s_area_code  VALUES ('1361', '341702', '安徽省', '池州市', '贵池区', '安徽省池州市贵池区');
INSERT INTO  s_area_code  VALUES ('1362', '341721', '安徽省', '池州市', '东至县', '安徽省东至县');
INSERT INTO  s_area_code  VALUES ('1363', '341722', '安徽省', '池州市', '石台县', '安徽省石台县');
INSERT INTO  s_area_code  VALUES ('1364', '341723', '安徽省', '池州市', '青阳县', '安徽省青阳县');
INSERT INTO  s_area_code  VALUES ('1365', '341800', '安徽省', '宣城市', '', '安徽省宣城市');
INSERT INTO  s_area_code  VALUES ('1366', '341801', '安徽省', '宣城市', '市辖区', '安徽省宣城市市辖区');
INSERT INTO  s_area_code  VALUES ('1367', '341802', '安徽省', '宣城市', '宣州区', '安徽省宣城市宣州区');
INSERT INTO  s_area_code  VALUES ('1368', '341821', '安徽省', '宣城市', '郎溪县', '安徽省郎溪县');
INSERT INTO  s_area_code  VALUES ('1369', '341822', '安徽省', '宣城市', '广德县', '安徽省广德县');
INSERT INTO  s_area_code  VALUES ('1370', '341823', '安徽省', '宣城市', '泾 县', '安徽省泾 县');
INSERT INTO  s_area_code  VALUES ('1371', '341824', '安徽省', '宣城市', '绩溪县', '安徽省绩溪县');
INSERT INTO  s_area_code  VALUES ('1372', '341825', '安徽省', '宣城市', '旌德县', '安徽省旌德县');
INSERT INTO  s_area_code  VALUES ('1373', '341881', '安徽省', '宣城市', '宁国市', '安徽省宁国市');
INSERT INTO  s_area_code  VALUES ('1374', '342500', '安徽省', '宣城市', '宣城地区', '安徽省宣城地区 ');
INSERT INTO  s_area_code  VALUES ('1375', '342501', '安徽省', '宣城市', '宣州市', '安徽省 宣州市 ');
INSERT INTO  s_area_code  VALUES ('1376', '342502', '安徽省', '宣城市', '宁国市', '安徽省 宁国市 ');
INSERT INTO  s_area_code  VALUES ('1377', '342522', '安徽省', '宣城市', '郎溪县 ', '安徽省 郎溪县 ');
INSERT INTO  s_area_code  VALUES ('1378', '342523', '安徽省', '宣城市', '广德县', '安徽省 广德县 ');
INSERT INTO  s_area_code  VALUES ('1379', '342529', '安徽省', '宣城市', '泾县', '安徽省 泾县 ');
INSERT INTO  s_area_code  VALUES ('1380', '342530', '安徽省', '宣城市', ' 旌德县', '安徽省 旌德县 ');
INSERT INTO  s_area_code  VALUES ('1381', '342531', '安徽省', '宣城市', ' 绩溪县 ', '安徽省 绩溪县 ');
INSERT INTO  s_area_code  VALUES ('1382', '342900', '安徽省', '池州市', '池州地区', '安徽省池州地区 ');
INSERT INTO  s_area_code  VALUES ('1383', '342901', '安徽省', '池州市', ' 贵池市', '安徽省 贵池市 ');
INSERT INTO  s_area_code  VALUES ('1384', '342921', '安徽省', '池州市', '东至县', '安徽省 东至县 ');
INSERT INTO  s_area_code  VALUES ('1385', '342922', '安徽省', '池州市', '石台县', '安徽省 石台县 ');
INSERT INTO  s_area_code  VALUES ('1386', '342923', '安徽省', '池州市', ' 青阳县', '安徽省 青阳县 ');
INSERT INTO  s_area_code  VALUES ('1387', '350000', '福建省', '', '', '福建省');
INSERT INTO  s_area_code  VALUES ('1388', '350100', '福建省', '福州市', '', '福建省福州市');
INSERT INTO  s_area_code  VALUES ('1389', '350101', '福建省', '福州市', '市辖区', '福建省福州市市辖区');
INSERT INTO  s_area_code  VALUES ('1390', '350102', '福建省', '福州市', '鼓楼区', '福建省福州市鼓楼区');
INSERT INTO  s_area_code  VALUES ('1391', '350103', '福建省', '福州市', '台江区', '福建省福州市台江区');
INSERT INTO  s_area_code  VALUES ('1392', '350104', '福建省', '福州市', '仓山区', '福建省福州市仓山区');
INSERT INTO  s_area_code  VALUES ('1393', '350105', '福建省', '福州市', '马尾区', '福建省福州市马尾区');
INSERT INTO  s_area_code  VALUES ('1394', '350111', '福建省', '福州市', '晋安区', '福建省福州市晋安区');
INSERT INTO  s_area_code  VALUES ('1395', '350121', '福建省', '福州市', '闽侯县', '福建省闽侯县');
INSERT INTO  s_area_code  VALUES ('1396', '350122', '福建省', '福州市', '连江县', '福建省连江县');
INSERT INTO  s_area_code  VALUES ('1397', '350123', '福建省', '福州市', '罗源县', '福建省罗源县');
INSERT INTO  s_area_code  VALUES ('1398', '350124', '福建省', '福州市', '闽清县', '福建省闽清县');
INSERT INTO  s_area_code  VALUES ('1399', '350125', '福建省', '福州市', '永泰县', '福建省永泰县');
INSERT INTO  s_area_code  VALUES ('1400', '350128', '福建省', '福州市', '平潭县', '福建省平潭县');
INSERT INTO  s_area_code  VALUES ('1401', '350181', '福建省', '福州市', '福清市', '福建省福清市');
INSERT INTO  s_area_code  VALUES ('1402', '350182', '福建省', '福州市', '长乐市', '福建省长乐市');
INSERT INTO  s_area_code  VALUES ('1403', '350200', '福建省', '厦门市', '', '福建省厦门市');
INSERT INTO  s_area_code  VALUES ('1404', '350201', '福建省', '厦门市', '市辖区', '福建省厦门市市辖区');
INSERT INTO  s_area_code  VALUES ('1405', '350202', '福建省', '厦门市', '鼓浪屿区', '福建省厦门市鼓浪屿区');
INSERT INTO  s_area_code  VALUES ('1406', '350203', '福建省', '厦门市', '思明区', '福建省厦门市思明区');
INSERT INTO  s_area_code  VALUES ('1407', '350204', '福建省', '厦门市', '开元区', '福建省厦门市开元区');
INSERT INTO  s_area_code  VALUES ('1408', '350205', '福建省', '厦门市', '海沧区', '福建省厦门市海沧区');
INSERT INTO  s_area_code  VALUES ('1409', '350206', '福建省', '厦门市', '湖里区', '福建省厦门市湖里区');
INSERT INTO  s_area_code  VALUES ('1410', '350211', '福建省', '厦门市', '集美区', '福建省厦门市集美区');
INSERT INTO  s_area_code  VALUES ('1411', '350212', '福建省', '厦门市', '同安区', '福建省厦门市同安区');
INSERT INTO  s_area_code  VALUES ('1412', '350213', '福建省', '厦门市', '翔安区', '福建省厦门市翔安区');
INSERT INTO  s_area_code  VALUES ('1413', '350300', '福建省', '莆田市', '', '福建省莆田市');
INSERT INTO  s_area_code  VALUES ('1414', '350301', '福建省', '莆田市', '市辖区', '福建省莆田市市辖区');
INSERT INTO  s_area_code  VALUES ('1415', '350302', '福建省', '莆田市', '城厢区', '福建省莆田市城厢区');
INSERT INTO  s_area_code  VALUES ('1416', '350303', '福建省', '莆田市', '涵江区', '福建省莆田市涵江区');
INSERT INTO  s_area_code  VALUES ('1417', '350304', '福建省', '莆田市', '荔城区', '福建省莆田市荔城区');
INSERT INTO  s_area_code  VALUES ('1418', '350305', '福建省', '莆田市', '秀屿区', '福建省莆田市秀屿区');
INSERT INTO  s_area_code  VALUES ('1419', '350322', '福建省', '莆田市', '仙游县', '福建省仙游县');
INSERT INTO  s_area_code  VALUES ('1420', '350400', '福建省', '三明市', '', '福建省三明市');
INSERT INTO  s_area_code  VALUES ('1421', '350401', '福建省', '三明市', '市辖区', '福建省三明市市辖区');
INSERT INTO  s_area_code  VALUES ('1422', '350402', '福建省', '三明市', '梅列区', '福建省三明市梅列区');
INSERT INTO  s_area_code  VALUES ('1423', '350403', '福建省', '三明市', '三元区', '福建省三明市三元区');
INSERT INTO  s_area_code  VALUES ('1424', '350421', '福建省', '三明市', '明溪县', '福建省明溪县');
INSERT INTO  s_area_code  VALUES ('1425', '350423', '福建省', '三明市', '清流县', '福建省清流县');
INSERT INTO  s_area_code  VALUES ('1426', '350424', '福建省', '三明市', '宁化县', '福建省宁化县');
INSERT INTO  s_area_code  VALUES ('1427', '350425', '福建省', '三明市', '大田县', '福建省大田县');
INSERT INTO  s_area_code  VALUES ('1428', '350426', '福建省', '三明市', '尤溪县', '福建省尤溪县');
INSERT INTO  s_area_code  VALUES ('1429', '350427', '福建省', '三明市', '沙 县', '福建省沙 县');
INSERT INTO  s_area_code  VALUES ('1430', '350428', '福建省', '三明市', '将乐县', '福建省将乐县');
INSERT INTO  s_area_code  VALUES ('1431', '350429', '福建省', '三明市', '泰宁县', '福建省泰宁县');
INSERT INTO  s_area_code  VALUES ('1432', '350430', '福建省', '三明市', '建宁县', '福建省建宁县');
INSERT INTO  s_area_code  VALUES ('1433', '350481', '福建省', '三明市', '永安市', '福建省永安市');
INSERT INTO  s_area_code  VALUES ('1434', '350500', '福建省', '泉州市', '', '福建省泉州市');
INSERT INTO  s_area_code  VALUES ('1435', '350501', '福建省', '泉州市', '市辖区', '福建省泉州市市辖区');
INSERT INTO  s_area_code  VALUES ('1436', '350502', '福建省', '泉州市', '鲤城区', '福建省泉州市鲤城区');
INSERT INTO  s_area_code  VALUES ('1437', '350503', '福建省', '泉州市', '丰泽区', '福建省泉州市丰泽区');
INSERT INTO  s_area_code  VALUES ('1438', '350504', '福建省', '泉州市', '洛江区', '福建省泉州市洛江区');
INSERT INTO  s_area_code  VALUES ('1439', '350505', '福建省', '泉州市', '泉港区', '福建省泉州市泉港区');
INSERT INTO  s_area_code  VALUES ('1440', '350521', '福建省', '泉州市', '惠安县', '福建省惠安县');
INSERT INTO  s_area_code  VALUES ('1441', '350524', '福建省', '泉州市', '安溪县', '福建省安溪县');
INSERT INTO  s_area_code  VALUES ('1442', '350525', '福建省', '泉州市', '永春县', '福建省永春县');
INSERT INTO  s_area_code  VALUES ('1443', '350526', '福建省', '泉州市', '德化县', '福建省德化县');
INSERT INTO  s_area_code  VALUES ('1444', '350527', '福建省', '泉州市', '金门县', '福建省金门县');
INSERT INTO  s_area_code  VALUES ('1445', '350581', '福建省', '泉州市', '石狮市', '福建省石狮市');
INSERT INTO  s_area_code  VALUES ('1446', '350582', '福建省', '泉州市', '晋江市', '福建省晋江市');
INSERT INTO  s_area_code  VALUES ('1447', '350583', '福建省', '泉州市', '南安市', '福建省南安市');
INSERT INTO  s_area_code  VALUES ('1448', '350600', '福建省', '漳州市', '', '福建省漳州市');
INSERT INTO  s_area_code  VALUES ('1449', '350601', '福建省', '漳州市', '市辖区', '福建省漳州市市辖区');
INSERT INTO  s_area_code  VALUES ('1450', '350602', '福建省', '漳州市', '芗城区', '福建省漳州市芗城区');
INSERT INTO  s_area_code  VALUES ('1451', '350603', '福建省', '漳州市', '龙文区', '福建省漳州市龙文区');
INSERT INTO  s_area_code  VALUES ('1452', '350622', '福建省', '漳州市', '云霄县', '福建省云霄县');
INSERT INTO  s_area_code  VALUES ('1453', '350623', '福建省', '漳州市', '漳浦县', '福建省漳浦县');
INSERT INTO  s_area_code  VALUES ('1454', '350624', '福建省', '漳州市', '诏安县', '福建省诏安县');
INSERT INTO  s_area_code  VALUES ('1455', '350625', '福建省', '漳州市', '长泰县', '福建省长泰县');
INSERT INTO  s_area_code  VALUES ('1456', '350626', '福建省', '漳州市', '东山县', '福建省东山县');
INSERT INTO  s_area_code  VALUES ('1457', '350627', '福建省', '漳州市', '南靖县', '福建省南靖县');
INSERT INTO  s_area_code  VALUES ('1458', '350628', '福建省', '漳州市', '平和县', '福建省平和县');
INSERT INTO  s_area_code  VALUES ('1459', '350629', '福建省', '漳州市', '华安县', '福建省华安县');
INSERT INTO  s_area_code  VALUES ('1460', '350681', '福建省', '漳州市', '龙海市', '福建省龙海市');
INSERT INTO  s_area_code  VALUES ('1461', '350700', '福建省', '漳州市', '南平市', '福建省南平市');
INSERT INTO  s_area_code  VALUES ('1462', '350701', '福建省', '南平市', '市辖区', '福建省南平市市辖区');
INSERT INTO  s_area_code  VALUES ('1463', '350702', '福建省', '南平市', '延平区', '福建省南平市延平区');
INSERT INTO  s_area_code  VALUES ('1464', '350721', '福建省', '南平市', '顺昌县', '福建省顺昌县');
INSERT INTO  s_area_code  VALUES ('1465', '350722', '福建省', '南平市', '浦城县', '福建省浦城县');
INSERT INTO  s_area_code  VALUES ('1466', '350723', '福建省', '南平市', '光泽县', '福建省光泽县');
INSERT INTO  s_area_code  VALUES ('1467', '350724', '福建省', '南平市', '松溪县', '福建省松溪县');
INSERT INTO  s_area_code  VALUES ('1468', '350725', '福建省', '南平市', '政和县', '福建省政和县');
INSERT INTO  s_area_code  VALUES ('1469', '350781', '福建省', '南平市', '邵武市', '福建省邵武市');
INSERT INTO  s_area_code  VALUES ('1470', '350782', '福建省', '南平市', '武夷山市', '福建省武夷山市');
INSERT INTO  s_area_code  VALUES ('1471', '350783', '福建省', '南平市', '建瓯市', '福建省建瓯市');
INSERT INTO  s_area_code  VALUES ('1472', '350784', '福建省', '南平市', '建阳市', '福建省建阳市');
INSERT INTO  s_area_code  VALUES ('1473', '350800', '福建省', '龙岩市', '', '福建省龙岩市');
INSERT INTO  s_area_code  VALUES ('1474', '350801', '福建省', '龙岩市', '市辖区', '福建省龙岩市市辖区');
INSERT INTO  s_area_code  VALUES ('1475', '350802', '福建省', '龙岩市', '新罗区', '福建省龙岩市新罗区');
INSERT INTO  s_area_code  VALUES ('1476', '350821', '福建省', '龙岩市', '长汀县', '福建省长汀县');
INSERT INTO  s_area_code  VALUES ('1477', '350822', '福建省', '龙岩市', '永定县', '福建省永定县');
INSERT INTO  s_area_code  VALUES ('1478', '350823', '福建省', '龙岩市', '上杭县', '福建省上杭县');
INSERT INTO  s_area_code  VALUES ('1479', '350824', '福建省', '龙岩市', '武平县', '福建省武平县');
INSERT INTO  s_area_code  VALUES ('1480', '350825', '福建省', '龙岩市', '连城县', '福建省连城县');
INSERT INTO  s_area_code  VALUES ('1481', '350881', '福建省', '龙岩市', '漳平市', '福建省漳平市');
INSERT INTO  s_area_code  VALUES ('1482', '350900', '福建省', '宁德市', '', '福建省宁德市');
INSERT INTO  s_area_code  VALUES ('1483', '350901', '福建省', '宁德市', '市辖区', '福建省宁德市市辖区');
INSERT INTO  s_area_code  VALUES ('1484', '350902', '福建省', '宁德市', '蕉城区', '福建省宁德市蕉城区');
INSERT INTO  s_area_code  VALUES ('1485', '350921', '福建省', '宁德市', '霞浦县', '福建省霞浦县');
INSERT INTO  s_area_code  VALUES ('1486', '350922', '福建省', '宁德市', '古田县', '福建省古田县');
INSERT INTO  s_area_code  VALUES ('1487', '350923', '福建省', '宁德市', '屏南县', '福建省屏南县');
INSERT INTO  s_area_code  VALUES ('1488', '350924', '福建省', '宁德市', '寿宁县', '福建省寿宁县');
INSERT INTO  s_area_code  VALUES ('1489', '350925', '福建省', '宁德市', '周宁县', '福建省周宁县');
INSERT INTO  s_area_code  VALUES ('1490', '350926', '福建省', '宁德市', '柘荣县', '福建省柘荣县');
INSERT INTO  s_area_code  VALUES ('1491', '350981', '福建省', '宁德市', '福安市', '福建省福安市');
INSERT INTO  s_area_code  VALUES ('1492', '350982', '福建省', '宁德市', '福鼎市', '福建省福鼎市');
INSERT INTO  s_area_code  VALUES ('1493', '360000', '江西省', '', '', '江西省');
INSERT INTO  s_area_code  VALUES ('1494', '360100', '江西省', '南昌市', '', '江西省南昌市');
INSERT INTO  s_area_code  VALUES ('1495', '360101', '江西省', '南昌市', '市辖区', '江西省南昌市市辖区');
INSERT INTO  s_area_code  VALUES ('1496', '360102', '江西省', '南昌市', '东湖区', '江西省南昌市东湖区');
INSERT INTO  s_area_code  VALUES ('1497', '360103', '江西省', '南昌市', '西湖区', '江西省南昌市西湖区');
INSERT INTO  s_area_code  VALUES ('1498', '360104', '江西省', '南昌市', '青云谱区', '江西省南昌市青云谱区');
INSERT INTO  s_area_code  VALUES ('1499', '360105', '江西省', '南昌市', '湾里区', '江西省南昌市湾里区');
INSERT INTO  s_area_code  VALUES ('1500', '360111', '江西省', '南昌市', '青山湖区', '江西省南昌市青山湖区');
INSERT INTO  s_area_code  VALUES ('1501', '360121', '江西省', '南昌市', '南昌县', '江西省南昌县');
INSERT INTO  s_area_code  VALUES ('1502', '360122', '江西省', '南昌市', '新建县', '江西省新建县');
INSERT INTO  s_area_code  VALUES ('1503', '360123', '江西省', '南昌市', '安义县', '江西省安义县');
INSERT INTO  s_area_code  VALUES ('1504', '360124', '江西省', '南昌市', '进贤县', '江西省进贤县');
INSERT INTO  s_area_code  VALUES ('1505', '360200', '江西省', '景德镇市', '', '江西省景德镇市');
INSERT INTO  s_area_code  VALUES ('1506', '360201', '江西省', '景德镇市', '市辖区', '江西省景德镇市市辖区');
INSERT INTO  s_area_code  VALUES ('1507', '360202', '江西省', '景德镇市', '昌江区', '江西省景德镇市昌江区');
INSERT INTO  s_area_code  VALUES ('1508', '360203', '江西省', '景德镇市', '珠山区', '江西省景德镇市珠山区');
INSERT INTO  s_area_code  VALUES ('1509', '360222', '江西省', '景德镇市', '浮梁县', '江西省浮梁县');
INSERT INTO  s_area_code  VALUES ('1510', '360281', '江西省', '景德镇市', '乐平市', '江西省乐平市');
INSERT INTO  s_area_code  VALUES ('1511', '360300', '江西省', '萍乡市', '', '江西省萍乡市');
INSERT INTO  s_area_code  VALUES ('1512', '360301', '江西省', '萍乡市', '市辖区', '江西省萍乡市市辖区');
INSERT INTO  s_area_code  VALUES ('1513', '360302', '江西省', '萍乡市', '安源区', '江西省萍乡市安源区');
INSERT INTO  s_area_code  VALUES ('1514', '360313', '江西省', '萍乡市', '湘东区', '江西省萍乡市湘东区');
INSERT INTO  s_area_code  VALUES ('1515', '360321', '江西省', '萍乡市', '莲花县', '江西省莲花县');
INSERT INTO  s_area_code  VALUES ('1516', '360322', '江西省', '萍乡市', '上栗县', '江西省上栗县');
INSERT INTO  s_area_code  VALUES ('1517', '360323', '江西省', '萍乡市', '芦溪县', '江西省芦溪县');
INSERT INTO  s_area_code  VALUES ('1518', '360400', '江西省', '九江市', '', '江西省九江市');
INSERT INTO  s_area_code  VALUES ('1519', '360401', '江西省', '九江市', '市辖区', '江西省九江市市辖区');
INSERT INTO  s_area_code  VALUES ('1520', '360402', '江西省', '九江市', '庐山区', '江西省九江市庐山区');
INSERT INTO  s_area_code  VALUES ('1521', '360403', '江西省', '九江市', '浔阳区', '江西省九江市浔阳区');
INSERT INTO  s_area_code  VALUES ('1522', '360421', '江西省', '九江市', '九江县', '江西省九江县');
INSERT INTO  s_area_code  VALUES ('1523', '360423', '江西省', '九江市', '武宁县', '江西省武宁县');
INSERT INTO  s_area_code  VALUES ('1524', '360424', '江西省', '九江市', '修水县', '江西省修水县');
INSERT INTO  s_area_code  VALUES ('1525', '360425', '江西省', '九江市', '永修县', '江西省永修县');
INSERT INTO  s_area_code  VALUES ('1526', '360426', '江西省', '九江市', '德安县', '江西省德安县');
INSERT INTO  s_area_code  VALUES ('1527', '360427', '江西省', '九江市', '星子县', '江西省星子县');
INSERT INTO  s_area_code  VALUES ('1528', '360428', '江西省', '九江市', '都昌县', '江西省都昌县');
INSERT INTO  s_area_code  VALUES ('1529', '360429', '江西省', '九江市', '湖口县', '江西省湖口县');
INSERT INTO  s_area_code  VALUES ('1530', '360430', '江西省', '九江市', '彭泽县', '江西省彭泽县');
INSERT INTO  s_area_code  VALUES ('1531', '360481', '江西省', '九江市', '瑞昌市', '江西省瑞昌市');
INSERT INTO  s_area_code  VALUES ('1532', '360500', '江西省', '新余市', '', '江西省新余市');
INSERT INTO  s_area_code  VALUES ('1533', '360501', '江西省', '新余市', '市辖区', '江西省新余市市辖区');
INSERT INTO  s_area_code  VALUES ('1534', '360502', '江西省', '新余市', '渝水区', '江西省新余市渝水区');
INSERT INTO  s_area_code  VALUES ('1535', '360521', '江西省', '新余市', '分宜县', '江西省分宜县');
INSERT INTO  s_area_code  VALUES ('1536', '360600', '江西省', '鹰潭市', '', '江西省鹰潭市');
INSERT INTO  s_area_code  VALUES ('1537', '360601', '江西省', '鹰潭市', '市辖区', '江西省鹰潭市市辖区');
INSERT INTO  s_area_code  VALUES ('1538', '360602', '江西省', '鹰潭市', '月湖区', '江西省鹰潭市月湖区');
INSERT INTO  s_area_code  VALUES ('1539', '360622', '江西省', '鹰潭市', '余江县', '江西省余江县');
INSERT INTO  s_area_code  VALUES ('1540', '360681', '江西省', '鹰潭市', '贵溪市', '江西省贵溪市');
INSERT INTO  s_area_code  VALUES ('1541', '360700', '江西省', '赣州市', '', '江西省赣州市');
INSERT INTO  s_area_code  VALUES ('1542', '360701', '江西省', '赣州市', '市辖区', '江西省赣州市市辖区');
INSERT INTO  s_area_code  VALUES ('1543', '360702', '江西省', '赣州市', '章贡区', '江西省赣州市章贡区');
INSERT INTO  s_area_code  VALUES ('1544', '360721', '江西省', '赣州市', '赣 县', '江西省赣 县');
INSERT INTO  s_area_code  VALUES ('1545', '360722', '江西省', '赣州市', '信丰县', '江西省信丰县');
INSERT INTO  s_area_code  VALUES ('1546', '360723', '江西省', '赣州市', '大余县', '江西省大余县');
INSERT INTO  s_area_code  VALUES ('1547', '360724', '江西省', '赣州市', '上犹县', '江西省上犹县');
INSERT INTO  s_area_code  VALUES ('1548', '360725', '江西省', '赣州市', '崇义县', '江西省崇义县');
INSERT INTO  s_area_code  VALUES ('1549', '360726', '江西省', '赣州市', '安远县', '江西省安远县');
INSERT INTO  s_area_code  VALUES ('1550', '360727', '江西省', '赣州市', '龙南县', '江西省龙南县');
INSERT INTO  s_area_code  VALUES ('1551', '360728', '江西省', '赣州市', '定南县', '江西省定南县');
INSERT INTO  s_area_code  VALUES ('1552', '360729', '江西省', '赣州市', '全南县', '江西省全南县');
INSERT INTO  s_area_code  VALUES ('1553', '360730', '江西省', '赣州市', '宁都县', '江西省宁都县');
INSERT INTO  s_area_code  VALUES ('1554', '360731', '江西省', '赣州市', '于都县', '江西省于都县');
INSERT INTO  s_area_code  VALUES ('1555', '360732', '江西省', '赣州市', '兴国县', '江西省兴国县');
INSERT INTO  s_area_code  VALUES ('1556', '360733', '江西省', '赣州市', '会昌县', '江西省会昌县');
INSERT INTO  s_area_code  VALUES ('1557', '360734', '江西省', '赣州市', '寻乌县', '江西省寻乌县');
INSERT INTO  s_area_code  VALUES ('1558', '360735', '江西省', '赣州市', '石城县', '江西省石城县');
INSERT INTO  s_area_code  VALUES ('1559', '360781', '江西省', '赣州市', '瑞金市', '江西省瑞金市');
INSERT INTO  s_area_code  VALUES ('1560', '360782', '江西省', '赣州市', '南康市', '江西省南康市');
INSERT INTO  s_area_code  VALUES ('1561', '360800', '江西省', '吉安市', '', '江西省吉安市');
INSERT INTO  s_area_code  VALUES ('1562', '360801', '江西省', '吉安市', '市辖区', '江西省吉安市市辖区');
INSERT INTO  s_area_code  VALUES ('1563', '360802', '江西省', '吉安市', '吉州区', '江西省吉安市吉州区');
INSERT INTO  s_area_code  VALUES ('1564', '360803', '江西省', '吉安市', '青原区', '江西省吉安市青原区');
INSERT INTO  s_area_code  VALUES ('1565', '360821', '江西省', '吉安市', '吉安县', '江西省吉安县');
INSERT INTO  s_area_code  VALUES ('1566', '360822', '江西省', '吉安市', '吉水县', '江西省吉水县');
INSERT INTO  s_area_code  VALUES ('1567', '360823', '江西省', '吉安市', '峡江县', '江西省峡江县');
INSERT INTO  s_area_code  VALUES ('1568', '360824', '江西省', '吉安市', '新干县', '江西省新干县');
INSERT INTO  s_area_code  VALUES ('1569', '360825', '江西省', '吉安市', '永丰县', '江西省永丰县');
INSERT INTO  s_area_code  VALUES ('1570', '360826', '江西省', '吉安市', '泰和县', '江西省泰和县');
INSERT INTO  s_area_code  VALUES ('1571', '360827', '江西省', '吉安市', '遂川县', '江西省遂川县');
INSERT INTO  s_area_code  VALUES ('1572', '360828', '江西省', '吉安市', '万安县', '江西省万安县');
INSERT INTO  s_area_code  VALUES ('1573', '360829', '江西省', '吉安市', '安福县', '江西省安福县');
INSERT INTO  s_area_code  VALUES ('1574', '360830', '江西省', '吉安市', '永新县', '江西省永新县');
INSERT INTO  s_area_code  VALUES ('1575', '360881', '江西省', '吉安市', '井冈山市', '江西省井冈山市');
INSERT INTO  s_area_code  VALUES ('1576', '360900', '江西省', '宜春市', '', '江西省宜春市');
INSERT INTO  s_area_code  VALUES ('1577', '360901', '江西省', '宜春市', '市辖区', '江西省宜春市市辖区');
INSERT INTO  s_area_code  VALUES ('1578', '360902', '江西省', '宜春市', '袁州区', '江西省宜春市袁州区');
INSERT INTO  s_area_code  VALUES ('1579', '360921', '江西省', '宜春市', '奉新县', '江西省奉新县');
INSERT INTO  s_area_code  VALUES ('1580', '360922', '江西省', '宜春市', '万载县', '江西省万载县');
INSERT INTO  s_area_code  VALUES ('1581', '360923', '江西省', '宜春市', '上高县', '江西省上高县');
INSERT INTO  s_area_code  VALUES ('1582', '360924', '江西省', '宜春市', '宜丰县', '江西省宜丰县');
INSERT INTO  s_area_code  VALUES ('1583', '360925', '江西省', '宜春市', '靖安县', '江西省靖安县');
INSERT INTO  s_area_code  VALUES ('1584', '360926', '江西省', '宜春市', '铜鼓县', '江西省铜鼓县');
INSERT INTO  s_area_code  VALUES ('1585', '360981', '江西省', '宜春市', '丰城市', '江西省丰城市');
INSERT INTO  s_area_code  VALUES ('1586', '360982', '江西省', '宜春市', '樟树市', '江西省樟树市');
INSERT INTO  s_area_code  VALUES ('1587', '360983', '江西省', '宜春市', '高安市', '江西省高安市');
INSERT INTO  s_area_code  VALUES ('1588', '361000', '江西省', '抚州市', '', '江西省抚州市');
INSERT INTO  s_area_code  VALUES ('1589', '361001', '江西省', '抚州市', '市辖区', '江西省抚州市市辖区');
INSERT INTO  s_area_code  VALUES ('1590', '361002', '江西省', '抚州市', '临川区', '江西省抚州市临川区');
INSERT INTO  s_area_code  VALUES ('1591', '361021', '江西省', '抚州市', '南城县', '江西省南城县');
INSERT INTO  s_area_code  VALUES ('1592', '361022', '江西省', '抚州市', '黎川县', '江西省黎川县');
INSERT INTO  s_area_code  VALUES ('1593', '361023', '江西省', '抚州市', '南丰县', '江西省南丰县');
INSERT INTO  s_area_code  VALUES ('1594', '361024', '江西省', '抚州市', '崇仁县', '江西省崇仁县');
INSERT INTO  s_area_code  VALUES ('1595', '361025', '江西省', '抚州市', '乐安县', '江西省乐安县');
INSERT INTO  s_area_code  VALUES ('1596', '361026', '江西省', '抚州市', '宜黄县', '江西省宜黄县');
INSERT INTO  s_area_code  VALUES ('1597', '361027', '江西省', '抚州市', '金溪县', '江西省金溪县');
INSERT INTO  s_area_code  VALUES ('1598', '361028', '江西省', '抚州市', '资溪县', '江西省资溪县');
INSERT INTO  s_area_code  VALUES ('1599', '361029', '江西省', '抚州市', '东乡县', '江西省东乡县');
INSERT INTO  s_area_code  VALUES ('1600', '361030', '江西省', '抚州市', '广昌县', '江西省广昌县');
INSERT INTO  s_area_code  VALUES ('1601', '361100', '江西省', '上饶市', '', '江西省上饶市');
INSERT INTO  s_area_code  VALUES ('1602', '361101', '江西省', '上饶市', '市辖区', '江西省上饶市市辖区');
INSERT INTO  s_area_code  VALUES ('1603', '361102', '江西省', '上饶市', '信州区', '江西省上饶市信州区');
INSERT INTO  s_area_code  VALUES ('1604', '361121', '江西省', '上饶市', '上饶县', '江西省上饶县');
INSERT INTO  s_area_code  VALUES ('1605', '361122', '江西省', '上饶市', '广丰县', '江西省广丰县');
INSERT INTO  s_area_code  VALUES ('1606', '361123', '江西省', '上饶市', '玉山县', '江西省玉山县');
INSERT INTO  s_area_code  VALUES ('1607', '361124', '江西省', '上饶市', '铅山县', '江西省铅山县');
INSERT INTO  s_area_code  VALUES ('1608', '361125', '江西省', '上饶市', '横峰县', '江西省横峰县');
INSERT INTO  s_area_code  VALUES ('1609', '361126', '江西省', '上饶市', '弋阳县', '江西省弋阳县');
INSERT INTO  s_area_code  VALUES ('1610', '361127', '江西省', '上饶市', '余干县', '江西省余干县');
INSERT INTO  s_area_code  VALUES ('1611', '361128', '江西省', '上饶市', '鄱阳县', '江西省鄱阳县');
INSERT INTO  s_area_code  VALUES ('1612', '361129', '江西省', '上饶市', '万年县', '江西省万年县');
INSERT INTO  s_area_code  VALUES ('1613', '361130', '江西省', '上饶市', '婺源县', '江西省婺源县');
INSERT INTO  s_area_code  VALUES ('1614', '361181', '江西省', '上饶市', '德兴市', '江西省德兴市');
INSERT INTO  s_area_code  VALUES ('1615', '362200', '江西省', '宜春', '宜春地区 ', '江西省宜春地区 ');
INSERT INTO  s_area_code  VALUES ('1616', '362201', '江西省', '宜春', '宜春市', '江西省 宜春市 ');
INSERT INTO  s_area_code  VALUES ('1617', '362202', '江西省', '宜春', '丰城市', '江西省 丰城市 ');
INSERT INTO  s_area_code  VALUES ('1618', '362203', '江西省', '宜春', '樟树市', '江西省 樟树市 ');
INSERT INTO  s_area_code  VALUES ('1619', '362204', '江西省', '宜春', '高安市', '江西省 高安市 ');
INSERT INTO  s_area_code  VALUES ('1620', '362226', '江西省', '宜春', '奉新县', '江西省 奉新县 ');
INSERT INTO  s_area_code  VALUES ('1621', '362227', '江西省', '宜春', '万载县', '江西省 万载县 ');
INSERT INTO  s_area_code  VALUES ('1622', '362228', '江西省', '宜春', '上高县', '江西省 上高县 ');
INSERT INTO  s_area_code  VALUES ('1623', '362229', '江西省', '宜春', '宜丰县', '江西省 宜丰县 ');
INSERT INTO  s_area_code  VALUES ('1624', '362232', '江西省', '宜春', '靖安县 ', '江西省 靖安县 ');
INSERT INTO  s_area_code  VALUES ('1625', '362233', '江西省', '宜春', '铜鼓县', '江西省 铜鼓县 ');
INSERT INTO  s_area_code  VALUES ('1626', '362300', '江西省', '上饶市', '上饶地区', '江西省上饶地区 ');
INSERT INTO  s_area_code  VALUES ('1627', '362301', '江西省', '上饶市', '上饶市 ', '江西省 上饶市 ');
INSERT INTO  s_area_code  VALUES ('1628', '362302', '江西省', '上饶市', ' 德兴市', '江西省 德兴市 ');
INSERT INTO  s_area_code  VALUES ('1629', '362321', '江西省', '上饶市', '上饶县', '江西省 上饶县 ');
INSERT INTO  s_area_code  VALUES ('1630', '362322', '江西省', '上饶市', '广丰县', '江西省 广丰县 ');
INSERT INTO  s_area_code  VALUES ('1631', '362323', '江西省', '上饶市', '玉山县', '江西省 玉山县 ');
INSERT INTO  s_area_code  VALUES ('1632', '362324', '江西省', '上饶市', '铅山县', '江西省 铅山县 ');
INSERT INTO  s_area_code  VALUES ('1633', '362325', '江西省', '上饶市', '横峰县', '江西省 横峰县 ');
INSERT INTO  s_area_code  VALUES ('1634', '362326', '江西省', '上饶市', ' 弋阳县', '江西省 弋阳县 ');
INSERT INTO  s_area_code  VALUES ('1635', '362329', '江西省', '上饶市', ' 余干县', '江西省 余干县 ');
INSERT INTO  s_area_code  VALUES ('1636', '362330', '江西省', '上饶市', '波阳县', '江西省 波阳县 ');
INSERT INTO  s_area_code  VALUES ('1637', '362331', '江西省', '上饶市', '万年县', '江西省 万年县 ');
INSERT INTO  s_area_code  VALUES ('1638', '362334', '江西省', '上饶市', '婺源县 ', '江西省 婺源县 ');
INSERT INTO  s_area_code  VALUES ('1639', '362400', '江西省', '吉安市', '吉安地区', '江西省吉安地区 ');
INSERT INTO  s_area_code  VALUES ('1640', '362401', '江西省', '吉安市', '吉安市 ', '江西省 吉安市 ');
INSERT INTO  s_area_code  VALUES ('1641', '362402', '江西省', '吉安市', '井冈山市', '江西省 井冈山市 ');
INSERT INTO  s_area_code  VALUES ('1642', '362421', '江西省', '吉安市', '吉安县', '江西省 吉安县 ');
INSERT INTO  s_area_code  VALUES ('1643', '362422', '江西省', '吉安市', '吉水县', '江西省 吉水县 ');
INSERT INTO  s_area_code  VALUES ('1644', '362423', '江西省', '吉安市', '峡江县', '江西省 峡江县 ');
INSERT INTO  s_area_code  VALUES ('1645', '362424', '江西省', '吉安市', '新干县', '江西省 新干县 ');
INSERT INTO  s_area_code  VALUES ('1646', '362425', '江西省', '吉安市', '永丰县 ', '江西省 永丰县 ');
INSERT INTO  s_area_code  VALUES ('1647', '362426', '江西省', '吉安市', '泰和县', '江西省 泰和县 ');
INSERT INTO  s_area_code  VALUES ('1648', '362427', '江西省', '吉安市', '遂川县', '江西省 遂川县 ');
INSERT INTO  s_area_code  VALUES ('1649', '362428', '江西省', '吉安市', '万安县 ', '江西省 万安县 ');
INSERT INTO  s_area_code  VALUES ('1650', '362429', '江西省', '吉安市', '安福县', '江西省 安福县 ');
INSERT INTO  s_area_code  VALUES ('1651', '362430', '江西省', '吉安市', '永新县', '江西省 永新县 ');
INSERT INTO  s_area_code  VALUES ('1652', '362432', '江西省', '吉安市', ' 宁冈县 ', '江西省 宁冈县 ');
INSERT INTO  s_area_code  VALUES ('1653', '362500', '江西省', '抚州市', '抚州地区', '江西省抚州地区 ');
INSERT INTO  s_area_code  VALUES ('1654', '362501', '江西省', '抚州市', ' 临川市', '江西省 临川市 ');
INSERT INTO  s_area_code  VALUES ('1655', '362522', '江西省', '抚州市', ' 南城县 ', '江西省 南城县 ');
INSERT INTO  s_area_code  VALUES ('1656', '362523', '江西省', '抚州市', '黎川县', '江西省 黎川县 ');
INSERT INTO  s_area_code  VALUES ('1657', '362524', '江西省', '抚州市', '南丰县', '江西省 南丰县 ');
INSERT INTO  s_area_code  VALUES ('1658', '362525', '江西省', '抚州市', '崇仁县', '江西省 崇仁县 ');
INSERT INTO  s_area_code  VALUES ('1659', '362526', '江西省', '抚州市', '乐安县', '江西省 乐安县 ');
INSERT INTO  s_area_code  VALUES ('1660', '362527', '江西省', '抚州市', '宣黄县', '江西省 宣黄县 ');
INSERT INTO  s_area_code  VALUES ('1661', '362528', '江西省', '抚州市', '金溪县', '江西省 金溪县 ');
INSERT INTO  s_area_code  VALUES ('1662', '362529', '江西省', '抚州市', '资溪县', '江西省 资溪县 ');
INSERT INTO  s_area_code  VALUES ('1663', '362531', '江西省', '抚州市', '东乡县', '江西省 东乡县 ');
INSERT INTO  s_area_code  VALUES ('1664', '362532', '江西省', '抚州市', '广昌县', '江西省 广昌县 ');
INSERT INTO  s_area_code  VALUES ('1665', '370000', '山东省', '', '', '山东省');
INSERT INTO  s_area_code  VALUES ('1666', '370100', '山东省', '济南市', '', '山东省济南市');
INSERT INTO  s_area_code  VALUES ('1667', '370101', '山东省', '济南市', '市辖区', '山东省济南市市辖区');
INSERT INTO  s_area_code  VALUES ('1668', '370102', '山东省', '济南市', '历下区', '山东省济南市历下区');
INSERT INTO  s_area_code  VALUES ('1669', '370103', '山东省', '济南市', '市中区', '山东省济南市市中区');
INSERT INTO  s_area_code  VALUES ('1670', '370104', '山东省', '济南市', '槐荫区', '山东省济南市槐荫区');
INSERT INTO  s_area_code  VALUES ('1671', '370105', '山东省', '济南市', '天桥区', '山东省济南市天桥区');
INSERT INTO  s_area_code  VALUES ('1672', '370112', '山东省', '济南市', '历城区', '山东省济南市历城区');
INSERT INTO  s_area_code  VALUES ('1673', '370113', '山东省', '济南市', '长清区', '山东省济南市长清区');
INSERT INTO  s_area_code  VALUES ('1674', '370124', '山东省', '济南市', '平阴县', '山东省平阴县');
INSERT INTO  s_area_code  VALUES ('1675', '370125', '山东省', '济南市', '济阳县', '山东省济阳县');
INSERT INTO  s_area_code  VALUES ('1676', '370126', '山东省', '济南市', '商河县', '山东省商河县');
INSERT INTO  s_area_code  VALUES ('1677', '370181', '山东省', '济南市', '章丘市', '山东省章丘市');
INSERT INTO  s_area_code  VALUES ('1678', '370200', '山东省', '青岛市', '', '山东省青岛市');
INSERT INTO  s_area_code  VALUES ('1679', '370201', '山东省', '青岛市', '市辖区', '山东省青岛市市辖区');
INSERT INTO  s_area_code  VALUES ('1680', '370202', '山东省', '青岛市', '市南区', '山东省青岛市市南区');
INSERT INTO  s_area_code  VALUES ('1681', '370203', '山东省', '青岛市', '市北区', '山东省青岛市市北区');
INSERT INTO  s_area_code  VALUES ('1682', '370205', '山东省', '青岛市', '四方区', '山东省青岛市四方区');
INSERT INTO  s_area_code  VALUES ('1683', '370211', '山东省', '青岛市', '黄岛区', '山东省青岛市黄岛区');
INSERT INTO  s_area_code  VALUES ('1684', '370212', '山东省', '青岛市', '崂山区', '山东省青岛市崂山区');
INSERT INTO  s_area_code  VALUES ('1685', '370213', '山东省', '青岛市', '李沧区', '山东省青岛市李沧区');
INSERT INTO  s_area_code  VALUES ('1686', '370214', '山东省', '青岛市', '城阳区', '山东省青岛市城阳区');
INSERT INTO  s_area_code  VALUES ('1687', '370281', '山东省', '青岛市', '胶州市', '山东省胶州市');
INSERT INTO  s_area_code  VALUES ('1688', '370282', '山东省', '青岛市', '即墨市', '山东省即墨市');
INSERT INTO  s_area_code  VALUES ('1689', '370283', '山东省', '青岛市', '平度市', '山东省平度市');
INSERT INTO  s_area_code  VALUES ('1690', '370284', '山东省', '青岛市', '胶南市', '山东省胶南市');
INSERT INTO  s_area_code  VALUES ('1691', '370285', '山东省', '青岛市', '莱西市', '山东省莱西市');
INSERT INTO  s_area_code  VALUES ('1692', '370300', '山东省', '淄博市', '', '山东省淄博市');
INSERT INTO  s_area_code  VALUES ('1693', '370301', '山东省', '淄博市', '市辖区', '山东省淄博市市辖区');
INSERT INTO  s_area_code  VALUES ('1694', '370302', '山东省', '淄博市', '淄川区', '山东省淄博市淄川区');
INSERT INTO  s_area_code  VALUES ('1695', '370303', '山东省', '淄博市', '张店区', '山东省淄博市张店区');
INSERT INTO  s_area_code  VALUES ('1696', '370304', '山东省', '淄博市', '博山区', '山东省淄博市博山区');
INSERT INTO  s_area_code  VALUES ('1697', '370305', '山东省', '淄博市', '临淄区', '山东省淄博市临淄区');
INSERT INTO  s_area_code  VALUES ('1698', '370306', '山东省', '淄博市', '周村区', '山东省淄博市周村区');
INSERT INTO  s_area_code  VALUES ('1699', '370321', '山东省', '淄博市', '桓台县', '山东省桓台县');
INSERT INTO  s_area_code  VALUES ('1700', '370322', '山东省', '淄博市', '高青县', '山东省高青县');
INSERT INTO  s_area_code  VALUES ('1701', '370323', '山东省', '淄博市', '沂源县', '山东省沂源县');
INSERT INTO  s_area_code  VALUES ('1702', '370400', '山东省', '枣庄市', '', '山东省枣庄市');
INSERT INTO  s_area_code  VALUES ('1703', '370401', '山东省', '枣庄市', '市辖区', '山东省枣庄市市辖区');
INSERT INTO  s_area_code  VALUES ('1704', '370402', '山东省', '枣庄市', '市中区', '山东省枣庄市市中区');
INSERT INTO  s_area_code  VALUES ('1705', '370403', '山东省', '枣庄市', '薛城区', '山东省枣庄市薛城区');
INSERT INTO  s_area_code  VALUES ('1706', '370404', '山东省', '枣庄市', '峄城区', '山东省枣庄市峄城区');
INSERT INTO  s_area_code  VALUES ('1707', '370405', '山东省', '枣庄市', '台儿庄区', '山东省枣庄市台儿庄区');
INSERT INTO  s_area_code  VALUES ('1708', '370406', '山东省', '枣庄市', '山亭区', '山东省枣庄市山亭区');
INSERT INTO  s_area_code  VALUES ('1709', '370481', '山东省', '枣庄市', '滕州市', '山东省滕州市');
INSERT INTO  s_area_code  VALUES ('1710', '370500', '山东省', '东营市', '', '山东省东营市');
INSERT INTO  s_area_code  VALUES ('1711', '370501', '山东省', '东营市', '市辖区', '山东省东营市市辖区');
INSERT INTO  s_area_code  VALUES ('1712', '370502', '山东省', '东营市', '东营区', '山东省东营市东营区');
INSERT INTO  s_area_code  VALUES ('1713', '370503', '山东省', '东营市', '河口区', '山东省东营市河口区');
INSERT INTO  s_area_code  VALUES ('1714', '370521', '山东省', '东营市', '垦利县', '山东省垦利县');
INSERT INTO  s_area_code  VALUES ('1715', '370522', '山东省', '东营市', '利津县', '山东省利津县');
INSERT INTO  s_area_code  VALUES ('1716', '370523', '山东省', '东营市', '广饶县', '山东省广饶县');
INSERT INTO  s_area_code  VALUES ('1717', '370600', '山东省', '烟台市', '', '山东省烟台市');
INSERT INTO  s_area_code  VALUES ('1718', '370601', '山东省', '烟台市', '市辖区', '山东省烟台市市辖区');
INSERT INTO  s_area_code  VALUES ('1719', '370602', '山东省', '烟台市', '芝罘区', '山东省烟台市芝罘区');
INSERT INTO  s_area_code  VALUES ('1720', '370611', '山东省', '烟台市', '福山区', '山东省烟台市福山区');
INSERT INTO  s_area_code  VALUES ('1721', '370612', '山东省', '烟台市', '牟平区', '山东省烟台市牟平区');
INSERT INTO  s_area_code  VALUES ('1722', '370613', '山东省', '烟台市', '莱山区', '山东省烟台市莱山区');
INSERT INTO  s_area_code  VALUES ('1723', '370634', '山东省', '烟台市', '长岛县', '山东省长岛县');
INSERT INTO  s_area_code  VALUES ('1724', '370681', '山东省', '烟台市', '龙口市', '山东省龙口市');
INSERT INTO  s_area_code  VALUES ('1725', '370682', '山东省', '烟台市', '莱阳市', '山东省莱阳市');
INSERT INTO  s_area_code  VALUES ('1726', '370683', '山东省', '烟台市', '莱州市', '山东省莱州市');
INSERT INTO  s_area_code  VALUES ('1727', '370684', '山东省', '烟台市', '蓬莱市', '山东省蓬莱市');
INSERT INTO  s_area_code  VALUES ('1728', '370685', '山东省', '烟台市', '招远市', '山东省招远市');
INSERT INTO  s_area_code  VALUES ('1729', '370686', '山东省', '烟台市', '栖霞市', '山东省栖霞市');
INSERT INTO  s_area_code  VALUES ('1730', '370687', '山东省', '烟台市', '海阳市', '山东省海阳市');
INSERT INTO  s_area_code  VALUES ('1731', '370700', '山东省', '潍坊市', '', '山东省潍坊市');
INSERT INTO  s_area_code  VALUES ('1732', '370701', '山东省', '潍坊市', '市辖区', '山东省潍坊市市辖区');
INSERT INTO  s_area_code  VALUES ('1733', '370702', '山东省', '潍坊市', '潍城区', '山东省潍坊市潍城区');
INSERT INTO  s_area_code  VALUES ('1734', '370703', '山东省', '潍坊市', '寒亭区', '山东省潍坊市寒亭区');
INSERT INTO  s_area_code  VALUES ('1735', '370704', '山东省', '潍坊市', '坊子区', '山东省潍坊市坊子区');
INSERT INTO  s_area_code  VALUES ('1736', '370705', '山东省', '潍坊市', '奎文区', '山东省潍坊市奎文区');
INSERT INTO  s_area_code  VALUES ('1737', '370724', '山东省', '潍坊市', '临朐县', '山东省临朐县');
INSERT INTO  s_area_code  VALUES ('1738', '370725', '山东省', '潍坊市', '昌乐县', '山东省昌乐县');
INSERT INTO  s_area_code  VALUES ('1739', '370781', '山东省', '潍坊市', '青州市', '山东省青州市');
INSERT INTO  s_area_code  VALUES ('1740', '370782', '山东省', '潍坊市', '诸城市', '山东省诸城市');
INSERT INTO  s_area_code  VALUES ('1741', '370783', '山东省', '潍坊市', '寿光市', '山东省寿光市');
INSERT INTO  s_area_code  VALUES ('1742', '370784', '山东省', '潍坊市', '安丘市', '山东省安丘市');
INSERT INTO  s_area_code  VALUES ('1743', '370785', '山东省', '潍坊市', '高密市', '山东省高密市');
INSERT INTO  s_area_code  VALUES ('1744', '370786', '山东省', '潍坊市', '昌邑市', '山东省昌邑市');
INSERT INTO  s_area_code  VALUES ('1745', '370800', '山东省', '济宁市', '', '山东省济宁市');
INSERT INTO  s_area_code  VALUES ('1746', '370801', '山东省', '济宁市', '市辖区', '山东省济宁市市辖区');
INSERT INTO  s_area_code  VALUES ('1747', '370802', '山东省', '济宁市', '市中区', '山东省济宁市市中区');
INSERT INTO  s_area_code  VALUES ('1748', '370811', '山东省', '济宁市', '任城区', '山东省济宁市任城区');
INSERT INTO  s_area_code  VALUES ('1749', '370826', '山东省', '济宁市', '微山县', '山东省微山县');
INSERT INTO  s_area_code  VALUES ('1750', '370827', '山东省', '济宁市', '鱼台县', '山东省鱼台县');
INSERT INTO  s_area_code  VALUES ('1751', '370828', '山东省', '济宁市', '金乡县', '山东省金乡县');
INSERT INTO  s_area_code  VALUES ('1752', '370829', '山东省', '济宁市', '嘉祥县', '山东省嘉祥县');
INSERT INTO  s_area_code  VALUES ('1753', '370830', '山东省', '济宁市', '汶上县', '山东省汶上县');
INSERT INTO  s_area_code  VALUES ('1754', '370831', '山东省', '济宁市', '泗水县', '山东省泗水县');
INSERT INTO  s_area_code  VALUES ('1755', '370832', '山东省', '济宁市', '梁山县', '山东省梁山县');
INSERT INTO  s_area_code  VALUES ('1756', '370881', '山东省', '济宁市', '曲阜市', '山东省曲阜市');
INSERT INTO  s_area_code  VALUES ('1757', '370882', '山东省', '济宁市', '兖州市', '山东省兖州市');
INSERT INTO  s_area_code  VALUES ('1758', '370883', '山东省', '济宁市', '邹城市', '山东省邹城市');
INSERT INTO  s_area_code  VALUES ('1759', '370900', '山东省', '泰安市', '', '山东省泰安市');
INSERT INTO  s_area_code  VALUES ('1760', '370901', '山东省', '泰安市', '市辖区', '山东省泰安市市辖区');
INSERT INTO  s_area_code  VALUES ('1761', '370902', '山东省', '泰安市', '泰山区', '山东省泰安市泰山区');
INSERT INTO  s_area_code  VALUES ('1762', '370903', '山东省', '泰安市', '岱岳区', '山东省泰安市岱岳区');
INSERT INTO  s_area_code  VALUES ('1763', '370911', '山东省', '泰安市', '郊区', '山东省 郊区 ');
INSERT INTO  s_area_code  VALUES ('1764', '370921', '山东省', '泰安市', '宁阳县', '山东省宁阳县');
INSERT INTO  s_area_code  VALUES ('1765', '370923', '山东省', '泰安市', '东平县', '山东省东平县');
INSERT INTO  s_area_code  VALUES ('1766', '370982', '山东省', '泰安市', '新泰市', '山东省新泰市');
INSERT INTO  s_area_code  VALUES ('1767', '370983', '山东省', '泰安市', '肥城市', '山东省肥城市');
INSERT INTO  s_area_code  VALUES ('1768', '371000', '山东省', '威海市', '', '山东省威海市');
INSERT INTO  s_area_code  VALUES ('1769', '371001', '山东省', '威海市', '市辖区', '山东省威海市市辖区');
INSERT INTO  s_area_code  VALUES ('1770', '371002', '山东省', '威海市', '环翠区', '山东省威海市环翠区');
INSERT INTO  s_area_code  VALUES ('1771', '371081', '山东省', '威海市', '文登市', '山东省文登市');
INSERT INTO  s_area_code  VALUES ('1772', '371082', '山东省', '威海市', '荣成市', '山东省荣成市');
INSERT INTO  s_area_code  VALUES ('1773', '371083', '山东省', '威海市', '乳山市', '山东省乳山市');
INSERT INTO  s_area_code  VALUES ('1774', '371100', '山东省', '日照市', '', '山东省日照市');
INSERT INTO  s_area_code  VALUES ('1775', '371101', '山东省', '日照市', '市辖区', '山东省日照市市辖区');
INSERT INTO  s_area_code  VALUES ('1776', '371102', '山东省', '日照市', '东港区', '山东省日照市东港区');
INSERT INTO  s_area_code  VALUES ('1777', '371103', '山东省', '日照市', '岚山区', '山东省日照市岚山区');
INSERT INTO  s_area_code  VALUES ('1778', '371121', '山东省', '日照市', '五莲县', '山东省五莲县');
INSERT INTO  s_area_code  VALUES ('1779', '371122', '山东省', '日照市', '莒 县', '山东省莒 县');
INSERT INTO  s_area_code  VALUES ('1780', '371200', '山东省', '莱芜市', '', '山东省莱芜市');
INSERT INTO  s_area_code  VALUES ('1781', '371201', '山东省', '莱芜市', '市辖区', '山东省莱芜市市辖区');
INSERT INTO  s_area_code  VALUES ('1782', '371202', '山东省', '莱芜市', '莱城区', '山东省莱芜市莱城区');
INSERT INTO  s_area_code  VALUES ('1783', '371203', '山东省', '莱芜市', '钢城区', '山东省莱芜市钢城区');
INSERT INTO  s_area_code  VALUES ('1784', '371300', '山东省', '临沂市', '', '山东省临沂市');
INSERT INTO  s_area_code  VALUES ('1785', '371301', '山东省', '临沂市', '市辖区', '山东省临沂市市辖区');
INSERT INTO  s_area_code  VALUES ('1786', '371302', '山东省', '临沂市', '兰山区', '山东省临沂市兰山区');
INSERT INTO  s_area_code  VALUES ('1787', '371311', '山东省', '临沂市', '罗庄区', '山东省临沂市罗庄区');
INSERT INTO  s_area_code  VALUES ('1788', '371312', '山东省', '临沂市', '河东区', '山东省临沂市河东区');
INSERT INTO  s_area_code  VALUES ('1789', '371321', '山东省', '临沂市', '沂南县', '山东省沂南县');
INSERT INTO  s_area_code  VALUES ('1790', '371322', '山东省', '临沂市', '郯城县', '山东省郯城县');
INSERT INTO  s_area_code  VALUES ('1791', '371323', '山东省', '临沂市', '沂水县', '山东省沂水县');
INSERT INTO  s_area_code  VALUES ('1792', '371324', '山东省', '临沂市', '苍山县', '山东省苍山县');
INSERT INTO  s_area_code  VALUES ('1793', '371325', '山东省', '临沂市', '费 县', '山东省费 县');
INSERT INTO  s_area_code  VALUES ('1794', '371326', '山东省', '临沂市', '平邑县', '山东省平邑县');
INSERT INTO  s_area_code  VALUES ('1795', '371327', '山东省', '临沂市', '莒南县', '山东省莒南县');
INSERT INTO  s_area_code  VALUES ('1796', '371328', '山东省', '临沂市', '蒙阴县', '山东省蒙阴县');
INSERT INTO  s_area_code  VALUES ('1797', '371329', '山东省', '临沂市', '临沭县', '山东省临沭县');
INSERT INTO  s_area_code  VALUES ('1798', '371400', '山东省', '德州市', '', '山东省德州市');
INSERT INTO  s_area_code  VALUES ('1799', '371401', '山东省', '德州市', '市辖区', '山东省德州市市辖区');
INSERT INTO  s_area_code  VALUES ('1800', '371402', '山东省', '德州市', '德城区', '山东省德州市德城区');
INSERT INTO  s_area_code  VALUES ('1801', '371421', '山东省', '德州市', '陵 县', '山东省陵 县');
INSERT INTO  s_area_code  VALUES ('1802', '371422', '山东省', '德州市', '宁津县', '山东省宁津县');
INSERT INTO  s_area_code  VALUES ('1803', '371423', '山东省', '德州市', '庆云县', '山东省庆云县');
INSERT INTO  s_area_code  VALUES ('1804', '371424', '山东省', '德州市', '临邑县', '山东省临邑县');
INSERT INTO  s_area_code  VALUES ('1805', '371425', '山东省', '德州市', '齐河县', '山东省齐河县');
INSERT INTO  s_area_code  VALUES ('1806', '371426', '山东省', '德州市', '平原县', '山东省平原县');
INSERT INTO  s_area_code  VALUES ('1807', '371427', '山东省', '德州市', '夏津县', '山东省夏津县');
INSERT INTO  s_area_code  VALUES ('1808', '371428', '山东省', '德州市', '武城县', '山东省武城县');
INSERT INTO  s_area_code  VALUES ('1809', '371481', '山东省', '德州市', '乐陵市', '山东省乐陵市');
INSERT INTO  s_area_code  VALUES ('1810', '371482', '山东省', '德州市', '禹城市', '山东省禹城市');
INSERT INTO  s_area_code  VALUES ('1811', '371500', '山东省', '聊城市', '', '山东省聊城市');
INSERT INTO  s_area_code  VALUES ('1812', '371501', '山东省', '聊城市', '市辖区', '山东省聊城市市辖区');
INSERT INTO  s_area_code  VALUES ('1813', '371502', '山东省', '聊城市', '东昌府区', '山东省聊城市东昌府区');
INSERT INTO  s_area_code  VALUES ('1814', '371521', '山东省', '聊城市', '阳谷县', '山东省阳谷县');
INSERT INTO  s_area_code  VALUES ('1815', '371522', '山东省', '聊城市', '莘 县', '山东省莘 县');
INSERT INTO  s_area_code  VALUES ('1816', '371523', '山东省', '聊城市', '茌平县', '山东省茌平县');
INSERT INTO  s_area_code  VALUES ('1817', '371524', '山东省', '聊城市', '东阿县', '山东省东阿县');
INSERT INTO  s_area_code  VALUES ('1818', '371525', '山东省', '聊城市', '冠 县', '山东省冠 县');
INSERT INTO  s_area_code  VALUES ('1819', '371526', '山东省', '聊城市', '高唐县', '山东省高唐县');
INSERT INTO  s_area_code  VALUES ('1820', '371581', '山东省', '聊城市', '临清市', '山东省临清市');
INSERT INTO  s_area_code  VALUES ('1821', '371600', '山东省', '滨州市', '', '山东省滨州市');
INSERT INTO  s_area_code  VALUES ('1822', '371601', '山东省', '滨州市', '市辖区', '山东省滨州市市辖区');
INSERT INTO  s_area_code  VALUES ('1823', '371602', '山东省', '滨州市', '滨城区', '山东省滨州市滨城区');
INSERT INTO  s_area_code  VALUES ('1824', '371621', '山东省', '滨州市', '惠民县', '山东省惠民县');
INSERT INTO  s_area_code  VALUES ('1825', '371622', '山东省', '滨州市', '阳信县', '山东省阳信县');
INSERT INTO  s_area_code  VALUES ('1826', '371623', '山东省', '滨州市', '无棣县', '山东省无棣县');
INSERT INTO  s_area_code  VALUES ('1827', '371624', '山东省', '滨州市', '沾化县', '山东省沾化县');
INSERT INTO  s_area_code  VALUES ('1828', '371625', '山东省', '滨州市', '博兴县', '山东省博兴县');
INSERT INTO  s_area_code  VALUES ('1829', '371626', '山东省', '滨州市', '邹平县', '山东省邹平县');
INSERT INTO  s_area_code  VALUES ('1830', '371700', '山东省', '荷泽市', '', '山东省荷泽市');
INSERT INTO  s_area_code  VALUES ('1831', '371701', '山东省', '荷泽市', '市辖区', '山东省荷泽市市辖区');
INSERT INTO  s_area_code  VALUES ('1832', '371702', '山东省', '荷泽市', '牡丹区', '山东省荷泽市牡丹区');
INSERT INTO  s_area_code  VALUES ('1833', '371721', '山东省', '荷泽市', '曹 县', '山东省曹 县');
INSERT INTO  s_area_code  VALUES ('1834', '371722', '山东省', '荷泽市', '单 县', '山东省单 县');
INSERT INTO  s_area_code  VALUES ('1835', '371723', '山东省', '荷泽市', '成武县', '山东省成武县');
INSERT INTO  s_area_code  VALUES ('1836', '371724', '山东省', '荷泽市', '巨野县', '山东省巨野县');
INSERT INTO  s_area_code  VALUES ('1837', '371725', '山东省', '荷泽市', '郓城县', '山东省郓城县');
INSERT INTO  s_area_code  VALUES ('1838', '371726', '山东省', '荷泽市', '鄄城县', '山东省鄄城县');
INSERT INTO  s_area_code  VALUES ('1839', '371727', '山东省', '荷泽市', '定陶县', '山东省定陶县');
INSERT INTO  s_area_code  VALUES ('1840', '371728', '山东省', '荷泽市', '东明县', '山东省东明县');
INSERT INTO  s_area_code  VALUES ('1841', '372300', '山东省', '滨州市', '滨州地区', '山东省滨州地区 ');
INSERT INTO  s_area_code  VALUES ('1842', '372301', '山东省', '滨州市', '滨州市', '山东省 滨州市 ');
INSERT INTO  s_area_code  VALUES ('1843', '372321', '山东省', '滨州市', '惠民县', '山东省 惠民县 ');
INSERT INTO  s_area_code  VALUES ('1844', '372323', '山东省', '滨州市', ' 阳信县', '山东省 阳信县 ');
INSERT INTO  s_area_code  VALUES ('1845', '372324', '山东省', '滨州市', '无棣县', '山东省 无棣县 ');
INSERT INTO  s_area_code  VALUES ('1846', '372325', '山东省', '滨州市', '沾化县', '山东省 沾化县 ');
INSERT INTO  s_area_code  VALUES ('1847', '372328', '山东省', '滨州市', '博兴县', '山东省 博兴县 ');
INSERT INTO  s_area_code  VALUES ('1848', '372330', '山东省', '滨州市', '邹平县', '山东省 邹平县 ');
INSERT INTO  s_area_code  VALUES ('1849', '372900', '山东省', '荷泽市', '荷泽地区', '山东省荷泽地区 ');
INSERT INTO  s_area_code  VALUES ('1850', '372901', '山东省', '荷泽市', ' 荷泽市', '山东省 荷泽市 ');
INSERT INTO  s_area_code  VALUES ('1851', '372922', '山东省', '荷泽市', '曹县', '山东省 曹县 ');
INSERT INTO  s_area_code  VALUES ('1852', '372923', '山东省', '荷泽市', '定陶县', '山东省 定陶县 ');
INSERT INTO  s_area_code  VALUES ('1853', '372924', '山东省', '荷泽市', '成武县', '山东省 成武县 ');
INSERT INTO  s_area_code  VALUES ('1854', '372925', '山东省', '荷泽市', '单县', '山东省 单县 ');
INSERT INTO  s_area_code  VALUES ('1855', '372926', '山东省', '荷泽市', '巨野县', '山东省 巨野县 ');
INSERT INTO  s_area_code  VALUES ('1856', '372928', '山东省', '荷泽市', '郓城县', '山东省 郓城县 ');
INSERT INTO  s_area_code  VALUES ('1857', '372929', '山东省', '荷泽市', '鄄城县', '山东省 鄄城县 ');
INSERT INTO  s_area_code  VALUES ('1858', '372930', '山东省', '荷泽市', '东明县 ', '山东省 东明县 ');
INSERT INTO  s_area_code  VALUES ('1859', '410000', '河南省', '', '', '河南省');
INSERT INTO  s_area_code  VALUES ('1860', '410100', '河南省', '郑州市', '', '河南省郑州市');
INSERT INTO  s_area_code  VALUES ('1861', '410101', '河南省', '郑州市', '市辖区', '河南省郑州市市辖区');
INSERT INTO  s_area_code  VALUES ('1862', '410102', '河南省', '郑州市', '中原区', '河南省郑州市中原区');
INSERT INTO  s_area_code  VALUES ('1863', '410103', '河南省', '郑州市', '二七区', '河南省郑州市二七区');
INSERT INTO  s_area_code  VALUES ('1864', '410104', '河南省', '郑州市', '管城回族区', '河南省郑州市管城回族区');
INSERT INTO  s_area_code  VALUES ('1865', '410105', '河南省', '郑州市', '金水区', '河南省郑州市金水区');
INSERT INTO  s_area_code  VALUES ('1866', '410106', '河南省', '郑州市', '上街区', '河南省郑州市上街区');
INSERT INTO  s_area_code  VALUES ('1867', '410108', '河南省', '郑州市', '惠济区', '河南省郑州市惠济区');
INSERT INTO  s_area_code  VALUES ('1868', '410122', '河南省', '郑州市', '中牟县', '河南省中牟县');
INSERT INTO  s_area_code  VALUES ('1869', '410181', '河南省', '郑州市', '巩义市', '河南省巩义市');
INSERT INTO  s_area_code  VALUES ('1870', '410182', '河南省', '郑州市', '荥阳市', '河南省荥阳市');
INSERT INTO  s_area_code  VALUES ('1871', '410183', '河南省', '郑州市', '新密市', '河南省新密市');
INSERT INTO  s_area_code  VALUES ('1872', '410184', '河南省', '郑州市', '新郑市', '河南省新郑市');
INSERT INTO  s_area_code  VALUES ('1873', '410185', '河南省', '郑州市', '登封市', '河南省登封市');
INSERT INTO  s_area_code  VALUES ('1874', '410200', '河南省', '开封市', '', '河南省开封市');
INSERT INTO  s_area_code  VALUES ('1875', '410201', '河南省', '开封市', '市辖区', '河南省开封市市辖区');
INSERT INTO  s_area_code  VALUES ('1876', '410202', '河南省', '开封市', '龙亭区', '河南省开封市龙亭区');
INSERT INTO  s_area_code  VALUES ('1877', '410203', '河南省', '开封市', '顺河回族区', '河南省开封市顺河回族区');
INSERT INTO  s_area_code  VALUES ('1878', '410204', '河南省', '开封市', '鼓楼区', '河南省开封市鼓楼区');
INSERT INTO  s_area_code  VALUES ('1879', '410205', '河南省', '开封市', '禹王台区', '河南省开封市禹王台区');
INSERT INTO  s_area_code  VALUES ('1880', '410211', '河南省', '开封市', '金明区', '河南省开封市金明区');
INSERT INTO  s_area_code  VALUES ('1881', '410221', '河南省', '开封市', '杞 县', '河南省杞 县');
INSERT INTO  s_area_code  VALUES ('1882', '410222', '河南省', '开封市', '通许县', '河南省通许县');
INSERT INTO  s_area_code  VALUES ('1883', '410223', '河南省', '开封市', '尉氏县', '河南省尉氏县');
INSERT INTO  s_area_code  VALUES ('1884', '410224', '河南省', '开封市', '开封县', '河南省开封县');
INSERT INTO  s_area_code  VALUES ('1885', '410225', '河南省', '开封市', '兰考县', '河南省兰考县');
INSERT INTO  s_area_code  VALUES ('1886', '410300', '河南省', '洛阳市', '', '河南省洛阳市');
INSERT INTO  s_area_code  VALUES ('1887', '410301', '河南省', '洛阳市', '市辖区', '河南省洛阳市市辖区');
INSERT INTO  s_area_code  VALUES ('1888', '410302', '河南省', '洛阳市', '老城区', '河南省洛阳市老城区');
INSERT INTO  s_area_code  VALUES ('1889', '410303', '河南省', '洛阳市', '西工区', '河南省洛阳市西工区');
INSERT INTO  s_area_code  VALUES ('1890', '410304', '河南省', '洛阳市', '廛河回族区', '河南省洛阳市廛河回族区');
INSERT INTO  s_area_code  VALUES ('1891', '410305', '河南省', '洛阳市', '涧西区', '河南省洛阳市涧西区');
INSERT INTO  s_area_code  VALUES ('1892', '410306', '河南省', '洛阳市', '吉利区', '河南省洛阳市吉利区');
INSERT INTO  s_area_code  VALUES ('1893', '410307', '河南省', '洛阳市', '洛龙区', '河南省洛阳市洛龙区');
INSERT INTO  s_area_code  VALUES ('1894', '410322', '河南省', '洛阳市', '孟津县', '河南省孟津县');
INSERT INTO  s_area_code  VALUES ('1895', '410323', '河南省', '洛阳市', '新安县', '河南省新安县');
INSERT INTO  s_area_code  VALUES ('1896', '410324', '河南省', '洛阳市', '栾川县', '河南省栾川县');
INSERT INTO  s_area_code  VALUES ('1897', '410325', '河南省', '洛阳市', '嵩 县', '河南省嵩 县');
INSERT INTO  s_area_code  VALUES ('1898', '410326', '河南省', '洛阳市', '汝阳县', '河南省汝阳县');
INSERT INTO  s_area_code  VALUES ('1899', '410327', '河南省', '洛阳市', '宜阳县', '河南省宜阳县');
INSERT INTO  s_area_code  VALUES ('1900', '410328', '河南省', '洛阳市', '洛宁县', '河南省洛宁县');
INSERT INTO  s_area_code  VALUES ('1901', '410329', '河南省', '洛阳市', '伊川县', '河南省伊川县');
INSERT INTO  s_area_code  VALUES ('1902', '410381', '河南省', '洛阳市', '偃师市', '河南省偃师市');
INSERT INTO  s_area_code  VALUES ('1903', '410400', '河南省', '平顶山市', '', '河南省平顶山市');
INSERT INTO  s_area_code  VALUES ('1904', '410401', '河南省', '平顶山市', '市辖区', '河南省平顶山市市辖区');
INSERT INTO  s_area_code  VALUES ('1905', '410402', '河南省', '平顶山市', '新华区', '河南省平顶山市新华区');
INSERT INTO  s_area_code  VALUES ('1906', '410403', '河南省', '平顶山市', '卫东区', '河南省平顶山市卫东区');
INSERT INTO  s_area_code  VALUES ('1907', '410404', '河南省', '平顶山市', '石龙区', '河南省平顶山市石龙区');
INSERT INTO  s_area_code  VALUES ('1908', '410411', '河南省', '平顶山市', '湛河区', '河南省平顶山市湛河区');
INSERT INTO  s_area_code  VALUES ('1909', '410421', '河南省', '平顶山市', '宝丰县', '河南省宝丰县');
INSERT INTO  s_area_code  VALUES ('1910', '410422', '河南省', '平顶山市', '叶 县', '河南省叶 县');
INSERT INTO  s_area_code  VALUES ('1911', '410423', '河南省', '平顶山市', '鲁山县', '河南省鲁山县');
INSERT INTO  s_area_code  VALUES ('1912', '410425', '河南省', '平顶山市', '郏 县', '河南省郏 县');
INSERT INTO  s_area_code  VALUES ('1913', '410481', '河南省', '平顶山市', '舞钢市', '河南省舞钢市');
INSERT INTO  s_area_code  VALUES ('1914', '410482', '河南省', '平顶山市', '汝州市', '河南省汝州市');
INSERT INTO  s_area_code  VALUES ('1915', '410500', '河南省', '安阳市', '', '河南省安阳市');
INSERT INTO  s_area_code  VALUES ('1916', '410501', '河南省', '安阳市', '市辖区', '河南省安阳市市辖区');
INSERT INTO  s_area_code  VALUES ('1917', '410502', '河南省', '安阳市', '文峰区', '河南省安阳市文峰区');
INSERT INTO  s_area_code  VALUES ('1918', '410503', '河南省', '安阳市', '北关区', '河南省安阳市北关区');
INSERT INTO  s_area_code  VALUES ('1919', '410505', '河南省', '安阳市', '殷都区', '河南省安阳市殷都区');
INSERT INTO  s_area_code  VALUES ('1920', '410506', '河南省', '安阳市', '龙安区', '河南省安阳市龙安区');
INSERT INTO  s_area_code  VALUES ('1921', '410522', '河南省', '安阳市', '安阳县', '河南省安阳县');
INSERT INTO  s_area_code  VALUES ('1922', '410523', '河南省', '安阳市', '汤阴县', '河南省汤阴县');
INSERT INTO  s_area_code  VALUES ('1923', '410526', '河南省', '安阳市', '滑 县', '河南省滑 县');
INSERT INTO  s_area_code  VALUES ('1924', '410527', '河南省', '安阳市', '内黄县', '河南省内黄县');
INSERT INTO  s_area_code  VALUES ('1925', '410581', '河南省', '安阳市', '林州市', '河南省林州市');
INSERT INTO  s_area_code  VALUES ('1926', '410600', '河南省', '鹤壁市', '', '河南省鹤壁市');
INSERT INTO  s_area_code  VALUES ('1927', '410601', '河南省', '鹤壁市', '市辖区', '河南省鹤壁市市辖区');
INSERT INTO  s_area_code  VALUES ('1928', '410602', '河南省', '鹤壁市', '鹤山区', '河南省鹤壁市鹤山区');
INSERT INTO  s_area_code  VALUES ('1929', '410603', '河南省', '鹤壁市', '山城区', '河南省鹤壁市山城区');
INSERT INTO  s_area_code  VALUES ('1930', '410611', '河南省', '鹤壁市', '淇滨区', '河南省鹤壁市淇滨区');
INSERT INTO  s_area_code  VALUES ('1931', '410621', '河南省', '鹤壁市', '浚 县', '河南省浚 县');
INSERT INTO  s_area_code  VALUES ('1932', '410622', '河南省', '鹤壁市', '淇 县', '河南省淇 县');
INSERT INTO  s_area_code  VALUES ('1933', '410700', '河南省', '新乡市', '', '河南省新乡市');
INSERT INTO  s_area_code  VALUES ('1934', '410701', '河南省', '新乡市', '市辖区', '河南省新乡市市辖区');
INSERT INTO  s_area_code  VALUES ('1935', '410702', '河南省', '新乡市', '红旗区', '河南省新乡市红旗区');
INSERT INTO  s_area_code  VALUES ('1936', '410703', '河南省', '新乡市', '卫滨区', '河南省新乡市卫滨区');
INSERT INTO  s_area_code  VALUES ('1937', '410704', '河南省', '新乡市', '凤泉区', '河南省新乡市凤泉区');
INSERT INTO  s_area_code  VALUES ('1938', '410711', '河南省', '新乡市', '牧野区', '河南省新乡市牧野区');
INSERT INTO  s_area_code  VALUES ('1939', '410721', '河南省', '新乡市', '新乡县', '河南省新乡县');
INSERT INTO  s_area_code  VALUES ('1940', '410724', '河南省', '新乡市', '获嘉县', '河南省获嘉县');
INSERT INTO  s_area_code  VALUES ('1941', '410725', '河南省', '新乡市', '原阳县', '河南省原阳县');
INSERT INTO  s_area_code  VALUES ('1942', '410726', '河南省', '新乡市', '延津县', '河南省延津县');
INSERT INTO  s_area_code  VALUES ('1943', '410727', '河南省', '新乡市', '封丘县', '河南省封丘县');
INSERT INTO  s_area_code  VALUES ('1944', '410728', '河南省', '新乡市', '长垣县', '河南省长垣县');
INSERT INTO  s_area_code  VALUES ('1945', '410781', '河南省', '新乡市', '卫辉市', '河南省卫辉市');
INSERT INTO  s_area_code  VALUES ('1946', '410782', '河南省', '新乡市', '辉县市', '河南省辉县市');
INSERT INTO  s_area_code  VALUES ('1947', '410800', '河南省', '焦作市', '', '河南省焦作市');
INSERT INTO  s_area_code  VALUES ('1948', '410801', '河南省', '焦作市', '市辖区', '河南省焦作市市辖区');
INSERT INTO  s_area_code  VALUES ('1949', '410802', '河南省', '焦作市', '解放区', '河南省焦作市解放区');
INSERT INTO  s_area_code  VALUES ('1950', '410803', '河南省', '焦作市', '中站区', '河南省焦作市中站区');
INSERT INTO  s_area_code  VALUES ('1951', '410804', '河南省', '焦作市', '马村区', '河南省焦作市马村区');
INSERT INTO  s_area_code  VALUES ('1952', '410811', '河南省', '焦作市', '山阳区', '河南省焦作市山阳区');
INSERT INTO  s_area_code  VALUES ('1953', '410821', '河南省', '焦作市', '修武县', '河南省修武县');
INSERT INTO  s_area_code  VALUES ('1954', '410822', '河南省', '焦作市', '博爱县', '河南省博爱县');
INSERT INTO  s_area_code  VALUES ('1955', '410823', '河南省', '焦作市', '武陟县', '河南省武陟县');
INSERT INTO  s_area_code  VALUES ('1956', '410825', '河南省', '焦作市', '温 县', '河南省温 县');
INSERT INTO  s_area_code  VALUES ('1957', '410881', '河南省', '焦作市', '济源市', '河南省济源市');
INSERT INTO  s_area_code  VALUES ('1958', '410882', '河南省', '焦作市', '沁阳市', '河南省沁阳市');
INSERT INTO  s_area_code  VALUES ('1959', '410883', '河南省', '焦作市', '孟州市', '河南省孟州市');
INSERT INTO  s_area_code  VALUES ('1960', '410900', '河南省', '濮阳市', '', '河南省濮阳市');
INSERT INTO  s_area_code  VALUES ('1961', '410901', '河南省', '濮阳市', '市辖区', '河南省濮阳市市辖区');
INSERT INTO  s_area_code  VALUES ('1962', '410902', '河南省', '濮阳市', '华龙区', '河南省濮阳市华龙区');
INSERT INTO  s_area_code  VALUES ('1963', '410922', '河南省', '濮阳市', '清丰县', '河南省清丰县');
INSERT INTO  s_area_code  VALUES ('1964', '410923', '河南省', '濮阳市', '南乐县', '河南省南乐县');
INSERT INTO  s_area_code  VALUES ('1965', '410926', '河南省', '濮阳市', '范 县', '河南省范 县');
INSERT INTO  s_area_code  VALUES ('1966', '410927', '河南省', '濮阳市', '台前县', '河南省台前县');
INSERT INTO  s_area_code  VALUES ('1967', '410928', '河南省', '濮阳市', '濮阳县', '河南省濮阳县');
INSERT INTO  s_area_code  VALUES ('1968', '411000', '河南省', '许昌市', '', '河南省许昌市');
INSERT INTO  s_area_code  VALUES ('1969', '411001', '河南省', '许昌市', '市辖区', '河南省许昌市市辖区');
INSERT INTO  s_area_code  VALUES ('1970', '411002', '河南省', '许昌市', '魏都区', '河南省许昌市魏都区');
INSERT INTO  s_area_code  VALUES ('1971', '411023', '河南省', '许昌市', '许昌县', '河南省许昌县');
INSERT INTO  s_area_code  VALUES ('1972', '411024', '河南省', '许昌市', '鄢陵县', '河南省鄢陵县');
INSERT INTO  s_area_code  VALUES ('1973', '411025', '河南省', '许昌市', '襄城县', '河南省襄城县');
INSERT INTO  s_area_code  VALUES ('1974', '411081', '河南省', '许昌市', '禹州市', '河南省禹州市');
INSERT INTO  s_area_code  VALUES ('1975', '411082', '河南省', '许昌市', '长葛市', '河南省长葛市');
INSERT INTO  s_area_code  VALUES ('1976', '411100', '河南省', '漯河市', '', '河南省漯河市');
INSERT INTO  s_area_code  VALUES ('1977', '411101', '河南省', '漯河市', '市辖区', '河南省漯河市市辖区');
INSERT INTO  s_area_code  VALUES ('1978', '411102', '河南省', '漯河市', '源汇区', '河南省漯河市源汇区');
INSERT INTO  s_area_code  VALUES ('1979', '411103', '河南省', '漯河市', '郾城区', '河南省漯河市郾城区');
INSERT INTO  s_area_code  VALUES ('1980', '411104', '河南省', '漯河市', '召陵区', '河南省漯河市召陵区');
INSERT INTO  s_area_code  VALUES ('1981', '411121', '河南省', '漯河市', '舞阳县', '河南省舞阳县');
INSERT INTO  s_area_code  VALUES ('1982', '411122', '河南省', '漯河市', '临颍县', '河南省临颍县');
INSERT INTO  s_area_code  VALUES ('1983', '411123', '河南省', '漯河市', '郾城县', '河南省郾城县');
INSERT INTO  s_area_code  VALUES ('1984', '411200', '河南省', '三门峡市', '', '河南省三门峡市');
INSERT INTO  s_area_code  VALUES ('1985', '411201', '河南省', '三门峡市', '市辖区', '河南省三门峡市市辖区');
INSERT INTO  s_area_code  VALUES ('1986', '411202', '河南省', '三门峡市', '湖滨区', '河南省三门峡市湖滨区');
INSERT INTO  s_area_code  VALUES ('1987', '411221', '河南省', '三门峡市', '渑池县', '河南省三门峡市渑池县');
INSERT INTO  s_area_code  VALUES ('1988', '411222', '河南省', '三门峡市', '陕 县', '河南省陕 县');
INSERT INTO  s_area_code  VALUES ('1989', '411224', '河南省', '三门峡市', '卢氏县', '河南省卢氏县');
INSERT INTO  s_area_code  VALUES ('1990', '411281', '河南省', '三门峡市', '义马市', '河南省义马市');
INSERT INTO  s_area_code  VALUES ('1991', '411282', '河南省', '三门峡市', '灵宝市', '河南省灵宝市');
INSERT INTO  s_area_code  VALUES ('1992', '411300', '河南省', '南阳市', '', '河南省南阳市');
INSERT INTO  s_area_code  VALUES ('1993', '411301', '河南省', '南阳市', '市辖区', '河南省南阳市市辖区');
INSERT INTO  s_area_code  VALUES ('1994', '411302', '河南省', '南阳市', '宛城区', '河南省南阳市宛城区');
INSERT INTO  s_area_code  VALUES ('1995', '411303', '河南省', '南阳市', '卧龙区', '河南省南阳市卧龙区');
INSERT INTO  s_area_code  VALUES ('1996', '411321', '河南省', '南阳市', '南召县', '河南省南召县');
INSERT INTO  s_area_code  VALUES ('1997', '411322', '河南省', '南阳市', '方城县', '河南省方城县');
INSERT INTO  s_area_code  VALUES ('1998', '411323', '河南省', '南阳市', '西峡县', '河南省西峡县');
INSERT INTO  s_area_code  VALUES ('1999', '411324', '河南省', '南阳市', '镇平县', '河南省镇平县');
INSERT INTO  s_area_code  VALUES ('2000', '411325', '河南省', '南阳市', '内乡县', '河南省内乡县');
INSERT INTO  s_area_code  VALUES ('2001', '411326', '河南省', '南阳市', '淅川县', '河南省淅川县');
INSERT INTO  s_area_code  VALUES ('2002', '411327', '河南省', '南阳市', '社旗县', '河南省社旗县');
INSERT INTO  s_area_code  VALUES ('2003', '411328', '河南省', '南阳市', '唐河县', '河南省唐河县');
INSERT INTO  s_area_code  VALUES ('2004', '411329', '河南省', '南阳市', '新野县', '河南省新野县');
INSERT INTO  s_area_code  VALUES ('2005', '411330', '河南省', '南阳市', '桐柏县', '河南省桐柏县');
INSERT INTO  s_area_code  VALUES ('2006', '411381', '河南省', '南阳市', '邓州市', '河南省邓州市');
INSERT INTO  s_area_code  VALUES ('2007', '411400', '河南省', '商丘市', '', '河南省商丘市');
INSERT INTO  s_area_code  VALUES ('2008', '411401', '河南省', '商丘市', '市辖区', '河南省商丘市市辖区');
INSERT INTO  s_area_code  VALUES ('2009', '411402', '河南省', '商丘市', '梁园区', '河南省商丘市梁园区');
INSERT INTO  s_area_code  VALUES ('2010', '411403', '河南省', '商丘市', '睢阳区', '河南省商丘市睢阳区');
INSERT INTO  s_area_code  VALUES ('2011', '411421', '河南省', '商丘市', '民权县', '河南省民权县');
INSERT INTO  s_area_code  VALUES ('2012', '411422', '河南省', '商丘市', '睢 县', '河南省睢 县');
INSERT INTO  s_area_code  VALUES ('2013', '411423', '河南省', '商丘市', '宁陵县', '河南省宁陵县');
INSERT INTO  s_area_code  VALUES ('2014', '411424', '河南省', '商丘市', '柘城县', '河南省柘城县');
INSERT INTO  s_area_code  VALUES ('2015', '411425', '河南省', '商丘市', '虞城县', '河南省虞城县');
INSERT INTO  s_area_code  VALUES ('2016', '411426', '河南省', '商丘市', '夏邑县', '河南省夏邑县');
INSERT INTO  s_area_code  VALUES ('2017', '411481', '河南省', '商丘市', '永城市', '河南省永城市');
INSERT INTO  s_area_code  VALUES ('2018', '411500', '河南省', '信阳市', '', '河南省信阳市');
INSERT INTO  s_area_code  VALUES ('2019', '411501', '河南省', '信阳市', '市辖区', '河南省信阳市市辖区');
INSERT INTO  s_area_code  VALUES ('2020', '411502', '河南省', '信阳市', '浉河区', '河南省信阳市浉河区');
INSERT INTO  s_area_code  VALUES ('2021', '411503', '河南省', '信阳市', '平桥区', '河南省信阳市平桥区');
INSERT INTO  s_area_code  VALUES ('2022', '411521', '河南省', '信阳市', '罗山县', '河南省罗山县');
INSERT INTO  s_area_code  VALUES ('2023', '411522', '河南省', '信阳市', '光山县', '河南省光山县');
INSERT INTO  s_area_code  VALUES ('2024', '411523', '河南省', '信阳市', '新 县', '河南省新 县');
INSERT INTO  s_area_code  VALUES ('2025', '411524', '河南省', '信阳市', '商城县', '河南省商城县');
INSERT INTO  s_area_code  VALUES ('2026', '411525', '河南省', '信阳市', '固始县', '河南省固始县');
INSERT INTO  s_area_code  VALUES ('2027', '411526', '河南省', '信阳市', '潢川县', '河南省潢川县');
INSERT INTO  s_area_code  VALUES ('2028', '411527', '河南省', '信阳市', '淮滨县', '河南省淮滨县');
INSERT INTO  s_area_code  VALUES ('2029', '411528', '河南省', '信阳市', '息 县', '河南省息 县');
INSERT INTO  s_area_code  VALUES ('2030', '411600', '河南省', '周口市', '', '河南省周口市');
INSERT INTO  s_area_code  VALUES ('2031', '411601', '河南省', '周口市', '市辖区', '河南省周口市市辖区');
INSERT INTO  s_area_code  VALUES ('2032', '411602', '河南省', '周口市', '川汇区', '河南省周口市川汇区');
INSERT INTO  s_area_code  VALUES ('2033', '411621', '河南省', '周口市', '扶沟县', '河南省扶沟县');
INSERT INTO  s_area_code  VALUES ('2034', '411622', '河南省', '周口市', '西华县', '河南省西华县');
INSERT INTO  s_area_code  VALUES ('2035', '411623', '河南省', '周口市', '商水县', '河南省商水县');
INSERT INTO  s_area_code  VALUES ('2036', '411624', '河南省', '周口市', '沈丘县', '河南省沈丘县');
INSERT INTO  s_area_code  VALUES ('2037', '411625', '河南省', '周口市', '郸城县', '河南省郸城县');
INSERT INTO  s_area_code  VALUES ('2038', '411626', '河南省', '周口市', '淮阳县', '河南省淮阳县');
INSERT INTO  s_area_code  VALUES ('2039', '411627', '河南省', '周口市', '太康县', '河南省太康县');
INSERT INTO  s_area_code  VALUES ('2040', '411628', '河南省', '周口市', '鹿邑县', '河南省鹿邑县');
INSERT INTO  s_area_code  VALUES ('2041', '411681', '河南省', '周口市', '项城市', '河南省项城市');
INSERT INTO  s_area_code  VALUES ('2042', '411700', '河南省', '驻马店市', '', '河南省驻马店市');
INSERT INTO  s_area_code  VALUES ('2043', '411701', '河南省', '驻马店市', '市辖区', '河南省驻马店市市辖区');
INSERT INTO  s_area_code  VALUES ('2044', '411702', '河南省', '驻马店市', '驿城区', '河南省驻马店市驿城区');
INSERT INTO  s_area_code  VALUES ('2045', '411721', '河南省', '驻马店市', '西平县', '河南省西平县');
INSERT INTO  s_area_code  VALUES ('2046', '411722', '河南省', '驻马店市', '上蔡县', '河南省上蔡县');
INSERT INTO  s_area_code  VALUES ('2047', '411723', '河南省', '驻马店市', '平舆县', '河南省平舆县');
INSERT INTO  s_area_code  VALUES ('2048', '411724', '河南省', '驻马店市', '正阳县', '河南省正阳县');
INSERT INTO  s_area_code  VALUES ('2049', '411725', '河南省', '驻马店市', '确山县', '河南省确山县');
INSERT INTO  s_area_code  VALUES ('2050', '411726', '河南省', '驻马店市', '泌阳县', '河南省泌阳县');
INSERT INTO  s_area_code  VALUES ('2051', '411727', '河南省', '驻马店市', '汝南县', '河南省汝南县');
INSERT INTO  s_area_code  VALUES ('2052', '411728', '河南省', '驻马店市', '遂平县', '河南省遂平县');
INSERT INTO  s_area_code  VALUES ('2053', '411729', '河南省', '驻马店市', '新蔡县', '河南省新蔡县');
INSERT INTO  s_area_code  VALUES ('2054', '412700', '河南省', '周口市', '周口地区', '河南省周口地区');
INSERT INTO  s_area_code  VALUES ('2055', '412701', '河南省', '周口市', '周口市', '河南省周口市');
INSERT INTO  s_area_code  VALUES ('2056', '412702', '河南省', '周口市', '项城市', '河南省项城市');
INSERT INTO  s_area_code  VALUES ('2057', '412721', '河南省', '周口市', '扶沟县', '河南省扶沟县');
INSERT INTO  s_area_code  VALUES ('2058', '412722', '河南省', '周口市', '西华县', '河南省西华县');
INSERT INTO  s_area_code  VALUES ('2059', '412723', '河南省', '周口市', '商水县', '河南省商水县');
INSERT INTO  s_area_code  VALUES ('2060', '412724', '河南省', '周口市', '太康县', '河南省太康县');
INSERT INTO  s_area_code  VALUES ('2061', '412725', '河南省', '周口市', '鹿邑县', '河南省鹿邑县');
INSERT INTO  s_area_code  VALUES ('2062', '412726', '河南省', '周口市', '郸城县', '河南省郸城县');
INSERT INTO  s_area_code  VALUES ('2063', '412727', '河南省', '周口市', '淮阳县', '河南省淮阳县');
INSERT INTO  s_area_code  VALUES ('2064', '412728', '河南省', '周口市', '沈丘县', '河南省沈丘县');
INSERT INTO  s_area_code  VALUES ('2065', '412800', '河南省', '驻马店市', '驻马店地区', '河南省驻马店地区');
INSERT INTO  s_area_code  VALUES ('2066', '412801', '河南省', '驻马店市', '驻马店市', '河南省驻马店市');
INSERT INTO  s_area_code  VALUES ('2067', '412821', '河南省', '驻马店市', '确山县', '河南省确山县');
INSERT INTO  s_area_code  VALUES ('2068', '412822', '河南省', '驻马店市', '泌阳县', '河南省泌阳县');
INSERT INTO  s_area_code  VALUES ('2069', '412823', '河南省', '驻马店市', '遂平县', '河南省遂平县');
INSERT INTO  s_area_code  VALUES ('2070', '412824', '河南省', '驻马店市', '西平县', '河南省西平县');
INSERT INTO  s_area_code  VALUES ('2071', '412825', '河南省', '驻马店市', '上蔡县', '河南省上蔡县');
INSERT INTO  s_area_code  VALUES ('2072', '412826', '河南省', '驻马店市', '汝南县', '河南省汝南县');
INSERT INTO  s_area_code  VALUES ('2073', '412827', '河南省', '驻马店市', '平舆县', '河南省平舆县');
INSERT INTO  s_area_code  VALUES ('2074', '412828', '河南省', '驻马店市', '新蔡县', '河南省新蔡县');
INSERT INTO  s_area_code  VALUES ('2075', '412829', '河南省', '驻马店市', '正阳县', '河南省正阳县');
INSERT INTO  s_area_code  VALUES ('2076', '420000', '湖北省', '', '', '湖北省');
INSERT INTO  s_area_code  VALUES ('2077', '420100', '湖北省', '武汉市', '', '湖北省武汉市');
INSERT INTO  s_area_code  VALUES ('2078', '420101', '湖北省', '武汉市', '市辖区', '湖北省武汉市市辖区');
INSERT INTO  s_area_code  VALUES ('2079', '420102', '湖北省', '武汉市', '江岸区', '湖北省武汉市江岸区');
INSERT INTO  s_area_code  VALUES ('2080', '420103', '湖北省', '武汉市', '江汉区', '湖北省武汉市江汉区');
INSERT INTO  s_area_code  VALUES ('2081', '420104', '湖北省', '武汉市', '硚口区', '湖北省武汉市硚口区');
INSERT INTO  s_area_code  VALUES ('2082', '420105', '湖北省', '武汉市', '汉阳区', '湖北省武汉市汉阳区');
INSERT INTO  s_area_code  VALUES ('2083', '420106', '湖北省', '武汉市', '武昌区', '湖北省武汉市武昌区');
INSERT INTO  s_area_code  VALUES ('2084', '420107', '湖北省', '武汉市', '青山区', '湖北省武汉市青山区');
INSERT INTO  s_area_code  VALUES ('2085', '420111', '湖北省', '武汉市', '洪山区', '湖北省武汉市洪山区');
INSERT INTO  s_area_code  VALUES ('2086', '420112', '湖北省', '武汉市', '东西湖区', '湖北省武汉市东西湖区');
INSERT INTO  s_area_code  VALUES ('2087', '420113', '湖北省', '武汉市', '汉南区', '湖北省武汉市汉南区');
INSERT INTO  s_area_code  VALUES ('2088', '420114', '湖北省', '武汉市', '蔡甸区', '湖北省武汉市蔡甸区');
INSERT INTO  s_area_code  VALUES ('2089', '420115', '湖北省', '武汉市', '江夏区', '湖北省武汉市江夏区');
INSERT INTO  s_area_code  VALUES ('2090', '420116', '湖北省', '武汉市', '黄陂区', '湖北省武汉市黄陂区');
INSERT INTO  s_area_code  VALUES ('2091', '420117', '湖北省', '武汉市', '新洲区', '湖北省武汉市新洲区');
INSERT INTO  s_area_code  VALUES ('2092', '420200', '湖北省', '黄石市', '', '湖北省黄石市');
INSERT INTO  s_area_code  VALUES ('2093', '420201', '湖北省', '黄石市', '市辖区', '湖北省黄石市市辖区');
INSERT INTO  s_area_code  VALUES ('2094', '420202', '湖北省', '黄石市', '黄石港区', '湖北省黄石市黄石港区');
INSERT INTO  s_area_code  VALUES ('2095', '420203', '湖北省', '黄石市', '西塞山区', '湖北省黄石市西塞山区');
INSERT INTO  s_area_code  VALUES ('2096', '420204', '湖北省', '黄石市', '下陆区', '湖北省黄石市下陆区');
INSERT INTO  s_area_code  VALUES ('2097', '420205', '湖北省', '黄石市', '铁山区', '湖北省黄石市铁山区');
INSERT INTO  s_area_code  VALUES ('2098', '420222', '湖北省', '黄石市', '阳新县', '湖北省阳新县');
INSERT INTO  s_area_code  VALUES ('2099', '420281', '湖北省', '黄石市', '大冶市', '湖北省大冶市');
INSERT INTO  s_area_code  VALUES ('2100', '420300', '湖北省', '十堰市', '', '湖北省十堰市');
INSERT INTO  s_area_code  VALUES ('2101', '420301', '湖北省', '十堰市', '市辖区', '湖北省十堰市市辖区');
INSERT INTO  s_area_code  VALUES ('2102', '420302', '湖北省', '十堰市', '茅箭区', '湖北省十堰市茅箭区');
INSERT INTO  s_area_code  VALUES ('2103', '420303', '湖北省', '十堰市', '张湾区', '湖北省十堰市张湾区');
INSERT INTO  s_area_code  VALUES ('2104', '420321', '湖北省', '十堰市', '郧 县', '湖北省郧 县');
INSERT INTO  s_area_code  VALUES ('2105', '420322', '湖北省', '十堰市', '郧西县', '湖北省郧西县');
INSERT INTO  s_area_code  VALUES ('2106', '420323', '湖北省', '十堰市', '竹山县', '湖北省竹山县');
INSERT INTO  s_area_code  VALUES ('2107', '420324', '湖北省', '十堰市', '竹溪县', '湖北省竹溪县');
INSERT INTO  s_area_code  VALUES ('2108', '420325', '湖北省', '十堰市', '房 县', '湖北省房 县');
INSERT INTO  s_area_code  VALUES ('2109', '420381', '湖北省', '十堰市', '丹江口市', '湖北省丹江口市');
INSERT INTO  s_area_code  VALUES ('2110', '420500', '湖北省', '宜昌市', '', '湖北省宜昌市');
INSERT INTO  s_area_code  VALUES ('2111', '420501', '湖北省', '宜昌市', '市辖区', '湖北省宜昌市市辖区');
INSERT INTO  s_area_code  VALUES ('2112', '420502', '湖北省', '宜昌市', '西陵区', '湖北省宜昌市西陵区');
INSERT INTO  s_area_code  VALUES ('2113', '420503', '湖北省', '宜昌市', '伍家岗区', '湖北省宜昌市伍家岗区');
INSERT INTO  s_area_code  VALUES ('2114', '420504', '湖北省', '宜昌市', '点军区', '湖北省宜昌市点军区');
INSERT INTO  s_area_code  VALUES ('2115', '420505', '湖北省', '宜昌市', '猇亭区', '湖北省宜昌市猇亭区');
INSERT INTO  s_area_code  VALUES ('2116', '420506', '湖北省', '宜昌市', '夷陵区', '湖北省宜昌市夷陵区');
INSERT INTO  s_area_code  VALUES ('2117', '420525', '湖北省', '宜昌市', '远安县', '湖北省远安县');
INSERT INTO  s_area_code  VALUES ('2118', '420526', '湖北省', '宜昌市', '兴山县', '湖北省兴山县');
INSERT INTO  s_area_code  VALUES ('2119', '420527', '湖北省', '宜昌市', '秭归县', '湖北省秭归县');
INSERT INTO  s_area_code  VALUES ('2120', '420528', '湖北省', '宜昌市', '长阳土家族自治县', '湖北省长阳土家族自治县');
INSERT INTO  s_area_code  VALUES ('2121', '420529', '湖北省', '宜昌市', '五峰土家族自治县', '湖北省五峰土家族自治县');
INSERT INTO  s_area_code  VALUES ('2122', '420581', '湖北省', '宜昌市', '宜都市', '湖北省宜都市');
INSERT INTO  s_area_code  VALUES ('2123', '420582', '湖北省', '宜昌市', '当阳市', '湖北省当阳市');
INSERT INTO  s_area_code  VALUES ('2124', '420583', '湖北省', '宜昌市', '枝江市', '湖北省枝江市');
INSERT INTO  s_area_code  VALUES ('2125', '420600', '湖北省', '襄樊市', '', '湖北省襄樊市');
INSERT INTO  s_area_code  VALUES ('2126', '420601', '湖北省', '襄樊市', '市辖区', '湖北省襄樊市市辖区');
INSERT INTO  s_area_code  VALUES ('2127', '420602', '湖北省', '襄樊市', '襄城区', '湖北省襄樊市襄城区');
INSERT INTO  s_area_code  VALUES ('2128', '420606', '湖北省', '襄樊市', '樊城区', '湖北省襄樊市樊城区');
INSERT INTO  s_area_code  VALUES ('2129', '420607', '湖北省', '襄樊市', '襄阳区', '湖北省襄樊市襄阳区');
INSERT INTO  s_area_code  VALUES ('2130', '420624', '湖北省', '襄樊市', '南漳县', '湖北省南漳县');
INSERT INTO  s_area_code  VALUES ('2131', '420625', '湖北省', '襄樊市', '谷城县', '湖北省谷城县');
INSERT INTO  s_area_code  VALUES ('2132', '420626', '湖北省', '襄樊市', '保康县', '湖北省保康县');
INSERT INTO  s_area_code  VALUES ('2133', '420682', '湖北省', '襄樊市', '老河口市', '湖北省老河口市');
INSERT INTO  s_area_code  VALUES ('2134', '420683', '湖北省', '襄樊市', '枣阳市', '湖北省枣阳市');
INSERT INTO  s_area_code  VALUES ('2135', '420684', '湖北省', '襄樊市', '宜城市', '湖北省宜城市');
INSERT INTO  s_area_code  VALUES ('2136', '420700', '湖北省', '鄂州市', '', '湖北省鄂州市');
INSERT INTO  s_area_code  VALUES ('2137', '420701', '湖北省', '鄂州市', '市辖区', '湖北省鄂州市市辖区');
INSERT INTO  s_area_code  VALUES ('2138', '420702', '湖北省', '鄂州市', '梁子湖区', '湖北省鄂州市梁子湖区');
INSERT INTO  s_area_code  VALUES ('2139', '420703', '湖北省', '鄂州市', '华容区', '湖北省鄂州市华容区');
INSERT INTO  s_area_code  VALUES ('2140', '420704', '湖北省', '鄂州市', '鄂城区', '湖北省鄂州市鄂城区');
INSERT INTO  s_area_code  VALUES ('2141', '420800', '湖北省', '荆门市', '', '湖北省荆门市');
INSERT INTO  s_area_code  VALUES ('2142', '420801', '湖北省', '荆门市', '市辖区', '湖北省荆门市市辖区');
INSERT INTO  s_area_code  VALUES ('2143', '420802', '湖北省', '荆门市', '东宝区', '湖北省荆门市东宝区');
INSERT INTO  s_area_code  VALUES ('2144', '420804', '湖北省', '荆门市', '掇刀区', '湖北省荆门市掇刀区');
INSERT INTO  s_area_code  VALUES ('2145', '420821', '湖北省', '荆门市', '京山县', '湖北省京山县');
INSERT INTO  s_area_code  VALUES ('2146', '420822', '湖北省', '荆门市', '沙洋县', '湖北省沙洋县');
INSERT INTO  s_area_code  VALUES ('2147', '420881', '湖北省', '荆门市', '钟祥市', '湖北省钟祥市');
INSERT INTO  s_area_code  VALUES ('2148', '420900', '湖北省', '孝感市', '', '湖北省孝感市');
INSERT INTO  s_area_code  VALUES ('2149', '420901', '湖北省', '孝感市', '市辖区', '湖北省孝感市市辖区');
INSERT INTO  s_area_code  VALUES ('2150', '420902', '湖北省', '孝感市', '孝南区', '湖北省孝感市孝南区');
INSERT INTO  s_area_code  VALUES ('2151', '420921', '湖北省', '孝感市', '孝昌县', '湖北省孝昌县');
INSERT INTO  s_area_code  VALUES ('2152', '420922', '湖北省', '孝感市', '大悟县', '湖北省大悟县');
INSERT INTO  s_area_code  VALUES ('2153', '420923', '湖北省', '孝感市', '云梦县', '湖北省云梦县');
INSERT INTO  s_area_code  VALUES ('2154', '420981', '湖北省', '孝感市', '应城市', '湖北省应城市');
INSERT INTO  s_area_code  VALUES ('2155', '420982', '湖北省', '孝感市', '安陆市', '湖北省安陆市');
INSERT INTO  s_area_code  VALUES ('2156', '420983', '湖北省', '孝感市', '孝感广水市', '湖北省孝感广水市 ');
INSERT INTO  s_area_code  VALUES ('2157', '420984', '湖北省', '孝感市', '汉川市', '湖北省汉川市');
INSERT INTO  s_area_code  VALUES ('2158', '421000', '湖北省', '荆州市', '', '湖北省荆州市');
INSERT INTO  s_area_code  VALUES ('2159', '421001', '湖北省', '荆州市', '市辖区', '湖北省荆州市市辖区');
INSERT INTO  s_area_code  VALUES ('2160', '421002', '湖北省', '荆州市', '沙市区', '湖北省荆州市沙市区');
INSERT INTO  s_area_code  VALUES ('2161', '421003', '湖北省', '荆州市', '荆州区', '湖北省荆州市荆州区');
INSERT INTO  s_area_code  VALUES ('2162', '421022', '湖北省', '荆州市', '公安县', '湖北省公安县');
INSERT INTO  s_area_code  VALUES ('2163', '421023', '湖北省', '荆州市', '监利县', '湖北省监利县');
INSERT INTO  s_area_code  VALUES ('2164', '421024', '湖北省', '荆州市', '江陵县', '湖北省江陵县');
INSERT INTO  s_area_code  VALUES ('2165', '421081', '湖北省', '荆州市', '石首市', '湖北省石首市');
INSERT INTO  s_area_code  VALUES ('2166', '421083', '湖北省', '荆州市', '洪湖市', '湖北省洪湖市');
INSERT INTO  s_area_code  VALUES ('2167', '421087', '湖北省', '荆州市', '松滋市', '湖北省松滋市');
INSERT INTO  s_area_code  VALUES ('2168', '421100', '湖北省', '黄冈市', '', '湖北省黄冈市');
INSERT INTO  s_area_code  VALUES ('2169', '421101', '湖北省', '黄冈市', '市辖区', '湖北省黄冈市市辖区');
INSERT INTO  s_area_code  VALUES ('2170', '421102', '湖北省', '黄冈市', '黄州区', '湖北省黄冈市黄州区');
INSERT INTO  s_area_code  VALUES ('2171', '421121', '湖北省', '黄冈市', '团风县', '湖北省团风县');
INSERT INTO  s_area_code  VALUES ('2172', '421122', '湖北省', '黄冈市', '红安县', '湖北省红安县');
INSERT INTO  s_area_code  VALUES ('2173', '421123', '湖北省', '黄冈市', '罗田县', '湖北省罗田县');
INSERT INTO  s_area_code  VALUES ('2174', '421124', '湖北省', '黄冈市', '英山县', '湖北省英山县');
INSERT INTO  s_area_code  VALUES ('2175', '421125', '湖北省', '黄冈市', '浠水县', '湖北省浠水县');
INSERT INTO  s_area_code  VALUES ('2176', '421126', '湖北省', '黄冈市', '蕲春县', '湖北省蕲春县');
INSERT INTO  s_area_code  VALUES ('2177', '421127', '湖北省', '黄冈市', '黄梅县', '湖北省黄梅县');
INSERT INTO  s_area_code  VALUES ('2178', '421181', '湖北省', '黄冈市', '麻城市', '湖北省麻城市');
INSERT INTO  s_area_code  VALUES ('2179', '421182', '湖北省', '黄冈市', '武穴市', '湖北省武穴市');
INSERT INTO  s_area_code  VALUES ('2180', '421200', '湖北省', '咸宁市', '', '湖北省咸宁市');
INSERT INTO  s_area_code  VALUES ('2181', '421201', '湖北省', '咸宁市', '市辖区', '湖北省咸宁市市辖区');
INSERT INTO  s_area_code  VALUES ('2182', '421202', '湖北省', '咸宁市', '咸安区', '湖北省咸宁市咸安区');
INSERT INTO  s_area_code  VALUES ('2183', '421221', '湖北省', '咸宁市', '嘉鱼县', '湖北省嘉鱼县');
INSERT INTO  s_area_code  VALUES ('2184', '421222', '湖北省', '咸宁市', '通城县', '湖北省通城县');
INSERT INTO  s_area_code  VALUES ('2185', '421223', '湖北省', '咸宁市', '崇阳县', '湖北省崇阳县');
INSERT INTO  s_area_code  VALUES ('2186', '421224', '湖北省', '咸宁市', '通山县', '湖北省通山县');
INSERT INTO  s_area_code  VALUES ('2187', '421281', '湖北省', '咸宁市', '赤壁市', '湖北省赤壁市');
INSERT INTO  s_area_code  VALUES ('2188', '421300', '湖北省', '随州市', '', '湖北省随州市');
INSERT INTO  s_area_code  VALUES ('2189', '421301', '湖北省', '随州市', '市辖区', '湖北省随州市市辖区');
INSERT INTO  s_area_code  VALUES ('2190', '421302', '湖北省', '随州市', '曾都区', '湖北省随州市曾都区');
INSERT INTO  s_area_code  VALUES ('2191', '421381', '湖北省', '随州市', '广水市', '湖北省广水市');
INSERT INTO  s_area_code  VALUES ('2192', '422800', '湖北省', '恩施土家族苗族自治州', '', '湖北省恩施土家族苗族自治州');
INSERT INTO  s_area_code  VALUES ('2193', '422801', '湖北省', '恩施土家族苗族自治州', '恩施市', '湖北省恩施市');
INSERT INTO  s_area_code  VALUES ('2194', '422802', '湖北省', '恩施土家族苗族自治州', '利川市', '湖北省利川市');
INSERT INTO  s_area_code  VALUES ('2195', '422822', '湖北省', '恩施土家族苗族自治州', '建始县', '湖北省建始县');
INSERT INTO  s_area_code  VALUES ('2196', '422823', '湖北省', '恩施土家族苗族自治州', '巴东县', '湖北省巴东县');
INSERT INTO  s_area_code  VALUES ('2197', '422825', '湖北省', '恩施土家族苗族自治州', '宣恩县', '湖北省宣恩县');
INSERT INTO  s_area_code  VALUES ('2198', '422826', '湖北省', '恩施土家族苗族自治州', '咸丰县', '湖北省咸丰县');
INSERT INTO  s_area_code  VALUES ('2199', '422827', '湖北省', '恩施土家族苗族自治州', '来凤县', '湖北省来凤县');
INSERT INTO  s_area_code  VALUES ('2200', '422828', '湖北省', '恩施土家族苗族自治州', '鹤峰县', '湖北省鹤峰县');
INSERT INTO  s_area_code  VALUES ('2201', '429000', '湖北省', '省直辖行政单位', '', '湖北省省直辖行政单位');
INSERT INTO  s_area_code  VALUES ('2202', '429001', '湖北省', '省直辖行政单位', '随州市', '湖北省随州市 ');
INSERT INTO  s_area_code  VALUES ('2203', '429004', '湖北省', '省直辖行政单位', '仙桃市', '湖北省仙桃市');
INSERT INTO  s_area_code  VALUES ('2204', '429005', '湖北省', '省直辖行政单位', '潜江市', '湖北省潜江市');
INSERT INTO  s_area_code  VALUES ('2205', '429006', '湖北省', '省直辖行政单位', '天门市', '湖北省天门市');
INSERT INTO  s_area_code  VALUES ('2206', '429021', '湖北省', '省直辖行政单位', '神农架林区', '湖北省神农架林区');
INSERT INTO  s_area_code  VALUES ('2207', '430000', '湖南省', '', '', '湖南省');
INSERT INTO  s_area_code  VALUES ('2208', '430100', '湖南省', '长沙市', '', '湖南省长沙市');
INSERT INTO  s_area_code  VALUES ('2209', '430101', '湖南省', '长沙市', '市辖区', '湖南省长沙市市辖区');
INSERT INTO  s_area_code  VALUES ('2210', '430102', '湖南省', '长沙市', '芙蓉区', '湖南省长沙市芙蓉区');
INSERT INTO  s_area_code  VALUES ('2211', '430103', '湖南省', '长沙市', '天心区', '湖南省长沙市天心区');
INSERT INTO  s_area_code  VALUES ('2212', '430104', '湖南省', '长沙市', '岳麓区', '湖南省长沙市岳麓区');
INSERT INTO  s_area_code  VALUES ('2213', '430105', '湖南省', '长沙市', '开福区', '湖南省长沙市开福区');
INSERT INTO  s_area_code  VALUES ('2214', '430111', '湖南省', '长沙市', '雨花区', '湖南省长沙市雨花区');
INSERT INTO  s_area_code  VALUES ('2215', '430121', '湖南省', '长沙市', '长沙县', '湖南省长沙县');
INSERT INTO  s_area_code  VALUES ('2216', '430122', '湖南省', '长沙市', '望城县', '湖南省望城县');
INSERT INTO  s_area_code  VALUES ('2217', '430124', '湖南省', '长沙市', '宁乡县', '湖南省宁乡县');
INSERT INTO  s_area_code  VALUES ('2218', '430181', '湖南省', '长沙市', '浏阳市', '湖南省浏阳市');
INSERT INTO  s_area_code  VALUES ('2219', '430200', '湖南省', '株洲市', '', '湖南省株洲市');
INSERT INTO  s_area_code  VALUES ('2220', '430201', '湖南省', '株洲市', '市辖区', '湖南省株洲市市辖区');
INSERT INTO  s_area_code  VALUES ('2221', '430202', '湖南省', '株洲市', '荷塘区', '湖南省株洲市荷塘区');
INSERT INTO  s_area_code  VALUES ('2222', '430203', '湖南省', '株洲市', '芦淞区', '湖南省株洲市芦淞区');
INSERT INTO  s_area_code  VALUES ('2223', '430204', '湖南省', '株洲市', '石峰区', '湖南省株洲市石峰区');
INSERT INTO  s_area_code  VALUES ('2224', '430211', '湖南省', '株洲市', '天元区', '湖南省株洲市天元区');
INSERT INTO  s_area_code  VALUES ('2225', '430221', '湖南省', '株洲市', '株洲县', '湖南省株洲县');
INSERT INTO  s_area_code  VALUES ('2226', '430223', '湖南省', '株洲市', '攸 县', '湖南省攸 县');
INSERT INTO  s_area_code  VALUES ('2227', '430224', '湖南省', '株洲市', '茶陵县', '湖南省茶陵县');
INSERT INTO  s_area_code  VALUES ('2228', '430225', '湖南省', '株洲市', '炎陵县', '湖南省炎陵县');
INSERT INTO  s_area_code  VALUES ('2229', '430281', '湖南省', '株洲市', '醴陵市', '湖南省醴陵市');
INSERT INTO  s_area_code  VALUES ('2230', '430300', '湖南省', '湘潭市', '', '湖南省湘潭市');
INSERT INTO  s_area_code  VALUES ('2231', '430301', '湖南省', '湘潭市', '市辖区', '湖南省湘潭市市辖区');
INSERT INTO  s_area_code  VALUES ('2232', '430302', '湖南省', '湘潭市', '雨湖区', '湖南省湘潭市雨湖区');
INSERT INTO  s_area_code  VALUES ('2233', '430304', '湖南省', '湘潭市', '岳塘区', '湖南省湘潭市岳塘区');
INSERT INTO  s_area_code  VALUES ('2234', '430321', '湖南省', '湘潭市', '湘潭县', '湖南省湘潭县');
INSERT INTO  s_area_code  VALUES ('2235', '430381', '湖南省', '湘潭市', '湘乡市', '湖南省湘乡市');
INSERT INTO  s_area_code  VALUES ('2236', '430382', '湖南省', '湘潭市', '韶山市', '湖南省韶山市');
INSERT INTO  s_area_code  VALUES ('2237', '430400', '湖南省', '衡阳市', '', '湖南省衡阳市');
INSERT INTO  s_area_code  VALUES ('2238', '430401', '湖南省', '衡阳市', '市辖区', '湖南省衡阳市市辖区');
INSERT INTO  s_area_code  VALUES ('2239', '430405', '湖南省', '衡阳市', '珠晖区', '湖南省衡阳市珠晖区');
INSERT INTO  s_area_code  VALUES ('2240', '430406', '湖南省', '衡阳市', '雁峰区', '湖南省衡阳市雁峰区');
INSERT INTO  s_area_code  VALUES ('2241', '430407', '湖南省', '衡阳市', '石鼓区', '湖南省衡阳市石鼓区');
INSERT INTO  s_area_code  VALUES ('2242', '430408', '湖南省', '衡阳市', '蒸湘区', '湖南省衡阳市蒸湘区');
INSERT INTO  s_area_code  VALUES ('2243', '430412', '湖南省', '衡阳市', '南岳区', '湖南省衡阳市南岳区');
INSERT INTO  s_area_code  VALUES ('2244', '430421', '湖南省', '衡阳市', '衡阳县', '湖南省衡阳县');
INSERT INTO  s_area_code  VALUES ('2245', '430422', '湖南省', '衡阳市', '衡南县', '湖南省衡南县');
INSERT INTO  s_area_code  VALUES ('2246', '430423', '湖南省', '衡阳市', '衡山县', '湖南省衡山县');
INSERT INTO  s_area_code  VALUES ('2247', '430424', '湖南省', '衡阳市', '衡东县', '湖南省衡东县');
INSERT INTO  s_area_code  VALUES ('2248', '430426', '湖南省', '衡阳市', '祁东县', '湖南省祁东县');
INSERT INTO  s_area_code  VALUES ('2249', '430481', '湖南省', '衡阳市', '耒阳市', '湖南省耒阳市');
INSERT INTO  s_area_code  VALUES ('2250', '430482', '湖南省', '衡阳市', '常宁市', '湖南省常宁市');
INSERT INTO  s_area_code  VALUES ('2251', '430500', '湖南省', '邵阳市', '', '湖南省邵阳市');
INSERT INTO  s_area_code  VALUES ('2252', '430501', '湖南省', '邵阳市', '市辖区', '湖南省邵阳市市辖区');
INSERT INTO  s_area_code  VALUES ('2253', '430502', '湖南省', '邵阳市', '双清区', '湖南省邵阳市双清区');
INSERT INTO  s_area_code  VALUES ('2254', '430503', '湖南省', '邵阳市', '大祥区', '湖南省邵阳市大祥区');
INSERT INTO  s_area_code  VALUES ('2255', '430511', '湖南省', '邵阳市', '北塔区', '湖南省邵阳市北塔区');
INSERT INTO  s_area_code  VALUES ('2256', '430521', '湖南省', '邵阳市', '邵东县', '湖南省邵东县');
INSERT INTO  s_area_code  VALUES ('2257', '430522', '湖南省', '邵阳市', '新邵县', '湖南省新邵县');
INSERT INTO  s_area_code  VALUES ('2258', '430523', '湖南省', '邵阳市', '邵阳县', '湖南省邵阳县');
INSERT INTO  s_area_code  VALUES ('2259', '430524', '湖南省', '邵阳市', '隆回县', '湖南省隆回县');
INSERT INTO  s_area_code  VALUES ('2260', '430525', '湖南省', '邵阳市', '洞口县', '湖南省洞口县');
INSERT INTO  s_area_code  VALUES ('2261', '430527', '湖南省', '邵阳市', '绥宁县', '湖南省绥宁县');
INSERT INTO  s_area_code  VALUES ('2262', '430528', '湖南省', '邵阳市', '新宁县', '湖南省新宁县');
INSERT INTO  s_area_code  VALUES ('2263', '430529', '湖南省', '邵阳市', '城步苗族自治县', '湖南省城步苗族自治县');
INSERT INTO  s_area_code  VALUES ('2264', '430581', '湖南省', '邵阳市', '武冈市', '湖南省武冈市');
INSERT INTO  s_area_code  VALUES ('2265', '430600', '湖南省', '岳阳市', '', '湖南省岳阳市');
INSERT INTO  s_area_code  VALUES ('2266', '430601', '湖南省', '岳阳市', '市辖区', '湖南省岳阳市市辖区');
INSERT INTO  s_area_code  VALUES ('2267', '430602', '湖南省', '岳阳市', '岳阳楼区', '湖南省岳阳市岳阳楼区');
INSERT INTO  s_area_code  VALUES ('2268', '430603', '湖南省', '岳阳市', '云溪区', '湖南省岳阳市云溪区');
INSERT INTO  s_area_code  VALUES ('2269', '430611', '湖南省', '岳阳市', '君山区', '湖南省岳阳市君山区');
INSERT INTO  s_area_code  VALUES ('2270', '430621', '湖南省', '岳阳市', '岳阳县', '湖南省岳阳县');
INSERT INTO  s_area_code  VALUES ('2271', '430623', '湖南省', '岳阳市', '华容县', '湖南省华容县');
INSERT INTO  s_area_code  VALUES ('2272', '430624', '湖南省', '岳阳市', '湘阴县', '湖南省湘阴县');
INSERT INTO  s_area_code  VALUES ('2273', '430626', '湖南省', '岳阳市', '平江县', '湖南省平江县');
INSERT INTO  s_area_code  VALUES ('2274', '430681', '湖南省', '岳阳市', '汨罗市', '湖南省汨罗市');
INSERT INTO  s_area_code  VALUES ('2275', '430682', '湖南省', '岳阳市', '临湘市', '湖南省临湘市');
INSERT INTO  s_area_code  VALUES ('2276', '430700', '湖南省', '常德市', '', '湖南省常德市');
INSERT INTO  s_area_code  VALUES ('2277', '430701', '湖南省', '常德市', '市辖区', '湖南省常德市市辖区');
INSERT INTO  s_area_code  VALUES ('2278', '430702', '湖南省', '常德市', '武陵区', '湖南省常德市武陵区');
INSERT INTO  s_area_code  VALUES ('2279', '430703', '湖南省', '常德市', '鼎城区', '湖南省常德市鼎城区');
INSERT INTO  s_area_code  VALUES ('2280', '430721', '湖南省', '常德市', '安乡县', '湖南省安乡县');
INSERT INTO  s_area_code  VALUES ('2281', '430722', '湖南省', '常德市', '汉寿县', '湖南省汉寿县');
INSERT INTO  s_area_code  VALUES ('2282', '430723', '湖南省', '常德市', '澧 县', '湖南省澧 县');
INSERT INTO  s_area_code  VALUES ('2283', '430724', '湖南省', '常德市', '临澧县', '湖南省临澧县');
INSERT INTO  s_area_code  VALUES ('2284', '430725', '湖南省', '常德市', '桃源县', '湖南省桃源县');
INSERT INTO  s_area_code  VALUES ('2285', '430726', '湖南省', '常德市', '石门县', '湖南省石门县');
INSERT INTO  s_area_code  VALUES ('2286', '430781', '湖南省', '常德市', '津市市', '湖南省津市市');
INSERT INTO  s_area_code  VALUES ('2287', '430800', '湖南省', '张家界市', '', '湖南省张家界市');
INSERT INTO  s_area_code  VALUES ('2288', '430801', '湖南省', '张家界市', '市辖区', '湖南省张家界市市辖区');
INSERT INTO  s_area_code  VALUES ('2289', '430802', '湖南省', '张家界市', '永定区', '湖南省张家界市永定区');
INSERT INTO  s_area_code  VALUES ('2290', '430811', '湖南省', '张家界市', '武陵源区', '湖南省张家界市武陵源区');
INSERT INTO  s_area_code  VALUES ('2291', '430821', '湖南省', '张家界市', '慈利县', '湖南省慈利县');
INSERT INTO  s_area_code  VALUES ('2292', '430822', '湖南省', '张家界市', '桑植县', '湖南省桑植县');
INSERT INTO  s_area_code  VALUES ('2293', '430900', '湖南省', '益阳市', '', '湖南省益阳市');
INSERT INTO  s_area_code  VALUES ('2294', '430901', '湖南省', '益阳市', '市辖区', '湖南省益阳市市辖区');
INSERT INTO  s_area_code  VALUES ('2295', '430902', '湖南省', '益阳市', '资阳区', '湖南省益阳市资阳区');
INSERT INTO  s_area_code  VALUES ('2296', '430903', '湖南省', '益阳市', '赫山区', '湖南省益阳市赫山区');
INSERT INTO  s_area_code  VALUES ('2297', '430921', '湖南省', '益阳市', '南 县', '湖南省南 县');
INSERT INTO  s_area_code  VALUES ('2298', '430922', '湖南省', '益阳市', '桃江县', '湖南省桃江县');
INSERT INTO  s_area_code  VALUES ('2299', '430923', '湖南省', '益阳市', '安化县', '湖南省安化县');
INSERT INTO  s_area_code  VALUES ('2300', '430981', '湖南省', '益阳市', '沅江市', '湖南省沅江市');
INSERT INTO  s_area_code  VALUES ('2301', '431000', '湖南省', '郴州市', '', '湖南省郴州市');
INSERT INTO  s_area_code  VALUES ('2302', '431001', '湖南省', '郴州市', '市辖区', '湖南省郴州市市辖区');
INSERT INTO  s_area_code  VALUES ('2303', '431002', '湖南省', '郴州市', '北湖区', '湖南省郴州市北湖区');
INSERT INTO  s_area_code  VALUES ('2304', '431003', '湖南省', '郴州市', '苏仙区', '湖南省郴州市苏仙区');
INSERT INTO  s_area_code  VALUES ('2305', '431021', '湖南省', '郴州市', '桂阳县', '湖南省桂阳县');
INSERT INTO  s_area_code  VALUES ('2306', '431022', '湖南省', '郴州市', '宜章县', '湖南省宜章县');
INSERT INTO  s_area_code  VALUES ('2307', '431023', '湖南省', '郴州市', '永兴县', '湖南省永兴县');
INSERT INTO  s_area_code  VALUES ('2308', '431024', '湖南省', '郴州市', '嘉禾县', '湖南省嘉禾县');
INSERT INTO  s_area_code  VALUES ('2309', '431025', '湖南省', '郴州市', '临武县', '湖南省临武县');
INSERT INTO  s_area_code  VALUES ('2310', '431026', '湖南省', '郴州市', '汝城县', '湖南省汝城县');
INSERT INTO  s_area_code  VALUES ('2311', '431027', '湖南省', '郴州市', '桂东县', '湖南省桂东县');
INSERT INTO  s_area_code  VALUES ('2312', '431028', '湖南省', '郴州市', '安仁县', '湖南省安仁县');
INSERT INTO  s_area_code  VALUES ('2313', '431081', '湖南省', '郴州市', '资兴市', '湖南省资兴市');
INSERT INTO  s_area_code  VALUES ('2314', '431100', '湖南省', '永州市', '', '湖南省永州市');
INSERT INTO  s_area_code  VALUES ('2315', '431101', '湖南省', '永州市', '市辖区', '湖南省永州市市辖区');
INSERT INTO  s_area_code  VALUES ('2316', '431102', '湖南省', '永州市', '芝山区', '湖南省永州市芝山区');
INSERT INTO  s_area_code  VALUES ('2317', '431103', '湖南省', '永州市', '冷水滩区', '湖南省永州市冷水滩区');
INSERT INTO  s_area_code  VALUES ('2318', '431121', '湖南省', '永州市', '祁阳县', '湖南省祁阳县');
INSERT INTO  s_area_code  VALUES ('2319', '431122', '湖南省', '永州市', '东安县', '湖南省东安县');
INSERT INTO  s_area_code  VALUES ('2320', '431123', '湖南省', '永州市', '双牌县', '湖南省双牌县');
INSERT INTO  s_area_code  VALUES ('2321', '431124', '湖南省', '永州市', '道 县', '湖南省道 县');
INSERT INTO  s_area_code  VALUES ('2322', '431125', '湖南省', '永州市', '江永县', '湖南省江永县');
INSERT INTO  s_area_code  VALUES ('2323', '431126', '湖南省', '永州市', '宁远县', '湖南省宁远县');
INSERT INTO  s_area_code  VALUES ('2324', '431127', '湖南省', '永州市', '蓝山县', '湖南省蓝山县');
INSERT INTO  s_area_code  VALUES ('2325', '431128', '湖南省', '永州市', '新田县', '湖南省新田县');
INSERT INTO  s_area_code  VALUES ('2326', '431129', '湖南省', '永州市', '江华瑶族自治县', '湖南省江华瑶族自治县');
INSERT INTO  s_area_code  VALUES ('2327', '431200', '湖南省', '怀化市', '', '湖南省怀化市');
INSERT INTO  s_area_code  VALUES ('2328', '431201', '湖南省', '怀化市', '市辖区', '湖南省怀化市市辖区');
INSERT INTO  s_area_code  VALUES ('2329', '431202', '湖南省', '怀化市', '鹤城区', '湖南省怀化市鹤城区');
INSERT INTO  s_area_code  VALUES ('2330', '431221', '湖南省', '怀化市', '中方县', '湖南省中方县');
INSERT INTO  s_area_code  VALUES ('2331', '431222', '湖南省', '怀化市', '沅陵县', '湖南省沅陵县');
INSERT INTO  s_area_code  VALUES ('2332', '431223', '湖南省', '怀化市', '辰溪县', '湖南省辰溪县');
INSERT INTO  s_area_code  VALUES ('2333', '431224', '湖南省', '怀化市', '溆浦县', '湖南省溆浦县');
INSERT INTO  s_area_code  VALUES ('2334', '431225', '湖南省', '怀化市', '会同县', '湖南省会同县');
INSERT INTO  s_area_code  VALUES ('2335', '431226', '湖南省', '怀化市', '麻阳苗族自治县', '湖南省麻阳苗族自治县');
INSERT INTO  s_area_code  VALUES ('2336', '431227', '湖南省', '怀化市', '新晃侗族自治县', '湖南省新晃侗族自治县');
INSERT INTO  s_area_code  VALUES ('2337', '431228', '湖南省', '怀化市', '芷江侗族自治县', '湖南省芷江侗族自治县');
INSERT INTO  s_area_code  VALUES ('2338', '431229', '湖南省', '怀化市', '靖州苗族侗族自治县', '湖南省靖州苗族侗族自治县');
INSERT INTO  s_area_code  VALUES ('2339', '431230', '湖南省', '怀化市', '通道侗族自治县', '湖南省通道侗族自治县');
INSERT INTO  s_area_code  VALUES ('2340', '431281', '湖南省', '怀化市', '洪江市', '湖南省洪江市');
INSERT INTO  s_area_code  VALUES ('2341', '431300', '湖南省', '娄底市', '', '湖南省娄底市');
INSERT INTO  s_area_code  VALUES ('2342', '431301', '湖南省', '娄底市', '市辖区', '湖南省娄底市市辖区');
INSERT INTO  s_area_code  VALUES ('2343', '431302', '湖南省', '娄底市', '娄星区', '湖南省娄底市娄星区');
INSERT INTO  s_area_code  VALUES ('2344', '431321', '湖南省', '娄底市', '双峰县', '湖南省双峰县');
INSERT INTO  s_area_code  VALUES ('2345', '431322', '湖南省', '娄底市', '新化县', '湖南省新化县');
INSERT INTO  s_area_code  VALUES ('2346', '431381', '湖南省', '娄底市', '冷水江市', '湖南省冷水江市');
INSERT INTO  s_area_code  VALUES ('2347', '431382', '湖南省', '娄底市', '涟源市', '湖南省涟源市');
INSERT INTO  s_area_code  VALUES ('2348', '433100', '湖南省', '湘西土家族苗族自治州', '', '湖南省湘西土家族苗族自治州');
INSERT INTO  s_area_code  VALUES ('2349', '433101', '湖南省', '湘西土家族苗族自治州', '吉首市', '湖南省吉首市');
INSERT INTO  s_area_code  VALUES ('2350', '433122', '湖南省', '湘西土家族苗族自治州', '泸溪县', '湖南省泸溪县');
INSERT INTO  s_area_code  VALUES ('2351', '433123', '湖南省', '湘西土家族苗族自治州', '凤凰县', '湖南省凤凰县');
INSERT INTO  s_area_code  VALUES ('2352', '433124', '湖南省', '湘西土家族苗族自治州', '花垣县', '湖南省花垣县');
INSERT INTO  s_area_code  VALUES ('2353', '433125', '湖南省', '湘西土家族苗族自治州', '保靖县', '湖南省保靖县');
INSERT INTO  s_area_code  VALUES ('2354', '433126', '湖南省', '湘西土家族苗族自治州', '古丈县', '湖南省古丈县');
INSERT INTO  s_area_code  VALUES ('2355', '433127', '湖南省', '湘西土家族苗族自治州', '永顺县', '湖南省永顺县');
INSERT INTO  s_area_code  VALUES ('2356', '433130', '湖南省', '湘西土家族苗族自治州', '龙山县', '湖南省龙山县');
INSERT INTO  s_area_code  VALUES ('2357', '440000', '广东省', '', '', '广东省');
INSERT INTO  s_area_code  VALUES ('2358', '440100', '广东省', '广州市', '', '广东省广州市');
INSERT INTO  s_area_code  VALUES ('2359', '440101', '广东省', '广州市', '市辖区', '广东省广州市市辖区');
INSERT INTO  s_area_code  VALUES ('2360', '440102', '广东省', '广州市', '东山区', '广州市东山区');
INSERT INTO  s_area_code  VALUES ('2361', '440103', '广东省', '广州市', '荔湾区', '广东省广州市荔湾区');
INSERT INTO  s_area_code  VALUES ('2362', '440104', '广东省', '广州市', '越秀区', '广东省广州市越秀区');
INSERT INTO  s_area_code  VALUES ('2363', '440105', '广东省', '广州市', '海珠区', '广东省广州市海珠区');
INSERT INTO  s_area_code  VALUES ('2364', '440106', '广东省', '广州市', '天河区', '广东省广州市天河区');
INSERT INTO  s_area_code  VALUES ('2365', '440107', '广东省', '广州市', '芳村区', '广州市芳村区');
INSERT INTO  s_area_code  VALUES ('2366', '440111', '广东省', '广州市', '白云区', '广东省广州市白云区');
INSERT INTO  s_area_code  VALUES ('2367', '440112', '广东省', '广州市', '黄埔区', '广东省广州市黄埔区');
INSERT INTO  s_area_code  VALUES ('2368', '440113', '广东省', '广州市', '番禺区', '广东省广州市番禺区');
INSERT INTO  s_area_code  VALUES ('2369', '440114', '广东省', '广州市', '花都区', '广东省广州市花都区');
INSERT INTO  s_area_code  VALUES ('2370', '440115', '广东省', '广州市', '南沙区', '广东省广州市南沙区');
INSERT INTO  s_area_code  VALUES ('2371', '440116', '广东省', '广州市', '萝岗区', '广东省广州市萝岗区');
INSERT INTO  s_area_code  VALUES ('2372', '440181', '广东省', '广州市', '番禺市', '广东省广州市番禺市 ');
INSERT INTO  s_area_code  VALUES ('2373', '440182', '广东省', '广州市', '花都市', '广东省广州市花都市 ');
INSERT INTO  s_area_code  VALUES ('2374', '440183', '广东省', '广州市', '增城市', '广东省增城市');
INSERT INTO  s_area_code  VALUES ('2375', '440184', '广东省', '广州市', '从化市', '广东省从化市');
INSERT INTO  s_area_code  VALUES ('2376', '440200', '广东省', '韶关市', '', '广东省韶关市');
INSERT INTO  s_area_code  VALUES ('2377', '440201', '广东省', '韶关市', '市辖区', '广东省韶关市市辖区');
INSERT INTO  s_area_code  VALUES ('2378', '440202', '广东省', '韶关市', '浈江区', '广东省韶关市北江区');
INSERT INTO  s_area_code  VALUES ('2379', '440203', '广东省', '韶关市', '武江区', '广东省韶关市武江区');
INSERT INTO  s_area_code  VALUES ('2380', '440204', '广东省', '韶关市', '浈江区', '广东省韶关市浈江区');
INSERT INTO  s_area_code  VALUES ('2381', '440205', '广东省', '韶关市', '曲江区', '广东省韶关市曲江区');
INSERT INTO  s_area_code  VALUES ('2382', '440221', '广东省', '韶关市', '曲江区', '广东省曲江县');
INSERT INTO  s_area_code  VALUES ('2383', '440222', '广东省', '韶关市', '始兴县', '广东省始兴县');
INSERT INTO  s_area_code  VALUES ('2384', '440224', '广东省', '韶关市', '仁化县', '广东省仁化县');
INSERT INTO  s_area_code  VALUES ('2385', '440229', '广东省', '韶关市', '翁源县', '广东省翁源县');
INSERT INTO  s_area_code  VALUES ('2386', '440232', '广东省', '韶关市', '乳源瑶族自治县', '广东省乳源瑶族自治县');
INSERT INTO  s_area_code  VALUES ('2387', '440233', '广东省', '韶关市', '新丰县', '广东省新丰县');
INSERT INTO  s_area_code  VALUES ('2388', '440281', '广东省', '韶关市', '乐昌市', '广东省乐昌市');
INSERT INTO  s_area_code  VALUES ('2389', '440282', '广东省', '韶关市', '南雄市', '广东省南雄市');
INSERT INTO  s_area_code  VALUES ('2390', '440300', '广东省', '深圳市', '', '广东省深圳市');
INSERT INTO  s_area_code  VALUES ('2391', '440301', '广东省', '深圳市', '市辖区', '广东省深圳市市辖区');
INSERT INTO  s_area_code  VALUES ('2392', '440303', '广东省', '深圳市', '罗湖区', '广东省深圳市罗湖区');
INSERT INTO  s_area_code  VALUES ('2393', '440304', '广东省', '深圳市', '福田区', '广东省深圳市福田区');
INSERT INTO  s_area_code  VALUES ('2394', '440305', '广东省', '深圳市', '南山区', '广东省深圳市南山区');
INSERT INTO  s_area_code  VALUES ('2395', '440306', '广东省', '深圳市', '宝安区', '广东省深圳市宝安区');
INSERT INTO  s_area_code  VALUES ('2396', '440307', '广东省', '深圳市', '龙岗区', '广东省深圳市龙岗区');
INSERT INTO  s_area_code  VALUES ('2397', '440308', '广东省', '深圳市', '盐田区', '广东省深圳市盐田区');
INSERT INTO  s_area_code  VALUES ('2398', '440400', '广东省', '珠海市', '', '广东省珠海市');
INSERT INTO  s_area_code  VALUES ('2399', '440401', '广东省', '珠海市', '市辖区', '广东省珠海市市辖区');
INSERT INTO  s_area_code  VALUES ('2400', '440402', '广东省', '珠海市', '香洲区', '广东省珠海市香洲区');
INSERT INTO  s_area_code  VALUES ('2401', '440403', '广东省', '珠海市', '斗门区', '广东省珠海市斗门区');
INSERT INTO  s_area_code  VALUES ('2402', '440404', '广东省', '珠海市', '金湾区', '广东省珠海市金湾区');
INSERT INTO  s_area_code  VALUES ('2403', '440500', '广东省', '汕头市', '', '广东省汕头市');
INSERT INTO  s_area_code  VALUES ('2404', '440501', '广东省', '汕头市', '市辖区', '广东省汕头市市辖区');
INSERT INTO  s_area_code  VALUES ('2405', '440506', '广东省', '汕头市', '达濠区', '广东省达濠区');
INSERT INTO  s_area_code  VALUES ('2406', '440507', '广东省', '汕头市', '龙湖区', '广东省汕头市龙湖区');
INSERT INTO  s_area_code  VALUES ('2407', '440508', '广东省', '汕头市', '金园区', '广东省金园区');
INSERT INTO  s_area_code  VALUES ('2408', '440509', '广东省', '汕头市', '升平区', '广东省升平区');
INSERT INTO  s_area_code  VALUES ('2409', '440510', '广东省', '汕头市', '河浦区', '广东省河浦区');
INSERT INTO  s_area_code  VALUES ('2410', '440511', '广东省', '汕头市', '金平区', '广东省汕头市金平区');
INSERT INTO  s_area_code  VALUES ('2411', '440512', '广东省', '汕头市', '濠江区', '广东省汕头市濠江区');
INSERT INTO  s_area_code  VALUES ('2412', '440513', '广东省', '汕头市', '潮阳区', '广东省汕头市潮阳区');
INSERT INTO  s_area_code  VALUES ('2413', '440514', '广东省', '汕头市', '潮南区', '广东省汕头市潮南区');
INSERT INTO  s_area_code  VALUES ('2414', '440515', '广东省', '汕头市', '澄海区', '广东省汕头市澄海区');
INSERT INTO  s_area_code  VALUES ('2415', '440523', '广东省', '汕头市', '南澳县', '广东省南澳县');
INSERT INTO  s_area_code  VALUES ('2416', '440582', '广东省', '汕头市', '潮阳市', '广东省潮阳市');
INSERT INTO  s_area_code  VALUES ('2417', '440583', '广东省', '汕头市', '澄海市', '广东省澄海市');
INSERT INTO  s_area_code  VALUES ('2418', '440600', '广东省', '佛山市', '', '广东省佛山市');
INSERT INTO  s_area_code  VALUES ('2419', '440601', '广东省', '佛山市', '市辖区', '广东省佛山市市辖区');
INSERT INTO  s_area_code  VALUES ('2420', '440604', '广东省', '佛山市', '禅城区', '广东省佛山市禅城区');
INSERT INTO  s_area_code  VALUES ('2421', '440605', '广东省', '佛山市', '南海区', '广东省佛山市南海区');
INSERT INTO  s_area_code  VALUES ('2422', '440606', '广东省', '佛山市', '顺德区', '广东省佛山市顺德区');
INSERT INTO  s_area_code  VALUES ('2423', '440607', '广东省', '佛山市', '三水区', '广东省佛山市三水区');
INSERT INTO  s_area_code  VALUES ('2424', '440608', '广东省', '佛山市', '高明区', '广东省佛山市高明区');
INSERT INTO  s_area_code  VALUES ('2425', '440700', '广东省', '江门市', '', '广东省江门市');
INSERT INTO  s_area_code  VALUES ('2426', '440701', '广东省', '江门市', '市辖区', '广东省江门市市辖区');
INSERT INTO  s_area_code  VALUES ('2427', '440703', '广东省', '江门市', '蓬江区', '广东省江门市蓬江区');
INSERT INTO  s_area_code  VALUES ('2428', '440704', '广东省', '江门市', '江海区', '广东省江门市江海区');
INSERT INTO  s_area_code  VALUES ('2429', '440705', '广东省', '江门市', '新会区', '广东省江门市新会区');
INSERT INTO  s_area_code  VALUES ('2430', '440781', '广东省', '江门市', '台山市', '广东省台山市');
INSERT INTO  s_area_code  VALUES ('2431', '440783', '广东省', '江门市', '开平市', '广东省开平市');
INSERT INTO  s_area_code  VALUES ('2432', '440784', '广东省', '江门市', '鹤山市', '广东省鹤山市');
INSERT INTO  s_area_code  VALUES ('2433', '440785', '广东省', '江门市', '恩平市', '广东省恩平市');
INSERT INTO  s_area_code  VALUES ('2434', '440800', '广东省', '湛江市', '', '广东省湛江市');
INSERT INTO  s_area_code  VALUES ('2435', '440801', '广东省', '湛江市', '市辖区', '广东省湛江市市辖区');
INSERT INTO  s_area_code  VALUES ('2436', '440802', '广东省', '湛江市', '赤坎区', '广东省湛江市赤坎区');
INSERT INTO  s_area_code  VALUES ('2437', '440803', '广东省', '湛江市', '霞山区', '广东省湛江市霞山区');
INSERT INTO  s_area_code  VALUES ('2438', '440804', '广东省', '湛江市', '坡头区', '广东省湛江市坡头区');
INSERT INTO  s_area_code  VALUES ('2439', '440811', '广东省', '湛江市', '麻章区', '广东省湛江市麻章区');
INSERT INTO  s_area_code  VALUES ('2440', '440823', '广东省', '湛江市', '遂溪县', '广东省遂溪县');
INSERT INTO  s_area_code  VALUES ('2441', '440825', '广东省', '湛江市', '徐闻县', '广东省徐闻县');
INSERT INTO  s_area_code  VALUES ('2442', '440881', '广东省', '湛江市', '廉江市', '广东省廉江市');
INSERT INTO  s_area_code  VALUES ('2443', '440882', '广东省', '湛江市', '雷州市', '广东省雷州市');
INSERT INTO  s_area_code  VALUES ('2444', '440883', '广东省', '湛江市', '吴川市', '广东省吴川市');
INSERT INTO  s_area_code  VALUES ('2445', '440900', '广东省', '茂名市', '', '广东省茂名市');
INSERT INTO  s_area_code  VALUES ('2446', '440901', '广东省', '茂名市', '市辖区', '广东省茂名市市辖区');
INSERT INTO  s_area_code  VALUES ('2447', '440902', '广东省', '茂名市', '茂南区', '广东省茂名市茂南区');
INSERT INTO  s_area_code  VALUES ('2448', '440903', '广东省', '茂名市', '茂港区', '广东省茂名市茂港区');
INSERT INTO  s_area_code  VALUES ('2449', '440923', '广东省', '茂名市', '电白县', '广东省电白县');
INSERT INTO  s_area_code  VALUES ('2450', '440981', '广东省', '茂名市', '高州市', '广东省高州市');
INSERT INTO  s_area_code  VALUES ('2451', '440982', '广东省', '茂名市', '化州市', '广东省化州市');
INSERT INTO  s_area_code  VALUES ('2452', '440983', '广东省', '茂名市', '信宜市', '广东省信宜市');
INSERT INTO  s_area_code  VALUES ('2453', '441200', '广东省', '肇庆市', '', '广东省肇庆市');
INSERT INTO  s_area_code  VALUES ('2454', '441201', '广东省', '肇庆市', '市辖区', '广东省肇庆市市辖区');
INSERT INTO  s_area_code  VALUES ('2455', '441202', '广东省', '肇庆市', '端州区', '广东省肇庆市端州区');
INSERT INTO  s_area_code  VALUES ('2456', '441203', '广东省', '肇庆市', '鼎湖区', '广东省肇庆市鼎湖区');
INSERT INTO  s_area_code  VALUES ('2457', '441223', '广东省', '肇庆市', '广宁县', '广东省广宁县');
INSERT INTO  s_area_code  VALUES ('2458', '441224', '广东省', '肇庆市', '怀集县', '广东省怀集县');
INSERT INTO  s_area_code  VALUES ('2459', '441225', '广东省', '肇庆市', '封开县', '广东省封开县');
INSERT INTO  s_area_code  VALUES ('2460', '441226', '广东省', '肇庆市', '德庆县', '广东省德庆县');
INSERT INTO  s_area_code  VALUES ('2461', '441283', '广东省', '肇庆市', '高要市', '广东省高要市');
INSERT INTO  s_area_code  VALUES ('2462', '441284', '广东省', '肇庆市', '四会市', '广东省四会市');
INSERT INTO  s_area_code  VALUES ('2463', '441300', '广东省', '惠州市', '', '广东省惠州市');
INSERT INTO  s_area_code  VALUES ('2464', '441301', '广东省', '惠州市', '市辖区', '广东省惠州市市辖区');
INSERT INTO  s_area_code  VALUES ('2465', '441302', '广东省', '惠州市', '惠城区', '广东省惠州市惠城区');
INSERT INTO  s_area_code  VALUES ('2466', '441303', '广东省', '惠州市', '惠阳区', '广东省惠州市惠阳区');
INSERT INTO  s_area_code  VALUES ('2467', '441322', '广东省', '惠州市', '博罗县', '广东省博罗县');
INSERT INTO  s_area_code  VALUES ('2468', '441323', '广东省', '惠州市', '惠东县', '广东省惠东县');
INSERT INTO  s_area_code  VALUES ('2469', '441324', '广东省', '惠州市', '龙门县', '广东省龙门县');
INSERT INTO  s_area_code  VALUES ('2470', '441381', '广东省', '惠州市', '惠阳市', '广东省惠阳市');
INSERT INTO  s_area_code  VALUES ('2471', '441400', '广东省', '梅州市', '梅州市', '广东省梅州市');
INSERT INTO  s_area_code  VALUES ('2472', '441401', '广东省', '梅州市', '市辖区', '广东省梅州市市辖区');
INSERT INTO  s_area_code  VALUES ('2473', '441402', '广东省', '梅州市', '梅江区', '广东省梅州市梅江区');
INSERT INTO  s_area_code  VALUES ('2474', '441421', '广东省', '梅州市', '梅 县', '广东省梅 县');
INSERT INTO  s_area_code  VALUES ('2475', '441422', '广东省', '梅州市', '大埔县', '广东省大埔县');
INSERT INTO  s_area_code  VALUES ('2476', '441423', '广东省', '梅州市', '丰顺县', '广东省丰顺县');
INSERT INTO  s_area_code  VALUES ('2477', '441424', '广东省', '梅州市', '五华县', '广东省五华县');
INSERT INTO  s_area_code  VALUES ('2478', '441426', '广东省', '梅州市', '平远县', '广东省平远县');
INSERT INTO  s_area_code  VALUES ('2479', '441427', '广东省', '梅州市', '蕉岭县', '广东省蕉岭县');
INSERT INTO  s_area_code  VALUES ('2480', '441481', '广东省', '梅州市', '兴宁市', '广东省兴宁市');
INSERT INTO  s_area_code  VALUES ('2481', '441500', '广东省', '汕尾市', '', '广东省汕尾市');
INSERT INTO  s_area_code  VALUES ('2482', '441501', '广东省', '汕尾市', '市辖区', '广东省汕尾市市辖区');
INSERT INTO  s_area_code  VALUES ('2483', '441502', '广东省', '汕尾市', '城 区', '广东省汕尾市城 区');
INSERT INTO  s_area_code  VALUES ('2484', '441521', '广东省', '汕尾市', '海丰县', '广东省海丰县');
INSERT INTO  s_area_code  VALUES ('2485', '441523', '广东省', '汕尾市', '陆河县', '广东省陆河县');
INSERT INTO  s_area_code  VALUES ('2486', '441581', '广东省', '汕尾市', '陆丰市', '广东省陆丰市');
INSERT INTO  s_area_code  VALUES ('2487', '441600', '广东省', '河源市', '', '广东省河源市');
INSERT INTO  s_area_code  VALUES ('2488', '441601', '广东省', '河源市', '市辖区', '广东省河源市市辖区');
INSERT INTO  s_area_code  VALUES ('2489', '441602', '广东省', '河源市', '源城区', '广东省河源市源城区');
INSERT INTO  s_area_code  VALUES ('2490', '441621', '广东省', '河源市', '紫金县', '广东省紫金县');
INSERT INTO  s_area_code  VALUES ('2491', '441622', '广东省', '河源市', '龙川县', '广东省龙川县');
INSERT INTO  s_area_code  VALUES ('2492', '441623', '广东省', '河源市', '连平县', '广东省连平县');
INSERT INTO  s_area_code  VALUES ('2493', '441624', '广东省', '河源市', '和平县', '广东省和平县');
INSERT INTO  s_area_code  VALUES ('2494', '441625', '广东省', '河源市', '东源县', '广东省东源县');
INSERT INTO  s_area_code  VALUES ('2495', '441700', '广东省', '阳江市', '', '广东省阳江市');
INSERT INTO  s_area_code  VALUES ('2496', '441701', '广东省', '阳江市', '市辖区', '广东省阳江市市辖区');
INSERT INTO  s_area_code  VALUES ('2497', '441702', '广东省', '阳江市', '江城区', '广东省阳江市江城区');
INSERT INTO  s_area_code  VALUES ('2498', '441721', '广东省', '阳江市', '阳西县', '广东省阳西县');
INSERT INTO  s_area_code  VALUES ('2499', '441723', '广东省', '阳江市', '阳东县', '广东省阳东县');
INSERT INTO  s_area_code  VALUES ('2500', '441781', '广东省', '阳江市', '阳春市', '广东省阳春市');
INSERT INTO  s_area_code  VALUES ('2501', '441800', '广东省', '清远市', '', '广东省清远市');
INSERT INTO  s_area_code  VALUES ('2502', '441801', '广东省', '清远市', '市辖区', '广东省清远市市辖区');
INSERT INTO  s_area_code  VALUES ('2503', '441802', '广东省', '清远市', '清城区', '广东省清远市清城区');
INSERT INTO  s_area_code  VALUES ('2504', '441821', '广东省', '清远市', '佛冈县', '广东省佛冈县');
INSERT INTO  s_area_code  VALUES ('2505', '441823', '广东省', '清远市', '阳山县', '广东省阳山县');
INSERT INTO  s_area_code  VALUES ('2506', '441825', '广东省', '清远市', '连山壮族瑶族自治县', '广东省连山壮族瑶族自治县');
INSERT INTO  s_area_code  VALUES ('2507', '441826', '广东省', '清远市', '连南瑶族自治县', '广东省连南瑶族自治县');
INSERT INTO  s_area_code  VALUES ('2508', '441827', '广东省', '清远市', '清新县', '广东省清新县');
INSERT INTO  s_area_code  VALUES ('2509', '441881', '广东省', '清远市', '英德市', '广东省英德市');
INSERT INTO  s_area_code  VALUES ('2510', '441882', '广东省', '清远市', '连州市', '广东省连州市');
INSERT INTO  s_area_code  VALUES ('2511', '441900', '广东省', '东莞市', '', '广东省东莞市');
INSERT INTO  s_area_code  VALUES ('2512', '442000', '广东省', '中山市', '', '广东省中山市');
INSERT INTO  s_area_code  VALUES ('2513', '445100', '广东省', '潮州市', '', '广东省潮州市');
INSERT INTO  s_area_code  VALUES ('2514', '445101', '广东省', '潮州市', '市辖区', '广东省潮州市市辖区');
INSERT INTO  s_area_code  VALUES ('2515', '445102', '广东省', '潮州市', '湘桥区', '广东省潮州市湘桥区');
INSERT INTO  s_area_code  VALUES ('2516', '445121', '广东省', '潮州市', '潮安县', '广东省潮安县');
INSERT INTO  s_area_code  VALUES ('2517', '445122', '广东省', '潮州市', '饶平县', '广东省饶平县');
INSERT INTO  s_area_code  VALUES ('2518', '445200', '广东省', '揭阳市', '', '广东省揭阳市');
INSERT INTO  s_area_code  VALUES ('2519', '445201', '广东省', '揭阳市', '市辖区', '广东省揭阳市市辖区');
INSERT INTO  s_area_code  VALUES ('2520', '445202', '广东省', '揭阳市', '榕城区', '广东省揭阳市榕城区');
INSERT INTO  s_area_code  VALUES ('2521', '445221', '广东省', '揭阳市', '揭东县', '广东省揭东县');
INSERT INTO  s_area_code  VALUES ('2522', '445222', '广东省', '揭阳市', '揭西县', '广东省揭西县');
INSERT INTO  s_area_code  VALUES ('2523', '445224', '广东省', '揭阳市', '惠来县', '广东省惠来县');
INSERT INTO  s_area_code  VALUES ('2524', '445281', '广东省', '揭阳市', '普宁市', '广东省普宁市');
INSERT INTO  s_area_code  VALUES ('2525', '445300', '广东省', '云浮市', '', '广东省云浮市');
INSERT INTO  s_area_code  VALUES ('2526', '445301', '广东省', '云浮市', '市辖区', '广东省市辖区');
INSERT INTO  s_area_code  VALUES ('2527', '445302', '广东省', '云浮市', '云城区', '广东省云城区');
INSERT INTO  s_area_code  VALUES ('2528', '445321', '广东省', '云浮市', '新兴县', '广东省新兴县');
INSERT INTO  s_area_code  VALUES ('2529', '445322', '广东省', '云浮市', '郁南县', '广东省郁南县');
INSERT INTO  s_area_code  VALUES ('2530', '445323', '广东省', '云浮市', '云安县', '广东省云安县');
INSERT INTO  s_area_code  VALUES ('2531', '445381', '广东省', '云浮市', '罗定市', '广东省罗定市');
INSERT INTO  s_area_code  VALUES ('2532', '450000', '广西壮族自治区', '', '', '广西壮族自治区');
INSERT INTO  s_area_code  VALUES ('2533', '450100', '广西壮族自治区', '南宁市', '', '广西壮族自治区南宁市');
INSERT INTO  s_area_code  VALUES ('2534', '450101', '广西壮族自治区', '南宁市', '市辖区', '广西壮族自治区南宁市市辖区');
INSERT INTO  s_area_code  VALUES ('2535', '450102', '广西壮族自治区', '南宁市', '兴宁区', '广西壮族自治区南宁市兴宁区');
INSERT INTO  s_area_code  VALUES ('2536', '450103', '广西壮族自治区', '南宁市', '青秀区', '广西壮族自治区南宁市青秀区');
INSERT INTO  s_area_code  VALUES ('2537', '450104', '广西壮族自治区', '南宁市', '城北区', '广西壮族自治区城北区');
INSERT INTO  s_area_code  VALUES ('2538', '450105', '广西壮族自治区', '南宁市', '江南区', '广西壮族自治区南宁市江南区');
INSERT INTO  s_area_code  VALUES ('2539', '450106', '广西壮族自治区', '南宁市', '永新区', '广西壮族自治区永新区');
INSERT INTO  s_area_code  VALUES ('2540', '450107', '广西壮族自治区', '南宁市', '西乡塘区', '广西壮族自治区南宁市西乡塘区');
INSERT INTO  s_area_code  VALUES ('2541', '450108', '广西壮族自治区', '南宁市', '良庆区', '广西壮族自治区南宁市良庆区');
INSERT INTO  s_area_code  VALUES ('2542', '450109', '广西壮族自治区', '南宁市', '邕宁区', '广西壮族自治区南宁市邕宁区');
INSERT INTO  s_area_code  VALUES ('2543', '450121', '广西壮族自治区', '南宁市', '邕宁县', '广西壮族自治区邕宁县');
INSERT INTO  s_area_code  VALUES ('2544', '450122', '广西壮族自治区', '南宁市', '武鸣县', '广西壮族自治区武鸣县');
INSERT INTO  s_area_code  VALUES ('2545', '450123', '广西壮族自治区', '南宁市', '隆安县', '广西壮族自治区隆安县');
INSERT INTO  s_area_code  VALUES ('2546', '450124', '广西壮族自治区', '南宁市', '马山县', '广西壮族自治区马山县');
INSERT INTO  s_area_code  VALUES ('2547', '450125', '广西壮族自治区', '南宁市', '上林县', '广西壮族自治区上林县');
INSERT INTO  s_area_code  VALUES ('2548', '450126', '广西壮族自治区', '南宁市', '宾阳县', '广西壮族自治区宾阳县');
INSERT INTO  s_area_code  VALUES ('2549', '450127', '广西壮族自治区', '南宁市', '横 县', '广西壮族自治区横 县');
INSERT INTO  s_area_code  VALUES ('2550', '450200', '广西壮族自治区', '柳州市', '', '广西壮族自治区柳州市');
INSERT INTO  s_area_code  VALUES ('2551', '450201', '广西壮族自治区', '柳州市', '市辖区', '广西壮族自治区柳州市市辖区');
INSERT INTO  s_area_code  VALUES ('2552', '450202', '广西壮族自治区', '柳州市', '城中区', '广西壮族自治区柳州市城中区');
INSERT INTO  s_area_code  VALUES ('2553', '450203', '广西壮族自治区', '柳州市', '鱼峰区', '广西壮族自治区柳州市鱼峰区');
INSERT INTO  s_area_code  VALUES ('2554', '450204', '广西壮族自治区', '柳州市', '柳南区', '广西壮族自治区柳州市柳南区');
INSERT INTO  s_area_code  VALUES ('2555', '450205', '广西壮族自治区', '柳州市', '柳北区', '广西壮族自治区柳州市柳北区');
INSERT INTO  s_area_code  VALUES ('2556', '450221', '广西壮族自治区', '柳州市', '柳江县', '广西壮族自治区柳江县');
INSERT INTO  s_area_code  VALUES ('2557', '450222', '广西壮族自治区', '柳州市', '柳城县', '广西壮族自治区柳城县');
INSERT INTO  s_area_code  VALUES ('2558', '450223', '广西壮族自治区', '柳州市', '鹿寨县', '广西壮族自治区鹿寨县');
INSERT INTO  s_area_code  VALUES ('2559', '450224', '广西壮族自治区', '柳州市', '融安县', '广西壮族自治区融安县');
INSERT INTO  s_area_code  VALUES ('2560', '450225', '广西壮族自治区', '柳州市', '融水苗族自治县', '广西壮族自治区融水苗族自治县');
INSERT INTO  s_area_code  VALUES ('2561', '450226', '广西壮族自治区', '柳州市', '三江侗族自治县', '广西壮族自治区三江侗族自治县');
INSERT INTO  s_area_code  VALUES ('2562', '450300', '广西壮族自治区', '桂林市', '', '广西壮族自治区桂林市');
INSERT INTO  s_area_code  VALUES ('2563', '450301', '广西壮族自治区', '桂林市', '市辖区', '广西壮族自治区桂林市市辖区');
INSERT INTO  s_area_code  VALUES ('2564', '450302', '广西壮族自治区', '桂林市', '秀峰区', '广西壮族自治区桂林市秀峰区');
INSERT INTO  s_area_code  VALUES ('2565', '450303', '广西壮族自治区', '桂林市', '叠彩区', '广西壮族自治区桂林市叠彩区');
INSERT INTO  s_area_code  VALUES ('2566', '450304', '广西壮族自治区', '桂林市', '象山区', '广西壮族自治区桂林市象山区');
INSERT INTO  s_area_code  VALUES ('2567', '450305', '广西壮族自治区', '桂林市', '七星区', '广西壮族自治区桂林市七星区');
INSERT INTO  s_area_code  VALUES ('2568', '450311', '广西壮族自治区', '桂林市', '雁山区', '广西壮族自治区桂林市雁山区');
INSERT INTO  s_area_code  VALUES ('2569', '450321', '广西壮族自治区', '桂林市', '阳朔县', '广西壮族自治区阳朔县');
INSERT INTO  s_area_code  VALUES ('2570', '450322', '广西壮族自治区', '桂林市', '临桂县', '广西壮族自治区临桂县');
INSERT INTO  s_area_code  VALUES ('2571', '450323', '广西壮族自治区', '桂林市', '灵川县', '广西壮族自治区灵川县');
INSERT INTO  s_area_code  VALUES ('2572', '450324', '广西壮族自治区', '桂林市', '全州县', '广西壮族自治区全州县');
INSERT INTO  s_area_code  VALUES ('2573', '450325', '广西壮族自治区', '桂林市', '兴安县', '广西壮族自治区兴安县');
INSERT INTO  s_area_code  VALUES ('2574', '450326', '广西壮族自治区', '桂林市', '永福县', '广西壮族自治区永福县');
INSERT INTO  s_area_code  VALUES ('2575', '450327', '广西壮族自治区', '桂林市', '灌阳县', '广西壮族自治区灌阳县');
INSERT INTO  s_area_code  VALUES ('2576', '450328', '广西壮族自治区', '桂林市', '龙胜各族自治县', '广西壮族自治区龙胜各族自治县');
INSERT INTO  s_area_code  VALUES ('2577', '450329', '广西壮族自治区', '桂林市', '资源县', '广西壮族自治区资源县');
INSERT INTO  s_area_code  VALUES ('2578', '450330', '广西壮族自治区', '桂林市', '平乐县', '广西壮族自治区平乐县');
INSERT INTO  s_area_code  VALUES ('2579', '450331', '广西壮族自治区', '桂林市', '荔蒲县', '广西壮族自治区荔蒲县');
INSERT INTO  s_area_code  VALUES ('2580', '450332', '广西壮族自治区', '桂林市', '恭城瑶族自治县', '广西壮族自治区恭城瑶族自治县');
INSERT INTO  s_area_code  VALUES ('2581', '450400', '广西壮族自治区', '梧州市', '', '广西壮族自治区梧州市');
INSERT INTO  s_area_code  VALUES ('2582', '450401', '广西壮族自治区', '梧州市', '市辖区', '广西壮族自治区梧州市市辖区');
INSERT INTO  s_area_code  VALUES ('2583', '450403', '广西壮族自治区', '梧州市', '万秀区', '广西壮族自治区梧州市万秀区');
INSERT INTO  s_area_code  VALUES ('2584', '450404', '广西壮族自治区', '梧州市', '蝶山区', '广西壮族自治区梧州市蝶山区');
INSERT INTO  s_area_code  VALUES ('2585', '450405', '广西壮族自治区', '梧州市', '长洲区', '广西壮族自治区梧州市长洲区');
INSERT INTO  s_area_code  VALUES ('2586', '450411', '广西壮族自治区', '梧州市', '市郊区', '广西壮族自治区梧州市市郊区');
INSERT INTO  s_area_code  VALUES ('2587', '450421', '广西壮族自治区', '梧州市', '苍梧县', '广西壮族自治区苍梧县');
INSERT INTO  s_area_code  VALUES ('2588', '450422', '广西壮族自治区', '梧州市', '藤 县', '广西壮族自治区藤 县');
INSERT INTO  s_area_code  VALUES ('2589', '450423', '广西壮族自治区', '梧州市', '蒙山县', '广西壮族自治区蒙山县');
INSERT INTO  s_area_code  VALUES ('2590', '450481', '广西壮族自治区', '梧州市', '岑溪市', '广西壮族自治区岑溪市');
INSERT INTO  s_area_code  VALUES ('2591', '450500', '广西壮族自治区', '北海市', '', '广西壮族自治区北海市');
INSERT INTO  s_area_code  VALUES ('2592', '450501', '广西壮族自治区', '北海市', '市辖区', '广西壮族自治区北海市市辖区');
INSERT INTO  s_area_code  VALUES ('2593', '450502', '广西壮族自治区', '北海市', '海城区', '广西壮族自治区北海市海城区');
INSERT INTO  s_area_code  VALUES ('2594', '450503', '广西壮族自治区', '北海市', '银海区', '广西壮族自治区北海市银海区');
INSERT INTO  s_area_code  VALUES ('2595', '450512', '广西壮族自治区', '北海市', '铁山港区', '广西壮族自治区北海市铁山港区');
INSERT INTO  s_area_code  VALUES ('2596', '450521', '广西壮族自治区', '北海市', '合浦县', '广西壮族自治区合浦县');
INSERT INTO  s_area_code  VALUES ('2597', '450600', '广西壮族自治区', '防城港市', '', '广西壮族自治区防城港市');
INSERT INTO  s_area_code  VALUES ('2598', '450601', '广西壮族自治区', '防城港市', '市辖区', '广西壮族自治区防城港市市辖区');
INSERT INTO  s_area_code  VALUES ('2599', '450602', '广西壮族自治区', '防城港市', '港口区', '广西壮族自治区防城港市港口区');
INSERT INTO  s_area_code  VALUES ('2600', '450603', '广西壮族自治区', '防城港市', '防城区', '广西壮族自治区防城港市防城区');
INSERT INTO  s_area_code  VALUES ('2601', '450621', '广西壮族自治区', '防城港市', '上思县', '广西壮族自治区上思县');
INSERT INTO  s_area_code  VALUES ('2602', '450681', '广西壮族自治区', '防城港市', '东兴市', '广西壮族自治区东兴市');
INSERT INTO  s_area_code  VALUES ('2603', '450700', '广西壮族自治区', '钦州市', '', '广西壮族自治区钦州市');
INSERT INTO  s_area_code  VALUES ('2604', '450701', '广西壮族自治区', '钦州市', '市辖区', '广西壮族自治区钦州市市辖区');
INSERT INTO  s_area_code  VALUES ('2605', '450702', '广西壮族自治区', '钦州市', '钦南区', '广西壮族自治区钦州市钦南区');
INSERT INTO  s_area_code  VALUES ('2606', '450703', '广西壮族自治区', '钦州市', '钦北区', '广西壮族自治区钦州市钦北区');
INSERT INTO  s_area_code  VALUES ('2607', '450721', '广西壮族自治区', '钦州市', '灵山县', '广西壮族自治区灵山县');
INSERT INTO  s_area_code  VALUES ('2608', '450722', '广西壮族自治区', '钦州市', '浦北县', '广西壮族自治区浦北县');
INSERT INTO  s_area_code  VALUES ('2609', '450800', '广西壮族自治区', '贵港市', '', '广西壮族自治区贵港市');
INSERT INTO  s_area_code  VALUES ('2610', '450801', '广西壮族自治区', '贵港市', '市辖区', '广西壮族自治区贵港市市辖区');
INSERT INTO  s_area_code  VALUES ('2611', '450802', '广西壮族自治区', '贵港市', '港北区', '广西壮族自治区贵港市港北区');
INSERT INTO  s_area_code  VALUES ('2612', '450803', '广西壮族自治区', '贵港市', '港南区', '广西壮族自治区贵港市港南区');
INSERT INTO  s_area_code  VALUES ('2613', '450804', '广西壮族自治区', '贵港市', '覃塘区', '广西壮族自治区贵港市覃塘区');
INSERT INTO  s_area_code  VALUES ('2614', '450821', '广西壮族自治区', '贵港市', '平南县', '广西壮族自治区平南县');
INSERT INTO  s_area_code  VALUES ('2615', '450881', '广西壮族自治区', '贵港市', '桂平市', '广西壮族自治区桂平市');
INSERT INTO  s_area_code  VALUES ('2616', '450900', '广西壮族自治区', '玉林市', '', '广西壮族自治区玉林市');
INSERT INTO  s_area_code  VALUES ('2617', '450901', '广西壮族自治区', '玉林市', '市辖区', '广西壮族自治区玉林市市辖区');
INSERT INTO  s_area_code  VALUES ('2618', '450902', '广西壮族自治区', '玉林市', '玉州区', '广西壮族自治区玉林市玉州区');
INSERT INTO  s_area_code  VALUES ('2619', '450921', '广西壮族自治区', '玉林市', '容 县', '广西壮族自治区容 县');
INSERT INTO  s_area_code  VALUES ('2620', '450922', '广西壮族自治区', '玉林市', '陆川县', '广西壮族自治区陆川县');
INSERT INTO  s_area_code  VALUES ('2621', '450923', '广西壮族自治区', '玉林市', '博白县', '广西壮族自治区博白县');
INSERT INTO  s_area_code  VALUES ('2622', '450924', '广西壮族自治区', '玉林市', '兴业县', '广西壮族自治区兴业县');
INSERT INTO  s_area_code  VALUES ('2623', '450981', '广西壮族自治区', '玉林市', '北流市', '广西壮族自治区北流市');
INSERT INTO  s_area_code  VALUES ('2624', '451000', '广西壮族自治区', '百色市', '', '广西壮族自治区百色市');
INSERT INTO  s_area_code  VALUES ('2625', '451001', '广西壮族自治区', '百色市', '市辖区', '广西壮族自治区百色市市辖区');
INSERT INTO  s_area_code  VALUES ('2626', '451002', '广西壮族自治区', '百色市', '右江区', '广西壮族自治区百色市右江区');
INSERT INTO  s_area_code  VALUES ('2627', '451021', '广西壮族自治区', '百色市', '田阳县', '广西壮族自治区田阳县');
INSERT INTO  s_area_code  VALUES ('2628', '451022', '广西壮族自治区', '百色市', '田东县', '广西壮族自治区田东县');
INSERT INTO  s_area_code  VALUES ('2629', '451023', '广西壮族自治区', '百色市', '平果县', '广西壮族自治区平果县');
INSERT INTO  s_area_code  VALUES ('2630', '451024', '广西壮族自治区', '百色市', '德保县', '广西壮族自治区德保县');
INSERT INTO  s_area_code  VALUES ('2631', '451025', '广西壮族自治区', '百色市', '靖西县', '广西壮族自治区靖西县');
INSERT INTO  s_area_code  VALUES ('2632', '451026', '广西壮族自治区', '百色市', '那坡县', '广西壮族自治区那坡县');
INSERT INTO  s_area_code  VALUES ('2633', '451027', '广西壮族自治区', '百色市', '凌云县', '广西壮族自治区凌云县');
INSERT INTO  s_area_code  VALUES ('2634', '451028', '广西壮族自治区', '百色市', '乐业县', '广西壮族自治区乐业县');
INSERT INTO  s_area_code  VALUES ('2635', '451029', '广西壮族自治区', '百色市', '田林县', '广西壮族自治区田林县');
INSERT INTO  s_area_code  VALUES ('2636', '451030', '广西壮族自治区', '百色市', '西林县', '广西壮族自治区西林县');
INSERT INTO  s_area_code  VALUES ('2637', '451031', '广西壮族自治区', '百色市', '隆林各族自治县', '广西壮族自治区隆林各族自治县');
INSERT INTO  s_area_code  VALUES ('2638', '451100', '广西壮族自治区', '贺州市', '', '广西壮族自治区贺州市');
INSERT INTO  s_area_code  VALUES ('2639', '451101', '广西壮族自治区', '贺州市', '市辖区', '广西壮族自治区贺州市市辖区');
INSERT INTO  s_area_code  VALUES ('2640', '451102', '广西壮族自治区', '贺州市', '八步区', '广西壮族自治区贺州市八步区');
INSERT INTO  s_area_code  VALUES ('2641', '451121', '广西壮族自治区', '贺州市', '昭平县', '广西壮族自治区昭平县');
INSERT INTO  s_area_code  VALUES ('2642', '451122', '广西壮族自治区', '贺州市', '钟山县', '广西壮族自治区钟山县');
INSERT INTO  s_area_code  VALUES ('2643', '451123', '广西壮族自治区', '贺州市', '富川瑶族自治县', '广西壮族自治区富川瑶族自治县');
INSERT INTO  s_area_code  VALUES ('2644', '451200', '广西壮族自治区', '河池市', '', '广西壮族自治区河池市');
INSERT INTO  s_area_code  VALUES ('2645', '451201', '广西壮族自治区', '河池市', '市辖区', '广西壮族自治区河池市市辖区');
INSERT INTO  s_area_code  VALUES ('2646', '451202', '广西壮族自治区', '河池市', '金城江区', '广西壮族自治区河池市金城江区');
INSERT INTO  s_area_code  VALUES ('2647', '451221', '广西壮族自治区', '河池市', '南丹县', '广西壮族自治区南丹县');
INSERT INTO  s_area_code  VALUES ('2648', '451222', '广西壮族自治区', '河池市', '天峨县', '广西壮族自治区天峨县');
INSERT INTO  s_area_code  VALUES ('2649', '451223', '广西壮族自治区', '河池市', '凤山县', '广西壮族自治区凤山县');
INSERT INTO  s_area_code  VALUES ('2650', '451224', '广西壮族自治区', '河池市', '东兰县', '广西壮族自治区东兰县');
INSERT INTO  s_area_code  VALUES ('2651', '451225', '广西壮族自治区', '河池市', '罗城仫佬族自治县', '广西壮族自治区罗城仫佬族自治县');
INSERT INTO  s_area_code  VALUES ('2652', '451226', '广西壮族自治区', '河池市', '环江毛南族自治县', '广西壮族自治区环江毛南族自治县');
INSERT INTO  s_area_code  VALUES ('2653', '451227', '广西壮族自治区', '河池市', '巴马瑶族自治县', '广西壮族自治区巴马瑶族自治县');
INSERT INTO  s_area_code  VALUES ('2654', '451228', '广西壮族自治区', '河池市', '都安瑶族自治县', '广西壮族自治区都安瑶族自治县');
INSERT INTO  s_area_code  VALUES ('2655', '451229', '广西壮族自治区', '河池市', '大化瑶族自治县', '广西壮族自治区大化瑶族自治县');
INSERT INTO  s_area_code  VALUES ('2656', '451281', '广西壮族自治区', '河池市', '宜州市', '广西壮族自治区宜州市');
INSERT INTO  s_area_code  VALUES ('2657', '451300', '广西壮族自治区', '来宾市', '', '广西壮族自治区来宾市');
INSERT INTO  s_area_code  VALUES ('2658', '451301', '广西壮族自治区', '来宾市', '市辖区', '广西壮族自治区来宾市市辖区');
INSERT INTO  s_area_code  VALUES ('2659', '451302', '广西壮族自治区', '来宾市', '兴宾区', '广西壮族自治区来宾市兴宾区');
INSERT INTO  s_area_code  VALUES ('2660', '451321', '广西壮族自治区', '来宾市', '忻城县', '广西壮族自治区忻城县');
INSERT INTO  s_area_code  VALUES ('2661', '451322', '广西壮族自治区', '来宾市', '象州县', '广西壮族自治区象州县');
INSERT INTO  s_area_code  VALUES ('2662', '451323', '广西壮族自治区', '来宾市', '武宣县', '广西壮族自治区武宣县');
INSERT INTO  s_area_code  VALUES ('2663', '451324', '广西壮族自治区', '来宾市', '金秀瑶族自治县', '广西壮族自治区金秀瑶族自治县');
INSERT INTO  s_area_code  VALUES ('2664', '451381', '广西壮族自治区', '来宾市', '合山市', '广西壮族自治区合山市');
INSERT INTO  s_area_code  VALUES ('2665', '451400', '广西壮族自治区', '崇左市', '', '广西壮族自治区崇左市');
INSERT INTO  s_area_code  VALUES ('2666', '451401', '广西壮族自治区', '崇左市', '市辖区', '广西壮族自治区崇左市市辖区');
INSERT INTO  s_area_code  VALUES ('2667', '451402', '广西壮族自治区', '崇左市', '江洲区', '广西壮族自治区崇左市江洲区');
INSERT INTO  s_area_code  VALUES ('2668', '451421', '广西壮族自治区', '崇左市', '扶绥县', '广西壮族自治区扶绥县');
INSERT INTO  s_area_code  VALUES ('2669', '451422', '广西壮族自治区', '崇左市', '宁明县', '广西壮族自治区宁明县');
INSERT INTO  s_area_code  VALUES ('2670', '451423', '广西壮族自治区', '崇左市', '龙州县', '广西壮族自治区龙州县');
INSERT INTO  s_area_code  VALUES ('2671', '451424', '广西壮族自治区', '崇左市', '大新县', '广西壮族自治区大新县');
INSERT INTO  s_area_code  VALUES ('2672', '451425', '广西壮族自治区', '崇左市', '天等县', '广西壮族自治区天等县');
INSERT INTO  s_area_code  VALUES ('2673', '451481', '广西壮族自治区', '崇左市', '凭祥市', '广西壮族自治区凭祥市');
INSERT INTO  s_area_code  VALUES ('2674', '460000', '海南省', '', '', '海南省');
INSERT INTO  s_area_code  VALUES ('2675', '460100', '海南省', '海口市', '', '海南省海口市');
INSERT INTO  s_area_code  VALUES ('2676', '460101', '海南省', '海口市', '市辖区', '海南省海口市市辖区');
INSERT INTO  s_area_code  VALUES ('2677', '460105', '海南省', '海口市', '秀英区', '海南省海口市秀英区');
INSERT INTO  s_area_code  VALUES ('2678', '460106', '海南省', '海口市', '龙华区', '海南省海口市龙华区');
INSERT INTO  s_area_code  VALUES ('2679', '460107', '海南省', '海口市', '琼山区', '海南省海口市琼山区');
INSERT INTO  s_area_code  VALUES ('2680', '460108', '海南省', '海口市', '美兰区', '海南省海口市美兰区');
INSERT INTO  s_area_code  VALUES ('2681', '460200', '海南省', '三亚市', '', '海南省三亚市');
INSERT INTO  s_area_code  VALUES ('2682', '460201', '海南省', '三亚市', '市辖区', '海南省三亚市市辖区');
INSERT INTO  s_area_code  VALUES ('2683', '469000', '海南省', '省直辖县级行政单位', '', '海南省三亚市省直辖县级行政单位');
INSERT INTO  s_area_code  VALUES ('2684', '469001', '海南省', '省直辖县级行政单位', '五指山市', '海南省五指山市');
INSERT INTO  s_area_code  VALUES ('2685', '469002', '海南省', '省直辖县级行政单位', '琼海市', '海南省琼海市');
INSERT INTO  s_area_code  VALUES ('2686', '469003', '海南省', '省直辖县级行政单位', '儋州市', '海南省儋州市');
INSERT INTO  s_area_code  VALUES ('2687', '469005', '海南省', '省直辖县级行政单位', '文昌市', '海南省文昌市');
INSERT INTO  s_area_code  VALUES ('2688', '469006', '海南省', '省直辖县级行政单位', '万宁市', '海南省万宁市');
INSERT INTO  s_area_code  VALUES ('2689', '469007', '海南省', '省直辖县级行政单位', '东方市', '海南省东方市');
INSERT INTO  s_area_code  VALUES ('2690', '469025', '海南省', '省直辖县级行政单位', '定安县', '海南省定安县');
INSERT INTO  s_area_code  VALUES ('2691', '469026', '海南省', '省直辖县级行政单位', '屯昌县', '海南省屯昌县');
INSERT INTO  s_area_code  VALUES ('2692', '469027', '海南省', '省直辖县级行政单位', '澄迈县', '海南省澄迈县');
INSERT INTO  s_area_code  VALUES ('2693', '469028', '海南省', '省直辖县级行政单位', '临高县', '海南省临高县');
INSERT INTO  s_area_code  VALUES ('2694', '469030', '海南省', '省直辖县级行政单位', '白沙黎族自治县', '海南省白沙黎族自治县');
INSERT INTO  s_area_code  VALUES ('2695', '469031', '海南省', '省直辖县级行政单位', '昌江黎族自治县', '海南省昌江黎族自治县');
INSERT INTO  s_area_code  VALUES ('2696', '469033', '海南省', '省直辖县级行政单位', '乐东黎族自治县', '海南省乐东黎族自治县');
INSERT INTO  s_area_code  VALUES ('2697', '469034', '海南省', '省直辖县级行政单位', '陵水黎族自治县', '海南省陵水黎族自治县');
INSERT INTO  s_area_code  VALUES ('2698', '469035', '海南省', '省直辖县级行政单位', '保亭黎族苗族自治县', '海南省保亭黎族苗族自治县');
INSERT INTO  s_area_code  VALUES ('2699', '469036', '海南省', '省直辖县级行政单位', '琼中黎族苗族自治县', '海南省琼中黎族苗族自治县');
INSERT INTO  s_area_code  VALUES ('2700', '469037', '海南省', '省直辖县级行政单位', '西沙群岛', '海南省西沙群岛');
INSERT INTO  s_area_code  VALUES ('2701', '469038', '海南省', '省直辖县级行政单位', '南沙群岛', '海南省南沙群岛');
INSERT INTO  s_area_code  VALUES ('2702', '469039', '海南省', '省直辖县级行政单位', '中沙群岛的岛礁及其海域', '海南省中沙群岛的岛礁及其海域');
INSERT INTO  s_area_code  VALUES ('2703', '500000', '重庆市', '', '', '重庆市');
INSERT INTO  s_area_code  VALUES ('2704', '500100', '重庆市', '重庆市', '市辖区', '重庆市市辖区');
INSERT INTO  s_area_code  VALUES ('2705', '500101', '重庆市', '重庆市', '万州区', '重庆市万州区');
INSERT INTO  s_area_code  VALUES ('2706', '500102', '重庆市', '重庆市', '涪陵区', '重庆市涪陵区');
INSERT INTO  s_area_code  VALUES ('2707', '500103', '重庆市', '重庆市', '渝中区', '重庆市渝中区');
INSERT INTO  s_area_code  VALUES ('2708', '500104', '重庆市', '重庆市', '大渡口区', '重庆市大渡口区');
INSERT INTO  s_area_code  VALUES ('2709', '500105', '重庆市', '重庆市', '江北区', '重庆市江北区');
INSERT INTO  s_area_code  VALUES ('2710', '500106', '重庆市', '重庆市', '沙坪坝区', '重庆市沙坪坝区');
INSERT INTO  s_area_code  VALUES ('2711', '500107', '重庆市', '重庆市', '九龙坡区', '重庆市九龙坡区');
INSERT INTO  s_area_code  VALUES ('2712', '500108', '重庆市', '重庆市', '南岸区', '重庆市南岸区');
INSERT INTO  s_area_code  VALUES ('2713', '500109', '重庆市', '重庆市', '北碚区', '重庆市北碚区');
INSERT INTO  s_area_code  VALUES ('2714', '500110', '重庆市', '重庆市', '万盛区', '重庆市万盛区');
INSERT INTO  s_area_code  VALUES ('2715', '500111', '重庆市', '重庆市', '双桥区', '重庆市双桥区');
INSERT INTO  s_area_code  VALUES ('2716', '500112', '重庆市', '重庆市', '渝北区', '重庆市渝北区');
INSERT INTO  s_area_code  VALUES ('2717', '500113', '重庆市', '重庆市', '巴南区', '重庆市巴南区');
INSERT INTO  s_area_code  VALUES ('2718', '500114', '重庆市', '重庆市', '黔江区', '重庆市黔江区');
INSERT INTO  s_area_code  VALUES ('2719', '500115', '重庆市', '重庆市', '长寿区', '重庆市长寿区');
INSERT INTO  s_area_code  VALUES ('2720', '500200', '重庆市', '重庆市', '县', '重庆市县');
INSERT INTO  s_area_code  VALUES ('2721', '500222', '重庆市', '重庆市', '綦江县', '重庆市綦江县');
INSERT INTO  s_area_code  VALUES ('2722', '500223', '重庆市', '重庆市', '潼南县', '重庆市潼南县');
INSERT INTO  s_area_code  VALUES ('2723', '500224', '重庆市', '重庆市', '铜梁县', '重庆市铜梁县');
INSERT INTO  s_area_code  VALUES ('2724', '500225', '重庆市', '重庆市', '大足县', '重庆市大足县');
INSERT INTO  s_area_code  VALUES ('2725', '500226', '重庆市', '重庆市', '荣昌县', '重庆市荣昌县');
INSERT INTO  s_area_code  VALUES ('2726', '500227', '重庆市', '重庆市', '璧山县', '重庆市璧山县');
INSERT INTO  s_area_code  VALUES ('2727', '500228', '重庆市', '重庆市', '梁平县', '重庆市梁平县');
INSERT INTO  s_area_code  VALUES ('2728', '500229', '重庆市', '重庆市', '城口县', '重庆市城口县');
INSERT INTO  s_area_code  VALUES ('2729', '500230', '重庆市', '重庆市', '丰都县', '重庆市丰都县');
INSERT INTO  s_area_code  VALUES ('2730', '500231', '重庆市', '重庆市', '垫江县', '重庆市垫江县');
INSERT INTO  s_area_code  VALUES ('2731', '500232', '重庆市', '重庆市', '武隆县', '重庆市武隆县');
INSERT INTO  s_area_code  VALUES ('2732', '500233', '重庆市', '重庆市', '忠 县', '重庆市忠 县');
INSERT INTO  s_area_code  VALUES ('2733', '500234', '重庆市', '重庆市', '开 县', '重庆市开 县');
INSERT INTO  s_area_code  VALUES ('2734', '500235', '重庆市', '重庆市', '云阳县', '重庆市云阳县');
INSERT INTO  s_area_code  VALUES ('2735', '500236', '重庆市', '重庆市', '奉节县', '重庆市奉节县');
INSERT INTO  s_area_code  VALUES ('2736', '500237', '重庆市', '重庆市', '巫山县', '重庆市巫山县');
INSERT INTO  s_area_code  VALUES ('2737', '500238', '重庆市', '重庆市', '巫溪县', '重庆市巫溪县');
INSERT INTO  s_area_code  VALUES ('2738', '500239', '重庆市', '重庆市', '黔江土家族', '重庆市黔江土家族自治县');
INSERT INTO  s_area_code  VALUES ('2739', '500240', '重庆市', '重庆市', '石柱土家族自治县', '重庆市石柱土家族自治县');
INSERT INTO  s_area_code  VALUES ('2740', '500241', '重庆市', '重庆市', '秀山土家族苗族自治县', '重庆市秀山土家族苗族自治县');
INSERT INTO  s_area_code  VALUES ('2741', '500242', '重庆市', '重庆市', '酉阳土家族苗族自治县', '重庆市酉阳土家族苗族自治县');
INSERT INTO  s_area_code  VALUES ('2742', '500243', '重庆市', '重庆市', '彭水苗族土家族自治县', '重庆市彭水苗族土家族自治县');
INSERT INTO  s_area_code  VALUES ('2743', '500300', '重庆市', '重庆市', '市', '重庆市市');
INSERT INTO  s_area_code  VALUES ('2744', '500381', '重庆市', '重庆市', '江津市', '重庆市江津市');
INSERT INTO  s_area_code  VALUES ('2745', '500382', '重庆市', '重庆市', '合川市', '重庆市合川市');
INSERT INTO  s_area_code  VALUES ('2746', '500383', '重庆市', '重庆市', '永川市', '重庆市永川市');
INSERT INTO  s_area_code  VALUES ('2747', '500384', '重庆市', '重庆市', '南川市', '重庆市南川市');
INSERT INTO  s_area_code  VALUES ('2748', '510000', '四川省', '', '', '四川省');
INSERT INTO  s_area_code  VALUES ('2749', '510100', '四川省', '成都市', '', '四川省成都市');
INSERT INTO  s_area_code  VALUES ('2750', '510101', '四川省', '成都市', '市辖区', '四川省成都市市辖区');
INSERT INTO  s_area_code  VALUES ('2751', '510104', '四川省', '成都市', '锦江区', '四川省成都市锦江区');
INSERT INTO  s_area_code  VALUES ('2752', '510105', '四川省', '成都市', '青羊区', '四川省成都市青羊区');
INSERT INTO  s_area_code  VALUES ('2753', '510106', '四川省', '成都市', '金牛区', '四川省成都市金牛区');
INSERT INTO  s_area_code  VALUES ('2754', '510107', '四川省', '成都市', '武侯区', '四川省成都市武侯区');
INSERT INTO  s_area_code  VALUES ('2755', '510108', '四川省', '成都市', '成华区', '四川省成都市成华区');
INSERT INTO  s_area_code  VALUES ('2756', '510112', '四川省', '成都市', '龙泉驿区', '四川省成都市龙泉驿区');
INSERT INTO  s_area_code  VALUES ('2757', '510113', '四川省', '成都市', '青白江区', '四川省成都市青白江区');
INSERT INTO  s_area_code  VALUES ('2758', '510114', '四川省', '成都市', '新都区', '四川省成都市新都区');
INSERT INTO  s_area_code  VALUES ('2759', '510115', '四川省', '成都市', '温江区', '四川省成都市温江区');
INSERT INTO  s_area_code  VALUES ('2760', '510121', '四川省', '成都市', '金堂县', '四川省金堂县');
INSERT INTO  s_area_code  VALUES ('2761', '510122', '四川省', '成都市', '双流县', '四川省双流县');
INSERT INTO  s_area_code  VALUES ('2762', '510124', '四川省', '成都市', '郫 县', '四川省郫 县');
INSERT INTO  s_area_code  VALUES ('2763', '510129', '四川省', '成都市', '大邑县', '四川省大邑县');
INSERT INTO  s_area_code  VALUES ('2764', '510131', '四川省', '成都市', '蒲江县', '四川省蒲江县');
INSERT INTO  s_area_code  VALUES ('2765', '510132', '四川省', '成都市', '新津县', '四川省新津县');
INSERT INTO  s_area_code  VALUES ('2766', '510181', '四川省', '成都市', '都江堰市', '四川省都江堰市');
INSERT INTO  s_area_code  VALUES ('2767', '510182', '四川省', '成都市', '彭州市', '四川省彭州市');
INSERT INTO  s_area_code  VALUES ('2768', '510183', '四川省', '成都市', '邛崃市', '四川省邛崃市');
INSERT INTO  s_area_code  VALUES ('2769', '510184', '四川省', '成都市', '崇州市', '四川省崇州市');
INSERT INTO  s_area_code  VALUES ('2770', '510300', '四川省', '自贡市', '', '四川省自贡市');
INSERT INTO  s_area_code  VALUES ('2771', '510301', '四川省', '自贡市', '市辖区', '四川省自贡市市辖区');
INSERT INTO  s_area_code  VALUES ('2772', '510302', '四川省', '自贡市', '自流井区', '四川省自贡市自流井区');
INSERT INTO  s_area_code  VALUES ('2773', '510303', '四川省', '自贡市', '贡井区', '四川省自贡市贡井区');
INSERT INTO  s_area_code  VALUES ('2774', '510304', '四川省', '自贡市', '大安区', '四川省自贡市大安区');
INSERT INTO  s_area_code  VALUES ('2775', '510311', '四川省', '自贡市', '沿滩区', '四川省自贡市沿滩区');
INSERT INTO  s_area_code  VALUES ('2776', '510321', '四川省', '自贡市', '荣 县', '四川省荣 县');
INSERT INTO  s_area_code  VALUES ('2777', '510322', '四川省', '自贡市', '富顺县', '四川省富顺县');
INSERT INTO  s_area_code  VALUES ('2778', '510400', '四川省', '攀枝花市', '', '四川省攀枝花市');
INSERT INTO  s_area_code  VALUES ('2779', '510401', '四川省', '攀枝花市', '市辖区', '四川省攀枝花市市辖区');
INSERT INTO  s_area_code  VALUES ('2780', '510402', '四川省', '攀枝花市', '东 区', '四川省攀枝花市东 区');
INSERT INTO  s_area_code  VALUES ('2781', '510403', '四川省', '攀枝花市', '西 区', '四川省攀枝花市西 区');
INSERT INTO  s_area_code  VALUES ('2782', '510411', '四川省', '攀枝花市', '仁和区', '四川省攀枝花市仁和区');
INSERT INTO  s_area_code  VALUES ('2783', '510421', '四川省', '攀枝花市', '米易县', '四川省米易县');
INSERT INTO  s_area_code  VALUES ('2784', '510422', '四川省', '攀枝花市', '盐边县', '四川省盐边县');
INSERT INTO  s_area_code  VALUES ('2785', '510500', '四川省', '泸州市', '', '四川省泸州市');
INSERT INTO  s_area_code  VALUES ('2786', '510501', '四川省', '泸州市', '市辖区', '四川省泸州市市辖区');
INSERT INTO  s_area_code  VALUES ('2787', '510502', '四川省', '泸州市', '江阳区', '四川省泸州市江阳区');
INSERT INTO  s_area_code  VALUES ('2788', '510503', '四川省', '泸州市', '纳溪区', '四川省泸州市纳溪区');
INSERT INTO  s_area_code  VALUES ('2789', '510504', '四川省', '泸州市', '龙马潭区', '四川省泸州市龙马潭区');
INSERT INTO  s_area_code  VALUES ('2790', '510521', '四川省', '泸州市', '泸 县', '四川省泸 县');
INSERT INTO  s_area_code  VALUES ('2791', '510522', '四川省', '泸州市', '合江县', '四川省合江县');
INSERT INTO  s_area_code  VALUES ('2792', '510524', '四川省', '泸州市', '叙永县', '四川省叙永县');
INSERT INTO  s_area_code  VALUES ('2793', '510525', '四川省', '泸州市', '古蔺县', '四川省古蔺县');
INSERT INTO  s_area_code  VALUES ('2794', '510600', '四川省', '德阳市', '', '四川省德阳市');
INSERT INTO  s_area_code  VALUES ('2795', '510601', '四川省', '德阳市', '市辖区', '四川省德阳市市辖区');
INSERT INTO  s_area_code  VALUES ('2796', '510603', '四川省', '德阳市', '旌阳区', '四川省德阳市旌阳区');
INSERT INTO  s_area_code  VALUES ('2797', '510623', '四川省', '德阳市', '中江县', '四川省中江县');
INSERT INTO  s_area_code  VALUES ('2798', '510626', '四川省', '德阳市', '罗江县', '四川省罗江县');
INSERT INTO  s_area_code  VALUES ('2799', '510681', '四川省', '德阳市', '广汉市', '四川省广汉市');
INSERT INTO  s_area_code  VALUES ('2800', '510682', '四川省', '德阳市', '什邡市', '四川省什邡市');
INSERT INTO  s_area_code  VALUES ('2801', '510683', '四川省', '德阳市', '绵竹市', '四川省绵竹市');
INSERT INTO  s_area_code  VALUES ('2802', '510700', '四川省', '绵阳市', '', '四川省绵阳市');
INSERT INTO  s_area_code  VALUES ('2803', '510701', '四川省', '绵阳市', '市辖区', '四川省绵阳市市辖区');
INSERT INTO  s_area_code  VALUES ('2804', '510703', '四川省', '绵阳市', '涪城区', '四川省绵阳市涪城区');
INSERT INTO  s_area_code  VALUES ('2805', '510704', '四川省', '绵阳市', '游仙区', '四川省绵阳市游仙区');
INSERT INTO  s_area_code  VALUES ('2806', '510722', '四川省', '绵阳市', '三台县', '四川省三台县');
INSERT INTO  s_area_code  VALUES ('2807', '510723', '四川省', '绵阳市', '盐亭县', '四川省盐亭县');
INSERT INTO  s_area_code  VALUES ('2808', '510724', '四川省', '绵阳市', '安 县', '四川省安 县');
INSERT INTO  s_area_code  VALUES ('2809', '510725', '四川省', '绵阳市', '梓潼县', '四川省梓潼县');
INSERT INTO  s_area_code  VALUES ('2810', '510726', '四川省', '绵阳市', '北川羌族自治县', '四川省北川羌族自治县');
INSERT INTO  s_area_code  VALUES ('2811', '510727', '四川省', '绵阳市', '平武县', '四川省平武县');
INSERT INTO  s_area_code  VALUES ('2812', '510781', '四川省', '绵阳市', '江油市', '四川省江油市');
INSERT INTO  s_area_code  VALUES ('2813', '510800', '四川省', '广元市', '', '四川省广元市');
INSERT INTO  s_area_code  VALUES ('2814', '510801', '四川省', '广元市', '市辖区', '四川省广元市市辖区');
INSERT INTO  s_area_code  VALUES ('2815', '510802', '四川省', '广元市', '市中区', '四川省广元市市中区');
INSERT INTO  s_area_code  VALUES ('2816', '510811', '四川省', '广元市', '元坝区', '四川省广元市元坝区');
INSERT INTO  s_area_code  VALUES ('2817', '510812', '四川省', '广元市', '朝天区', '四川省广元市朝天区');
INSERT INTO  s_area_code  VALUES ('2818', '510821', '四川省', '广元市', '旺苍县', '四川省旺苍县');
INSERT INTO  s_area_code  VALUES ('2819', '510822', '四川省', '广元市', '青川县', '四川省青川县');
INSERT INTO  s_area_code  VALUES ('2820', '510823', '四川省', '广元市', '剑阁县', '四川省剑阁县');
INSERT INTO  s_area_code  VALUES ('2821', '510824', '四川省', '广元市', '苍溪县', '四川省苍溪县');
INSERT INTO  s_area_code  VALUES ('2822', '510900', '四川省', '遂宁市', '', '四川省遂宁市');
INSERT INTO  s_area_code  VALUES ('2823', '510901', '四川省', '遂宁市', '市辖区', '四川省遂宁市市辖区');
INSERT INTO  s_area_code  VALUES ('2824', '510902', '四川省', '遂宁市', '市中区', '四川省遂宁市市中区');
INSERT INTO  s_area_code  VALUES ('2825', '510903', '四川省', '遂宁市', '船山区', '四川省遂宁市船山区');
INSERT INTO  s_area_code  VALUES ('2826', '510904', '四川省', '遂宁市', '安居区', '四川省遂宁市安居区');
INSERT INTO  s_area_code  VALUES ('2827', '510921', '四川省', '遂宁市', '蓬溪县', '四川省蓬溪县');
INSERT INTO  s_area_code  VALUES ('2828', '510922', '四川省', '遂宁市', '射洪县', '四川省射洪县');
INSERT INTO  s_area_code  VALUES ('2829', '510923', '四川省', '遂宁市', '大英县', '四川省大英县');
INSERT INTO  s_area_code  VALUES ('2830', '511000', '四川省', '内江市', '', '四川省内江市');
INSERT INTO  s_area_code  VALUES ('2831', '511001', '四川省', '内江市', '市辖区', '四川省内江市市辖区');
INSERT INTO  s_area_code  VALUES ('2832', '511002', '四川省', '内江市', '市中区', '四川省内江市市中区');
INSERT INTO  s_area_code  VALUES ('2833', '511011', '四川省', '内江市', '东兴区', '四川省内江市东兴区');
INSERT INTO  s_area_code  VALUES ('2834', '511024', '四川省', '内江市', '威远县', '四川省威远县');
INSERT INTO  s_area_code  VALUES ('2835', '511025', '四川省', '内江市', '资中县', '四川省资中县');
INSERT INTO  s_area_code  VALUES ('2836', '511028', '四川省', '内江市', '隆昌县', '四川省隆昌县');
INSERT INTO  s_area_code  VALUES ('2837', '511100', '四川省', '乐山市', '', '四川省乐山市');
INSERT INTO  s_area_code  VALUES ('2838', '511101', '四川省', '乐山市', '市辖区', '四川省乐山市市辖区');
INSERT INTO  s_area_code  VALUES ('2839', '511102', '四川省', '乐山市', '市中区', '四川省乐山市市中区');
INSERT INTO  s_area_code  VALUES ('2840', '511111', '四川省', '乐山市', '沙湾区', '四川省乐山市沙湾区');
INSERT INTO  s_area_code  VALUES ('2841', '511112', '四川省', '乐山市', '五通桥区', '四川省乐山市五通桥区');
INSERT INTO  s_area_code  VALUES ('2842', '511113', '四川省', '乐山市', '金口河区', '四川省乐山市金口河区');
INSERT INTO  s_area_code  VALUES ('2843', '511123', '四川省', '乐山市', '犍为县', '四川省犍为县');
INSERT INTO  s_area_code  VALUES ('2844', '511124', '四川省', '乐山市', '井研县', '四川省井研县');
INSERT INTO  s_area_code  VALUES ('2845', '511126', '四川省', '乐山市', '夹江县', '四川省夹江县');
INSERT INTO  s_area_code  VALUES ('2846', '511129', '四川省', '乐山市', '沐川县', '四川省沐川县');
INSERT INTO  s_area_code  VALUES ('2847', '511132', '四川省', '乐山市', '峨边彝族自治县', '四川省峨边彝族自治县');
INSERT INTO  s_area_code  VALUES ('2848', '511133', '四川省', '乐山市', '马边彝族自治县', '四川省马边彝族自治县');
INSERT INTO  s_area_code  VALUES ('2849', '511181', '四川省', '乐山市', '峨眉山市', '四川省峨眉山市');
INSERT INTO  s_area_code  VALUES ('2850', '511300', '四川省', '南充市', '', '四川省南充市');
INSERT INTO  s_area_code  VALUES ('2851', '511301', '四川省', '南充市', '市辖区', '四川省南充市市辖区');
INSERT INTO  s_area_code  VALUES ('2852', '511302', '四川省', '南充市', '顺庆区', '四川省南充市顺庆区');
INSERT INTO  s_area_code  VALUES ('2853', '511303', '四川省', '南充市', '高坪区', '四川省南充市高坪区');
INSERT INTO  s_area_code  VALUES ('2854', '511304', '四川省', '南充市', '嘉陵区', '四川省南充市嘉陵区');
INSERT INTO  s_area_code  VALUES ('2855', '511321', '四川省', '南充市', '南部县', '四川省南部县');
INSERT INTO  s_area_code  VALUES ('2856', '511322', '四川省', '南充市', '营山县', '四川省营山县');
INSERT INTO  s_area_code  VALUES ('2857', '511323', '四川省', '南充市', '蓬安县', '四川省蓬安县');
INSERT INTO  s_area_code  VALUES ('2858', '511324', '四川省', '南充市', '仪陇县', '四川省仪陇县');
INSERT INTO  s_area_code  VALUES ('2859', '511325', '四川省', '南充市', '西充县', '四川省西充县');
INSERT INTO  s_area_code  VALUES ('2860', '511381', '四川省', '南充市', '阆中市', '四川省阆中市');
INSERT INTO  s_area_code  VALUES ('2861', '511400', '四川省', '眉山市', '', '四川省眉山市');
INSERT INTO  s_area_code  VALUES ('2862', '511401', '四川省', '眉山市', '市辖区', '四川省眉山市市辖区');
INSERT INTO  s_area_code  VALUES ('2863', '511402', '四川省', '眉山市', '东坡区', '四川省眉山市东坡区');
INSERT INTO  s_area_code  VALUES ('2864', '511421', '四川省', '眉山市', '仁寿县', '四川省仁寿县');
INSERT INTO  s_area_code  VALUES ('2865', '511422', '四川省', '眉山市', '彭山县', '四川省彭山县');
INSERT INTO  s_area_code  VALUES ('2866', '511423', '四川省', '眉山市', '洪雅县', '四川省洪雅县');
INSERT INTO  s_area_code  VALUES ('2867', '511424', '四川省', '眉山市', '丹棱县', '四川省丹棱县');
INSERT INTO  s_area_code  VALUES ('2868', '511425', '四川省', '眉山市', '青神县', '四川省青神县');
INSERT INTO  s_area_code  VALUES ('2869', '511500', '四川省', '宜宾市', '', '四川省宜宾市');
INSERT INTO  s_area_code  VALUES ('2870', '511501', '四川省', '宜宾市', '市辖区', '四川省宜宾市市辖区');
INSERT INTO  s_area_code  VALUES ('2871', '511502', '四川省', '宜宾市', '翠屏区', '四川省宜宾市翠屏区');
INSERT INTO  s_area_code  VALUES ('2872', '511521', '四川省', '宜宾市', '宜宾县', '四川省宜宾县');
INSERT INTO  s_area_code  VALUES ('2873', '511522', '四川省', '宜宾市', '南溪县', '四川省南溪县');
INSERT INTO  s_area_code  VALUES ('2874', '511523', '四川省', '宜宾市', '江安县', '四川省江安县');
INSERT INTO  s_area_code  VALUES ('2875', '511524', '四川省', '宜宾市', '长宁县', '四川省长宁县');
INSERT INTO  s_area_code  VALUES ('2876', '511525', '四川省', '宜宾市', '高 县', '四川省高 县');
INSERT INTO  s_area_code  VALUES ('2877', '511526', '四川省', '宜宾市', '珙 县', '四川省珙 县');
INSERT INTO  s_area_code  VALUES ('2878', '511527', '四川省', '宜宾市', '筠连县', '四川省筠连县');
INSERT INTO  s_area_code  VALUES ('2879', '511528', '四川省', '宜宾市', '兴文县', '四川省兴文县');
INSERT INTO  s_area_code  VALUES ('2880', '511529', '四川省', '宜宾市', '屏山县', '四川省屏山县');
INSERT INTO  s_area_code  VALUES ('2881', '511600', '四川省', '广安市', '', '四川省广安市');
INSERT INTO  s_area_code  VALUES ('2882', '511601', '四川省', '广安市', '市辖区', '四川省广安市市辖区');
INSERT INTO  s_area_code  VALUES ('2883', '511602', '四川省', '广安市', '广安区', '四川省广安市广安区');
INSERT INTO  s_area_code  VALUES ('2884', '511621', '四川省', '广安市', '岳池县', '四川省岳池县');
INSERT INTO  s_area_code  VALUES ('2885', '511622', '四川省', '广安市', '武胜县', '四川省武胜县');
INSERT INTO  s_area_code  VALUES ('2886', '511623', '四川省', '广安市', '邻水县', '四川省邻水县');
INSERT INTO  s_area_code  VALUES ('2887', '511681', '四川省', '广安市', '华蓥市', '四川省华蓥市');
INSERT INTO  s_area_code  VALUES ('2888', '511700', '四川省', '达州市', '', '四川省达州市');
INSERT INTO  s_area_code  VALUES ('2889', '511701', '四川省', '达州市', '市辖区', '四川省达州市市辖区');
INSERT INTO  s_area_code  VALUES ('2890', '511702', '四川省', '达州市', '通川区', '四川省达州市通川区');
INSERT INTO  s_area_code  VALUES ('2891', '511721', '四川省', '达州市', '达 县', '四川省达 县');
INSERT INTO  s_area_code  VALUES ('2892', '511722', '四川省', '达州市', '宣汉县', '四川省宣汉县');
INSERT INTO  s_area_code  VALUES ('2893', '511723', '四川省', '达州市', '开江县', '四川省开江县');
INSERT INTO  s_area_code  VALUES ('2894', '511724', '四川省', '达州市', '大竹县', '四川省大竹县');
INSERT INTO  s_area_code  VALUES ('2895', '511725', '四川省', '达州市', '渠 县', '四川省渠 县');
INSERT INTO  s_area_code  VALUES ('2896', '511781', '四川省', '达州市', '万源市', '四川省万源市');
INSERT INTO  s_area_code  VALUES ('2897', '511800', '四川省', '雅安市', '雅安市', '四川省雅安市雅安市');
INSERT INTO  s_area_code  VALUES ('2898', '511801', '四川省', '雅安市', '市辖区', '四川省雅安市市辖区');
INSERT INTO  s_area_code  VALUES ('2899', '511802', '四川省', '雅安市', '雨城区', '四川省雅安市雨城区');
INSERT INTO  s_area_code  VALUES ('2900', '511821', '四川省', '雅安市', '名山县', '四川省名山县');
INSERT INTO  s_area_code  VALUES ('2901', '511822', '四川省', '雅安市', '荥经县', '四川省荥经县');
INSERT INTO  s_area_code  VALUES ('2902', '511823', '四川省', '雅安市', '汉源县', '四川省汉源县');
INSERT INTO  s_area_code  VALUES ('2903', '511824', '四川省', '雅安市', '石棉县', '四川省石棉县');
INSERT INTO  s_area_code  VALUES ('2904', '511825', '四川省', '雅安市', '天全县', '四川省天全县');
INSERT INTO  s_area_code  VALUES ('2905', '511826', '四川省', '雅安市', '芦山县', '四川省芦山县');
INSERT INTO  s_area_code  VALUES ('2906', '511827', '四川省', '雅安市', '宝兴县', '四川省宝兴县');
INSERT INTO  s_area_code  VALUES ('2907', '511900', '四川省', '巴中市', '巴中市', '四川省巴中市巴中市');
INSERT INTO  s_area_code  VALUES ('2908', '511901', '四川省', '巴中市', '市辖区', '四川省巴中市市辖区');
INSERT INTO  s_area_code  VALUES ('2909', '511902', '四川省', '巴中市', '巴州区', '四川省巴中市巴州区');
INSERT INTO  s_area_code  VALUES ('2910', '511921', '四川省', '巴中市', '通江县', '四川省通江县');
INSERT INTO  s_area_code  VALUES ('2911', '511922', '四川省', '巴中市', '南江县', '四川省南江县');
INSERT INTO  s_area_code  VALUES ('2912', '511923', '四川省', '巴中市', '平昌县', '四川省平昌县');
INSERT INTO  s_area_code  VALUES ('2913', '512000', '四川省', '资阳市', '', '四川省资阳市');
INSERT INTO  s_area_code  VALUES ('2914', '512001', '四川省', '资阳市', '市辖区', '四川省资阳市市辖区');
INSERT INTO  s_area_code  VALUES ('2915', '512002', '四川省', '资阳市', '雁江区', '四川省资阳市雁江区');
INSERT INTO  s_area_code  VALUES ('2916', '512021', '四川省', '资阳市', '安岳县', '四川省安岳县');
INSERT INTO  s_area_code  VALUES ('2917', '512022', '四川省', '资阳市', '乐至县', '四川省乐至县');
INSERT INTO  s_area_code  VALUES ('2918', '512081', '四川省', '资阳市', '简阳市', '四川省简阳市');
INSERT INTO  s_area_code  VALUES ('2919', '513100', '四川省', '资阳市', '雅安地区', '四川省雅安地区 ');
INSERT INTO  s_area_code  VALUES ('2920', '513101', '四川省', '资阳市', '雅安市', '四川省雅安市 ');
INSERT INTO  s_area_code  VALUES ('2921', '513122', '四川省', '资阳市', '名山县', '四川省名山县 ');
INSERT INTO  s_area_code  VALUES ('2922', '513123', '四川省', '资阳市', '荥经县', '四川省荥经县 ');
INSERT INTO  s_area_code  VALUES ('2923', '513124', '四川省', '资阳市', '汉源县', '四川省汉源县 ');
INSERT INTO  s_area_code  VALUES ('2924', '513125', '四川省', '资阳市', '石棉县', '四川省石棉县 ');
INSERT INTO  s_area_code  VALUES ('2925', '513126', '四川省', '资阳市', '天全县 ', '四川省天全县 ');
INSERT INTO  s_area_code  VALUES ('2926', '513127', '四川省', '资阳市', '芦山县 ', '四川省芦山县 ');
INSERT INTO  s_area_code  VALUES ('2927', '513128', '四川省', '资阳市', '宝兴县', '四川省宝兴县 ');
INSERT INTO  s_area_code  VALUES ('2928', '513200', '四川省', '阿坝藏族羌族自治州', '', '四川省阿坝藏族羌族自治州');
INSERT INTO  s_area_code  VALUES ('2929', '513221', '四川省', '阿坝藏族羌族自治州', '汶川县', '四川省汶川县');
INSERT INTO  s_area_code  VALUES ('2930', '513222', '四川省', '阿坝藏族羌族自治州', '理 县', '四川省理 县');
INSERT INTO  s_area_code  VALUES ('2931', '513223', '四川省', '阿坝藏族羌族自治州', '茂 县', '四川省茂 县');
INSERT INTO  s_area_code  VALUES ('2932', '513224', '四川省', '阿坝藏族羌族自治州', '松潘县', '四川省松潘县');
INSERT INTO  s_area_code  VALUES ('2933', '513225', '四川省', '阿坝藏族羌族自治州', '九寨沟县', '四川省九寨沟县');
INSERT INTO  s_area_code  VALUES ('2934', '513226', '四川省', '阿坝藏族羌族自治州', '金川县', '四川省金川县');
INSERT INTO  s_area_code  VALUES ('2935', '513227', '四川省', '阿坝藏族羌族自治州', '小金县', '四川省小金县');
INSERT INTO  s_area_code  VALUES ('2936', '513228', '四川省', '阿坝藏族羌族自治州', '黑水县', '四川省黑水县');
INSERT INTO  s_area_code  VALUES ('2937', '513229', '四川省', '阿坝藏族羌族自治州', '马尔康县', '四川省马尔康县');
INSERT INTO  s_area_code  VALUES ('2938', '513230', '四川省', '阿坝藏族羌族自治州', '壤塘县', '四川省壤塘县');
INSERT INTO  s_area_code  VALUES ('2939', '513231', '四川省', '阿坝藏族羌族自治州', '阿坝县', '四川省阿坝县');
INSERT INTO  s_area_code  VALUES ('2940', '513232', '四川省', '阿坝藏族羌族自治州', '若尔盖县', '四川省若尔盖县');
INSERT INTO  s_area_code  VALUES ('2941', '513233', '四川省', '阿坝藏族羌族自治州', '红原县', '四川省红原县');
INSERT INTO  s_area_code  VALUES ('2942', '513300', '四川省', '甘孜藏族自治州', '', '四川省甘孜藏族自治州');
INSERT INTO  s_area_code  VALUES ('2943', '513321', '四川省', '甘孜藏族自治州', '康定县', '四川省康定县');
INSERT INTO  s_area_code  VALUES ('2944', '513322', '四川省', '甘孜藏族自治州', '泸定县', '四川省泸定县');
INSERT INTO  s_area_code  VALUES ('2945', '513323', '四川省', '甘孜藏族自治州', '丹巴县', '四川省丹巴县');
INSERT INTO  s_area_code  VALUES ('2946', '513324', '四川省', '甘孜藏族自治州', '九龙县', '四川省九龙县');
INSERT INTO  s_area_code  VALUES ('2947', '513325', '四川省', '甘孜藏族自治州', '雅江县', '四川省雅江县');
INSERT INTO  s_area_code  VALUES ('2948', '513326', '四川省', '甘孜藏族自治州', '道孚县', '四川省道孚县');
INSERT INTO  s_area_code  VALUES ('2949', '513327', '四川省', '甘孜藏族自治州', '炉霍县', '四川省炉霍县');
INSERT INTO  s_area_code  VALUES ('2950', '513328', '四川省', '甘孜藏族自治州', '甘孜县', '四川省甘孜县');
INSERT INTO  s_area_code  VALUES ('2951', '513329', '四川省', '甘孜藏族自治州', '新龙县', '四川省新龙县');
INSERT INTO  s_area_code  VALUES ('2952', '513330', '四川省', '甘孜藏族自治州', '德格县', '四川省德格县');
INSERT INTO  s_area_code  VALUES ('2953', '513331', '四川省', '甘孜藏族自治州', '白玉县', '四川省白玉县');
INSERT INTO  s_area_code  VALUES ('2954', '513332', '四川省', '甘孜藏族自治州', '石渠县', '四川省石渠县');
INSERT INTO  s_area_code  VALUES ('2955', '513333', '四川省', '甘孜藏族自治州', '色达县', '四川省色达县');
INSERT INTO  s_area_code  VALUES ('2956', '513334', '四川省', '甘孜藏族自治州', '理塘县', '四川省理塘县');
INSERT INTO  s_area_code  VALUES ('2957', '513335', '四川省', '甘孜藏族自治州', '巴塘县', '四川省巴塘县');
INSERT INTO  s_area_code  VALUES ('2958', '513336', '四川省', '甘孜藏族自治州', '乡城县', '四川省乡城县');
INSERT INTO  s_area_code  VALUES ('2959', '513337', '四川省', '甘孜藏族自治州', '稻城县', '四川省稻城县');
INSERT INTO  s_area_code  VALUES ('2960', '513338', '四川省', '甘孜藏族自治州', '得荣县', '四川省得荣县');
INSERT INTO  s_area_code  VALUES ('2961', '513400', '四川省', '凉山彝族自治州', '', '四川省凉山彝族自治州');
INSERT INTO  s_area_code  VALUES ('2962', '513401', '四川省', '凉山彝族自治州', '西昌市', '四川省西昌市');
INSERT INTO  s_area_code  VALUES ('2963', '513422', '四川省', '凉山彝族自治州', '木里藏族自治县', '四川省木里藏族自治县');
INSERT INTO  s_area_code  VALUES ('2964', '513423', '四川省', '凉山彝族自治州', '盐源县', '四川省盐源县');
INSERT INTO  s_area_code  VALUES ('2965', '513424', '四川省', '凉山彝族自治州', '德昌县', '四川省德昌县');
INSERT INTO  s_area_code  VALUES ('2966', '513425', '四川省', '凉山彝族自治州', '会理县', '四川省会理县');
INSERT INTO  s_area_code  VALUES ('2967', '513426', '四川省', '凉山彝族自治州', '会东县', '四川省会东县');
INSERT INTO  s_area_code  VALUES ('2968', '513427', '四川省', '凉山彝族自治州', '宁南县', '四川省宁南县');
INSERT INTO  s_area_code  VALUES ('2969', '513428', '四川省', '凉山彝族自治州', '普格县', '四川省普格县');
INSERT INTO  s_area_code  VALUES ('2970', '513429', '四川省', '凉山彝族自治州', '布拖县', '四川省布拖县');
INSERT INTO  s_area_code  VALUES ('2971', '513430', '四川省', '凉山彝族自治州', '金阳县', '四川省金阳县');
INSERT INTO  s_area_code  VALUES ('2972', '513431', '四川省', '凉山彝族自治州', '昭觉县', '四川省昭觉县');
INSERT INTO  s_area_code  VALUES ('2973', '513432', '四川省', '凉山彝族自治州', '喜德县', '四川省喜德县');
INSERT INTO  s_area_code  VALUES ('2974', '513433', '四川省', '凉山彝族自治州', '冕宁县', '四川省冕宁县');
INSERT INTO  s_area_code  VALUES ('2975', '513434', '四川省', '凉山彝族自治州', '越西县', '四川省越西县');
INSERT INTO  s_area_code  VALUES ('2976', '513435', '四川省', '凉山彝族自治州', '甘洛县', '四川省甘洛县');
INSERT INTO  s_area_code  VALUES ('2977', '513436', '四川省', '凉山彝族自治州', '美姑县', '四川省美姑县');
INSERT INTO  s_area_code  VALUES ('2978', '513437', '四川省', '凉山彝族自治州', '雷波县', '四川省雷波县');
INSERT INTO  s_area_code  VALUES ('2979', '513700', '四川省', '巴中市', '巴中地区 ', '四川省巴中地区 ');
INSERT INTO  s_area_code  VALUES ('2980', '513701', '四川省', '巴中市', '巴中县', '四川省巴中县 ');
INSERT INTO  s_area_code  VALUES ('2981', '513721', '四川省', '巴中市', '通江县', '四川省通江县 ');
INSERT INTO  s_area_code  VALUES ('2982', '513722', '四川省', '巴中市', '南江县', '四川省南江县 ');
INSERT INTO  s_area_code  VALUES ('2983', '513723', '四川省', '巴中市', '平昌县', '四川省平昌县 ');
INSERT INTO  s_area_code  VALUES ('2984', '513800', '四川省', '巴中市', '眉山地区', '四川省眉山地区 ');
INSERT INTO  s_area_code  VALUES ('2985', '513821', '四川省', '巴中市', '眉山县', '四川省眉山县 ');
INSERT INTO  s_area_code  VALUES ('2986', '513822', '四川省', '巴中市', '仁寿县', '四川省仁寿县 ');
INSERT INTO  s_area_code  VALUES ('2987', '513823', '四川省', '巴中市', '彭山县', '四川省彭山县 ');
INSERT INTO  s_area_code  VALUES ('2988', '513824', '四川省', '巴中市', '洪雅县', '四川省洪雅县 ');
INSERT INTO  s_area_code  VALUES ('2989', '513825', '四川省', '巴中市', '丹棱县 ', '四川省丹棱县 ');
INSERT INTO  s_area_code  VALUES ('2990', '513826', '四川省', '巴中市', '青神县', '四川省青神县 ');
INSERT INTO  s_area_code  VALUES ('2991', '513900', '四川省', '巴中市', '资阳市', '四川省资阳地区 ');
INSERT INTO  s_area_code  VALUES ('2992', '513901', '四川省', '巴中市', '资阳市', '四川省资阳市 ');
INSERT INTO  s_area_code  VALUES ('2993', '513902', '四川省', '巴中市', '资阳市', '四川省简阳市 ');
INSERT INTO  s_area_code  VALUES ('2994', '513921', '四川省', '巴中市', '资阳市', '四川省安岳县 ');
INSERT INTO  s_area_code  VALUES ('2995', '513922', '四川省', '巴中市', '资阳市', '四川省乐至县 ');
INSERT INTO  s_area_code  VALUES ('2996', '520000', '贵州省', '', '', '贵州省');
INSERT INTO  s_area_code  VALUES ('2997', '520100', '贵州省', '贵阳市', '', '贵州省贵阳市');
INSERT INTO  s_area_code  VALUES ('2998', '520101', '贵州省', '贵阳市', '市辖区', '贵州省贵阳市市辖区');
INSERT INTO  s_area_code  VALUES ('2999', '520102', '贵州省', '贵阳市', '南明区', '贵州省贵阳市南明区');
INSERT INTO  s_area_code  VALUES ('3000', '520103', '贵州省', '贵阳市', '云岩区', '贵州省贵阳市云岩区');
INSERT INTO  s_area_code  VALUES ('3001', '520111', '贵州省', '贵阳市', '花溪区', '贵州省贵阳市花溪区');
INSERT INTO  s_area_code  VALUES ('3002', '520112', '贵州省', '贵阳市', '乌当区', '贵州省贵阳市乌当区');
INSERT INTO  s_area_code  VALUES ('3003', '520113', '贵州省', '贵阳市', '白云区', '贵州省贵阳市白云区');
INSERT INTO  s_area_code  VALUES ('3004', '520114', '贵州省', '贵阳市', '小河区', '贵州省贵阳市小河区');
INSERT INTO  s_area_code  VALUES ('3005', '520121', '贵州省', '贵阳市', '开阳县', '贵州省开阳县');
INSERT INTO  s_area_code  VALUES ('3006', '520122', '贵州省', '贵阳市', '息烽县', '贵州省息烽县');
INSERT INTO  s_area_code  VALUES ('3007', '520123', '贵州省', '贵阳市', '修文县', '贵州省修文县');
INSERT INTO  s_area_code  VALUES ('3008', '520181', '贵州省', '贵阳市', '清镇市', '贵州省清镇市');
INSERT INTO  s_area_code  VALUES ('3009', '520200', '贵州省', '六盘水市', '', '贵州省六盘水市');
INSERT INTO  s_area_code  VALUES ('3010', '520201', '贵州省', '六盘水市', '钟山区', '贵州省钟山区');
INSERT INTO  s_area_code  VALUES ('3011', '520203', '贵州省', '六盘水市', '六枝特区', '贵州省六枝特区');
INSERT INTO  s_area_code  VALUES ('3012', '520221', '贵州省', '六盘水市', '水城县', '贵州省水城县');
INSERT INTO  s_area_code  VALUES ('3013', '520222', '贵州省', '六盘水市', '盘 县', '贵州省盘 县');
INSERT INTO  s_area_code  VALUES ('3014', '520300', '贵州省', '遵义市', '', '贵州省遵义市');
INSERT INTO  s_area_code  VALUES ('3015', '520301', '贵州省', '遵义市', '市辖区', '贵州省遵义市市辖区');
INSERT INTO  s_area_code  VALUES ('3016', '520302', '贵州省', '遵义市', '红花岗区', '贵州省遵义市红花岗区');
INSERT INTO  s_area_code  VALUES ('3017', '520303', '贵州省', '遵义市', '汇川区', '贵州省遵义市汇川区');
INSERT INTO  s_area_code  VALUES ('3018', '520321', '贵州省', '遵义市', '遵义县', '贵州省遵义县');
INSERT INTO  s_area_code  VALUES ('3019', '520322', '贵州省', '遵义市', '桐梓县', '贵州省桐梓县');
INSERT INTO  s_area_code  VALUES ('3020', '520323', '贵州省', '遵义市', '绥阳县', '贵州省绥阳县');
INSERT INTO  s_area_code  VALUES ('3021', '520324', '贵州省', '遵义市', '正安县', '贵州省正安县');
INSERT INTO  s_area_code  VALUES ('3022', '520325', '贵州省', '遵义市', '道真仡佬族苗族自治县', '贵州省道真仡佬族苗族自治县');
INSERT INTO  s_area_code  VALUES ('3023', '520326', '贵州省', '遵义市', '务川仡佬族苗族自治县', '贵州省务川仡佬族苗族自治县');
INSERT INTO  s_area_code  VALUES ('3024', '520327', '贵州省', '遵义市', '凤冈县', '贵州省凤冈县');
INSERT INTO  s_area_code  VALUES ('3025', '520328', '贵州省', '遵义市', '湄潭县', '贵州省湄潭县');
INSERT INTO  s_area_code  VALUES ('3026', '520329', '贵州省', '遵义市', '余庆县', '贵州省余庆县');
INSERT INTO  s_area_code  VALUES ('3027', '520330', '贵州省', '遵义市', '习水县', '贵州省习水县');
INSERT INTO  s_area_code  VALUES ('3028', '520381', '贵州省', '遵义市', '赤水市', '贵州省赤水市');
INSERT INTO  s_area_code  VALUES ('3029', '520382', '贵州省', '遵义市', '仁怀市', '贵州省仁怀市');
INSERT INTO  s_area_code  VALUES ('3030', '520400', '贵州省', '安顺市', '', '贵州省安顺市');
INSERT INTO  s_area_code  VALUES ('3031', '520401', '贵州省', '安顺市', '市辖区', '贵州省安顺市市辖区');
INSERT INTO  s_area_code  VALUES ('3032', '520402', '贵州省', '安顺市', '西秀区', '贵州省安顺市西秀区');
INSERT INTO  s_area_code  VALUES ('3033', '520421', '贵州省', '安顺市', '平坝县', '贵州省平坝县');
INSERT INTO  s_area_code  VALUES ('3034', '520422', '贵州省', '安顺市', '普定县', '贵州省普定县');
INSERT INTO  s_area_code  VALUES ('3035', '520423', '贵州省', '安顺市', '镇宁布依族苗族自治县', '贵州省镇宁布依族苗族自治县');
INSERT INTO  s_area_code  VALUES ('3036', '520424', '贵州省', '安顺市', '关岭布依族苗族自治县', '贵州省关岭布依族苗族自治县');
INSERT INTO  s_area_code  VALUES ('3037', '520425', '贵州省', '安顺市', '紫云苗族布依族自治县', '贵州省紫云苗族布依族自治县');
INSERT INTO  s_area_code  VALUES ('3038', '522200', '贵州省', '铜仁地区', '', '贵州省铜仁地区');
INSERT INTO  s_area_code  VALUES ('3039', '522201', '贵州省', '铜仁地区', '铜仁市', '贵州省铜仁市');
INSERT INTO  s_area_code  VALUES ('3040', '522222', '贵州省', '铜仁地区', '江口县', '贵州省江口县');
INSERT INTO  s_area_code  VALUES ('3041', '522223', '贵州省', '铜仁地区', '玉屏侗族自治县', '贵州省玉屏侗族自治县');
INSERT INTO  s_area_code  VALUES ('3042', '522224', '贵州省', '铜仁地区', '石阡县', '贵州省石阡县');
INSERT INTO  s_area_code  VALUES ('3043', '522225', '贵州省', '铜仁地区', '思南县', '贵州省思南县');
INSERT INTO  s_area_code  VALUES ('3044', '522226', '贵州省', '铜仁地区', '印江土家族苗族自治县', '贵州省印江土家族苗族自治县');
INSERT INTO  s_area_code  VALUES ('3045', '522227', '贵州省', '铜仁地区', '德江县', '贵州省德江县');
INSERT INTO  s_area_code  VALUES ('3046', '522228', '贵州省', '铜仁地区', '沿河土家族自治县', '贵州省沿河土家族自治县');
INSERT INTO  s_area_code  VALUES ('3047', '522229', '贵州省', '铜仁地区', '松桃苗族自治县', '贵州省松桃苗族自治县');
INSERT INTO  s_area_code  VALUES ('3048', '522230', '贵州省', '铜仁地区', '万山特区', '贵州省万山特区');
INSERT INTO  s_area_code  VALUES ('3049', '522300', '贵州省', '黔西南布依族苗族自治州', '', '贵州省黔西南布依族苗族自治州');
INSERT INTO  s_area_code  VALUES ('3050', '522301', '贵州省', '黔西南布依族苗族自治州', '兴义市', '贵州省兴义市');
INSERT INTO  s_area_code  VALUES ('3051', '522322', '贵州省', '黔西南布依族苗族自治州', '兴仁县', '贵州省兴仁县');
INSERT INTO  s_area_code  VALUES ('3052', '522323', '贵州省', '黔西南布依族苗族自治州', '普安县', '贵州省普安县');
INSERT INTO  s_area_code  VALUES ('3053', '522324', '贵州省', '黔西南布依族苗族自治州', '晴隆县', '贵州省晴隆县');
INSERT INTO  s_area_code  VALUES ('3054', '522325', '贵州省', '黔西南布依族苗族自治州', '贞丰县', '贵州省贞丰县');
INSERT INTO  s_area_code  VALUES ('3055', '522326', '贵州省', '黔西南布依族苗族自治州', '望谟县', '贵州省望谟县');
INSERT INTO  s_area_code  VALUES ('3056', '522327', '贵州省', '黔西南布依族苗族自治州', '册亨县', '贵州省册亨县');
INSERT INTO  s_area_code  VALUES ('3057', '522328', '贵州省', '黔西南布依族苗族自治州', '安龙县', '贵州省安龙县');
INSERT INTO  s_area_code  VALUES ('3058', '522400', '贵州省', '毕节地区', '', '贵州省毕节地区');
INSERT INTO  s_area_code  VALUES ('3059', '522401', '贵州省', '毕节地区', '毕节市', '贵州省毕节市');
INSERT INTO  s_area_code  VALUES ('3060', '522422', '贵州省', '毕节地区', '大方县', '贵州省大方县');
INSERT INTO  s_area_code  VALUES ('3061', '522423', '贵州省', '毕节地区', '黔西县', '贵州省黔西县');
INSERT INTO  s_area_code  VALUES ('3062', '522424', '贵州省', '毕节地区', '金沙县', '贵州省金沙县');
INSERT INTO  s_area_code  VALUES ('3063', '522425', '贵州省', '毕节地区', '织金县', '贵州省织金县');
INSERT INTO  s_area_code  VALUES ('3064', '522426', '贵州省', '毕节地区', '纳雍县', '贵州省纳雍县');
INSERT INTO  s_area_code  VALUES ('3065', '522427', '贵州省', '毕节地区', '威宁彝族回族苗族自治县', '贵州省威宁彝族回族苗族自治县');
INSERT INTO  s_area_code  VALUES ('3066', '522428', '贵州省', '毕节地区', '赫章县', '贵州省赫章县');
INSERT INTO  s_area_code  VALUES ('3067', '522500', '贵州省', '', '', '贵州省贵阳市安顺地区 ');
INSERT INTO  s_area_code  VALUES ('3068', '522501', '贵州省', '', '', '贵州省安顺市 ');
INSERT INTO  s_area_code  VALUES ('3069', '522526', '贵州省', '', '', '贵州省贵阳市平坝县 ');
INSERT INTO  s_area_code  VALUES ('3070', '522527', '贵州省', '', '', '贵州省贵阳市普定县 ');
INSERT INTO  s_area_code  VALUES ('3071', '522528', '贵州省', '', '', '贵州省关岭布衣族苗族自治县');
INSERT INTO  s_area_code  VALUES ('3072', '522529', '贵州省', '', '', '贵州省镇宁布衣族苗族自治县');
INSERT INTO  s_area_code  VALUES ('3073', '522530', '贵州省', '', '', '贵州省紫云布衣族苗族自治县');
INSERT INTO  s_area_code  VALUES ('3074', '522600', '贵州省', '黔东南苗族侗族自治州', '', '贵州省黔东南苗族侗族自治州');
INSERT INTO  s_area_code  VALUES ('3075', '522601', '贵州省', '黔东南苗族侗族自治州', '凯里市', '贵州省凯里市');
INSERT INTO  s_area_code  VALUES ('3076', '522622', '贵州省', '黔东南苗族侗族自治州', '黄平县', '贵州省黄平县');
INSERT INTO  s_area_code  VALUES ('3077', '522623', '贵州省', '黔东南苗族侗族自治州', '施秉县', '贵州省施秉县');
INSERT INTO  s_area_code  VALUES ('3078', '522624', '贵州省', '黔东南苗族侗族自治州', '三穗县', '贵州省三穗县');
INSERT INTO  s_area_code  VALUES ('3079', '522625', '贵州省', '黔东南苗族侗族自治州', '镇远县', '贵州省镇远县');
INSERT INTO  s_area_code  VALUES ('3080', '522626', '贵州省', '黔东南苗族侗族自治州', '岑巩县', '贵州省岑巩县');
INSERT INTO  s_area_code  VALUES ('3081', '522627', '贵州省', '黔东南苗族侗族自治州', '天柱县', '贵州省天柱县');
INSERT INTO  s_area_code  VALUES ('3082', '522628', '贵州省', '黔东南苗族侗族自治州', '锦屏县', '贵州省锦屏县');
INSERT INTO  s_area_code  VALUES ('3083', '522629', '贵州省', '黔东南苗族侗族自治州', '剑河县', '贵州省剑河县');
INSERT INTO  s_area_code  VALUES ('3084', '522630', '贵州省', '黔东南苗族侗族自治州', '台江县', '贵州省台江县');
INSERT INTO  s_area_code  VALUES ('3085', '522631', '贵州省', '黔东南苗族侗族自治州', '黎平县', '贵州省黎平县');
INSERT INTO  s_area_code  VALUES ('3086', '522632', '贵州省', '黔东南苗族侗族自治州', '榕江县', '贵州省榕江县');
INSERT INTO  s_area_code  VALUES ('3087', '522633', '贵州省', '黔东南苗族侗族自治州', '从江县', '贵州省从江县');
INSERT INTO  s_area_code  VALUES ('3088', '522634', '贵州省', '黔东南苗族侗族自治州', '雷山县', '贵州省雷山县');
INSERT INTO  s_area_code  VALUES ('3089', '522635', '贵州省', '黔东南苗族侗族自治州', '麻江县', '贵州省麻江县');
INSERT INTO  s_area_code  VALUES ('3090', '522636', '贵州省', '黔东南苗族侗族自治州', '丹寨县', '贵州省丹寨县');
INSERT INTO  s_area_code  VALUES ('3091', '522700', '贵州省', '黔南布依族苗族自治州', '', '贵州省黔南布依族苗族自治州');
INSERT INTO  s_area_code  VALUES ('3092', '522701', '贵州省', '黔南布依族苗族自治州', '都匀市', '贵州省都匀市');
INSERT INTO  s_area_code  VALUES ('3093', '522702', '贵州省', '黔南布依族苗族自治州', '福泉市', '贵州省福泉市');
INSERT INTO  s_area_code  VALUES ('3094', '522722', '贵州省', '黔南布依族苗族自治州', '荔波县', '贵州省荔波县');
INSERT INTO  s_area_code  VALUES ('3095', '522723', '贵州省', '黔南布依族苗族自治州', '贵定县', '贵州省贵定县');
INSERT INTO  s_area_code  VALUES ('3096', '522725', '贵州省', '黔南布依族苗族自治州', '瓮安县', '贵州省瓮安县');
INSERT INTO  s_area_code  VALUES ('3097', '522726', '贵州省', '黔南布依族苗族自治州', '独山县', '贵州省独山县');
INSERT INTO  s_area_code  VALUES ('3098', '522727', '贵州省', '黔南布依族苗族自治州', '平塘县', '贵州省平塘县');
INSERT INTO  s_area_code  VALUES ('3099', '522728', '贵州省', '黔南布依族苗族自治州', '罗甸县', '贵州省罗甸县');
INSERT INTO  s_area_code  VALUES ('3100', '522729', '贵州省', '黔南布依族苗族自治州', '长顺县', '贵州省长顺县');
INSERT INTO  s_area_code  VALUES ('3101', '522730', '贵州省', '黔南布依族苗族自治州', '龙里县', '贵州省龙里县');
INSERT INTO  s_area_code  VALUES ('3102', '522731', '贵州省', '黔南布依族苗族自治州', '惠水县', '贵州省惠水县');
INSERT INTO  s_area_code  VALUES ('3103', '522732', '贵州省', '黔南布依族苗族自治州', '三都水族自治县', '贵州省三都水族自治县');
INSERT INTO  s_area_code  VALUES ('3104', '530000', '云南省', '', '', '云南省');
INSERT INTO  s_area_code  VALUES ('3105', '530100', '云南省', '昆明市', '', '云南省昆明市');
INSERT INTO  s_area_code  VALUES ('3106', '530101', '云南省', '昆明市', '市辖区', '云南省昆明市市辖区');
INSERT INTO  s_area_code  VALUES ('3107', '530102', '云南省', '昆明市', '五华区', '云南省昆明市五华区');
INSERT INTO  s_area_code  VALUES ('3108', '530103', '云南省', '昆明市', '盘龙区', '云南省昆明市盘龙区');
INSERT INTO  s_area_code  VALUES ('3109', '530111', '云南省', '昆明市', '官渡区', '云南省昆明市官渡区');
INSERT INTO  s_area_code  VALUES ('3110', '530112', '云南省', '昆明市', '西山区', '云南省昆明市西山区');
INSERT INTO  s_area_code  VALUES ('3111', '530113', '云南省', '昆明市', '东川区', '云南省昆明市东川区');
INSERT INTO  s_area_code  VALUES ('3112', '530121', '云南省', '昆明市', '呈贡县', '云南省呈贡县');
INSERT INTO  s_area_code  VALUES ('3113', '530122', '云南省', '昆明市', '晋宁县', '云南省晋宁县');
INSERT INTO  s_area_code  VALUES ('3114', '530124', '云南省', '昆明市', '富民县', '云南省富民县');
INSERT INTO  s_area_code  VALUES ('3115', '530125', '云南省', '昆明市', '宜良县', '云南省宜良县');
INSERT INTO  s_area_code  VALUES ('3116', '530126', '云南省', '昆明市', '石林彝族自治县', '云南省石林彝族自治县');
INSERT INTO  s_area_code  VALUES ('3117', '530127', '云南省', '昆明市', '嵩明县', '云南省嵩明县');
INSERT INTO  s_area_code  VALUES ('3118', '530128', '云南省', '昆明市', '禄劝彝族苗族自治县', '云南省禄劝彝族苗族自治县');
INSERT INTO  s_area_code  VALUES ('3119', '530129', '云南省', '昆明市', '寻甸回族彝族自治县', '云南省寻甸回族彝族自治县');
INSERT INTO  s_area_code  VALUES ('3120', '530181', '云南省', '昆明市', '安宁市', '云南省安宁市');
INSERT INTO  s_area_code  VALUES ('3121', '530300', '云南省', '曲靖市', '', '云南省曲靖市');
INSERT INTO  s_area_code  VALUES ('3122', '530301', '云南省', '曲靖市', '市辖区', '云南省曲靖市市辖区');
INSERT INTO  s_area_code  VALUES ('3123', '530302', '云南省', '曲靖市', '麒麟区', '云南省曲靖市麒麟区');
INSERT INTO  s_area_code  VALUES ('3124', '530321', '云南省', '曲靖市', '马龙县', '云南省马龙县');
INSERT INTO  s_area_code  VALUES ('3125', '530322', '云南省', '曲靖市', '陆良县', '云南省陆良县');
INSERT INTO  s_area_code  VALUES ('3126', '530323', '云南省', '曲靖市', '师宗县', '云南省师宗县');
INSERT INTO  s_area_code  VALUES ('3127', '530324', '云南省', '曲靖市', '罗平县', '云南省罗平县');
INSERT INTO  s_area_code  VALUES ('3128', '530325', '云南省', '曲靖市', '富源县', '云南省富源县');
INSERT INTO  s_area_code  VALUES ('3129', '530326', '云南省', '曲靖市', '会泽县', '云南省会泽县');
INSERT INTO  s_area_code  VALUES ('3130', '530328', '云南省', '曲靖市', '沾益县', '云南省沾益县');
INSERT INTO  s_area_code  VALUES ('3131', '530381', '云南省', '曲靖市', '宣威市', '云南省宣威市');
INSERT INTO  s_area_code  VALUES ('3132', '530400', '云南省', '玉溪市', '', '云南省玉溪市');
INSERT INTO  s_area_code  VALUES ('3133', '530401', '云南省', '玉溪市', '市辖区', '云南省玉溪市市辖区');
INSERT INTO  s_area_code  VALUES ('3134', '530402', '云南省', '玉溪市', '红塔区', '云南省玉溪市红塔区');
INSERT INTO  s_area_code  VALUES ('3135', '530421', '云南省', '玉溪市', '江川县', '云南省江川县');
INSERT INTO  s_area_code  VALUES ('3136', '530422', '云南省', '玉溪市', '澄江县', '云南省澄江县');
INSERT INTO  s_area_code  VALUES ('3137', '530423', '云南省', '玉溪市', '通海县', '云南省通海县');
INSERT INTO  s_area_code  VALUES ('3138', '530424', '云南省', '玉溪市', '华宁县', '云南省华宁县');
INSERT INTO  s_area_code  VALUES ('3139', '530425', '云南省', '玉溪市', '易门县', '云南省易门县');
INSERT INTO  s_area_code  VALUES ('3140', '530426', '云南省', '玉溪市', '峨山彝族自治县', '云南省峨山彝族自治县');
INSERT INTO  s_area_code  VALUES ('3141', '530427', '云南省', '玉溪市', '新平彝族傣族自治县', '云南省新平彝族傣族自治县');
INSERT INTO  s_area_code  VALUES ('3142', '530428', '云南省', '玉溪市', '元江哈尼族彝族傣族自治县', '云南省元江哈尼族彝族傣族自治县');
INSERT INTO  s_area_code  VALUES ('3143', '530500', '云南省', '保山市', '', '云南省保山市');
INSERT INTO  s_area_code  VALUES ('3144', '530501', '云南省', '保山市', '市辖区', '云南省保山市市辖区');
INSERT INTO  s_area_code  VALUES ('3145', '530502', '云南省', '保山市', '隆阳区', '云南省保山市隆阳区');
INSERT INTO  s_area_code  VALUES ('3146', '530521', '云南省', '保山市', '施甸县', '云南省施甸县');
INSERT INTO  s_area_code  VALUES ('3147', '530522', '云南省', '保山市', '腾冲县', '云南省腾冲县');
INSERT INTO  s_area_code  VALUES ('3148', '530523', '云南省', '保山市', '龙陵县', '云南省龙陵县');
INSERT INTO  s_area_code  VALUES ('3149', '530524', '云南省', '保山市', '昌宁县', '云南省昌宁县');
INSERT INTO  s_area_code  VALUES ('3150', '530600', '云南省', '昭通市', '', '云南省昭通市');
INSERT INTO  s_area_code  VALUES ('3151', '530601', '云南省', '昭通市', '市辖区', '云南省昭通市市辖区');
INSERT INTO  s_area_code  VALUES ('3152', '530602', '云南省', '昭通市', '昭阳区', '云南省昭通市昭阳区');
INSERT INTO  s_area_code  VALUES ('3153', '530621', '云南省', '昭通市', '鲁甸县', '云南省鲁甸县');
INSERT INTO  s_area_code  VALUES ('3154', '530622', '云南省', '昭通市', '巧家县', '云南省巧家县');
INSERT INTO  s_area_code  VALUES ('3155', '530623', '云南省', '昭通市', '盐津县', '云南省盐津县');
INSERT INTO  s_area_code  VALUES ('3156', '530624', '云南省', '昭通市', '大关县', '云南省大关县');
INSERT INTO  s_area_code  VALUES ('3157', '530625', '云南省', '昭通市', '永善县', '云南省永善县');
INSERT INTO  s_area_code  VALUES ('3158', '530626', '云南省', '昭通市', '绥江县', '云南省绥江县');
INSERT INTO  s_area_code  VALUES ('3159', '530627', '云南省', '昭通市', '镇雄县', '云南省镇雄县');
INSERT INTO  s_area_code  VALUES ('3160', '530628', '云南省', '昭通市', '彝良县', '云南省彝良县');
INSERT INTO  s_area_code  VALUES ('3161', '530629', '云南省', '昭通市', '威信县', '云南省威信县');
INSERT INTO  s_area_code  VALUES ('3162', '530630', '云南省', '昭通市', '水富县', '云南省水富县');
INSERT INTO  s_area_code  VALUES ('3163', '530700', '云南省', '丽江市', '', '云南省丽江市');
INSERT INTO  s_area_code  VALUES ('3164', '530701', '云南省', '丽江市', '市辖区', '云南省丽江市市辖区');
INSERT INTO  s_area_code  VALUES ('3165', '530702', '云南省', '丽江市', '古城区', '云南省丽江市古城区');
INSERT INTO  s_area_code  VALUES ('3166', '530721', '云南省', '丽江市', '玉龙纳西族自治县', '云南省玉龙纳西族自治县');
INSERT INTO  s_area_code  VALUES ('3167', '530722', '云南省', '丽江市', '永胜县', '云南省永胜县');
INSERT INTO  s_area_code  VALUES ('3168', '530723', '云南省', '丽江市', '华坪县', '云南省华坪县');
INSERT INTO  s_area_code  VALUES ('3169', '530724', '云南省', '丽江市', '宁蒗彝族自治县', '云南省宁蒗彝族自治县');
INSERT INTO  s_area_code  VALUES ('3170', '530800', '云南省', '思茅市', '', '云南省思茅市');
INSERT INTO  s_area_code  VALUES ('3171', '530801', '云南省', '思茅市', '市辖区', '云南省思茅市市辖区');
INSERT INTO  s_area_code  VALUES ('3172', '530802', '云南省', '思茅市', '翠云区', '云南省思茅市翠云区');
INSERT INTO  s_area_code  VALUES ('3173', '530821', '云南省', '思茅市', '普洱哈尼族彝族自治县', '云南省普洱哈尼族彝族自治县');
INSERT INTO  s_area_code  VALUES ('3174', '530822', '云南省', '思茅市', '墨江哈尼族自治县', '云南省墨江哈尼族自治县');
INSERT INTO  s_area_code  VALUES ('3175', '530823', '云南省', '思茅市', '景东彝族自治县', '云南省景东彝族自治县');
INSERT INTO  s_area_code  VALUES ('3176', '530824', '云南省', '思茅市', '景谷傣族彝族自治县', '云南省景谷傣族彝族自治县');
INSERT INTO  s_area_code  VALUES ('3177', '530825', '云南省', '思茅市', '镇沅彝族哈尼族拉祜族自治县', '云南省镇沅彝族哈尼族拉祜族自治县');
INSERT INTO  s_area_code  VALUES ('3178', '530826', '云南省', '思茅市', '江城哈尼族彝族自治县', '云南省江城哈尼族彝族自治县');
INSERT INTO  s_area_code  VALUES ('3179', '530827', '云南省', '思茅市', '孟连傣族拉祜族佤族自治县', '云南省孟连傣族拉祜族佤族自治县');
INSERT INTO  s_area_code  VALUES ('3180', '530828', '云南省', '思茅市', '澜沧拉祜族自治县', '云南省澜沧拉祜族自治县');
INSERT INTO  s_area_code  VALUES ('3181', '530829', '云南省', '思茅市', '西盟佤族自治县', '云南省西盟佤族自治县');
INSERT INTO  s_area_code  VALUES ('3182', '530900', '云南省', '临沧市', '', '云南省临沧市');
INSERT INTO  s_area_code  VALUES ('3183', '530901', '云南省', '临沧市', '市辖区', '云南省临沧市市辖区');
INSERT INTO  s_area_code  VALUES ('3184', '530902', '云南省', '临沧市', '临翔区', '云南省临沧市临翔区');
INSERT INTO  s_area_code  VALUES ('3185', '530921', '云南省', '临沧市', '凤庆县', '云南省凤庆县');
INSERT INTO  s_area_code  VALUES ('3186', '530922', '云南省', '临沧市', '云 县', '云南省云 县');
INSERT INTO  s_area_code  VALUES ('3187', '530923', '云南省', '临沧市', '永德县', '云南省永德县');
INSERT INTO  s_area_code  VALUES ('3188', '530924', '云南省', '临沧市', '镇康县', '云南省镇康县');
INSERT INTO  s_area_code  VALUES ('3189', '530925', '云南省', '临沧市', '双江拉祜族佤族布朗族傣族自治县', '云南省双江拉祜族佤族布朗族傣族自治县');
INSERT INTO  s_area_code  VALUES ('3190', '530926', '云南省', '临沧市', '耿马傣族佤族自治县', '云南省耿马傣族佤族自治县');
INSERT INTO  s_area_code  VALUES ('3191', '530927', '云南省', '临沧市', '沧源佤族自治县', '云南省沧源佤族自治县');
INSERT INTO  s_area_code  VALUES ('3192', '532300', '云南省', '楚雄彝族自治州', '', '云南省楚雄彝族自治州');
INSERT INTO  s_area_code  VALUES ('3193', '532301', '云南省', '楚雄彝族自治州', '楚雄市', '云南省楚雄市');
INSERT INTO  s_area_code  VALUES ('3194', '532322', '云南省', '楚雄彝族自治州', '双柏县', '云南省双柏县');
INSERT INTO  s_area_code  VALUES ('3195', '532323', '云南省', '楚雄彝族自治州', '牟定县', '云南省牟定县');
INSERT INTO  s_area_code  VALUES ('3196', '532324', '云南省', '楚雄彝族自治州', '南华县', '云南省南华县');
INSERT INTO  s_area_code  VALUES ('3197', '532325', '云南省', '楚雄彝族自治州', '姚安县', '云南省姚安县');
INSERT INTO  s_area_code  VALUES ('3198', '532326', '云南省', '楚雄彝族自治州', '大姚县', '云南省大姚县');
INSERT INTO  s_area_code  VALUES ('3199', '532327', '云南省', '楚雄彝族自治州', '永仁县', '云南省永仁县');
INSERT INTO  s_area_code  VALUES ('3200', '532328', '云南省', '楚雄彝族自治州', '元谋县', '云南省元谋县');
INSERT INTO  s_area_code  VALUES ('3201', '532329', '云南省', '楚雄彝族自治州', '武定县', '云南省武定县');
INSERT INTO  s_area_code  VALUES ('3202', '532331', '云南省', '楚雄彝族自治州', '禄丰县', '云南省禄丰县');
INSERT INTO  s_area_code  VALUES ('3203', '532500', '云南省', '红河哈尼族彝族自治州', '', '云南省红河哈尼族彝族自治州');
INSERT INTO  s_area_code  VALUES ('3204', '532501', '云南省', '红河哈尼族彝族自治州', '个旧市', '云南省个旧市');
INSERT INTO  s_area_code  VALUES ('3205', '532502', '云南省', '红河哈尼族彝族自治州', '开远市', '云南省开远市');
INSERT INTO  s_area_code  VALUES ('3206', '532522', '云南省', '红河哈尼族彝族自治州', '蒙自县', '云南省蒙自县');
INSERT INTO  s_area_code  VALUES ('3207', '532523', '云南省', '红河哈尼族彝族自治州', '屏边苗族自治县', '云南省屏边苗族自治县');
INSERT INTO  s_area_code  VALUES ('3208', '532524', '云南省', '红河哈尼族彝族自治州', '建水县', '云南省建水县');
INSERT INTO  s_area_code  VALUES ('3209', '532525', '云南省', '红河哈尼族彝族自治州', '石屏县', '云南省石屏县');
INSERT INTO  s_area_code  VALUES ('3210', '532526', '云南省', '红河哈尼族彝族自治州', '弥勒县', '云南省弥勒县');
INSERT INTO  s_area_code  VALUES ('3211', '532527', '云南省', '红河哈尼族彝族自治州', '泸西县', '云南省泸西县');
INSERT INTO  s_area_code  VALUES ('3212', '532528', '云南省', '红河哈尼族彝族自治州', '元阳县', '云南省元阳县');
INSERT INTO  s_area_code  VALUES ('3213', '532529', '云南省', '红河哈尼族彝族自治州', '红河县', '云南省红河县');
INSERT INTO  s_area_code  VALUES ('3214', '532530', '云南省', '红河哈尼族彝族自治州', '金平苗族瑶族傣族自治县', '云南省金平苗族瑶族傣族自治县');
INSERT INTO  s_area_code  VALUES ('3215', '532531', '云南省', '红河哈尼族彝族自治州', '绿春县', '云南省绿春县');
INSERT INTO  s_area_code  VALUES ('3216', '532532', '云南省', '红河哈尼族彝族自治州', '河口瑶族自治县', '云南省河口瑶族自治县');
INSERT INTO  s_area_code  VALUES ('3217', '532600', '云南省', '文山壮族苗族自治州', '', '云南省文山壮族苗族自治州');
INSERT INTO  s_area_code  VALUES ('3218', '532621', '云南省', '文山壮族苗族自治州', '文山县', '云南省文山县');
INSERT INTO  s_area_code  VALUES ('3219', '532622', '云南省', '文山壮族苗族自治州', '砚山县', '云南省砚山县');
INSERT INTO  s_area_code  VALUES ('3220', '532623', '云南省', '文山壮族苗族自治州', '西畴县', '云南省西畴县');
INSERT INTO  s_area_code  VALUES ('3221', '532624', '云南省', '文山壮族苗族自治州', '麻栗坡县', '云南省麻栗坡县');
INSERT INTO  s_area_code  VALUES ('3222', '532625', '云南省', '文山壮族苗族自治州', '马关县', '云南省马关县');
INSERT INTO  s_area_code  VALUES ('3223', '532626', '云南省', '文山壮族苗族自治州', '丘北县', '云南省丘北县');
INSERT INTO  s_area_code  VALUES ('3224', '532627', '云南省', '文山壮族苗族自治州', '广南县', '云南省广南县');
INSERT INTO  s_area_code  VALUES ('3225', '532628', '云南省', '文山壮族苗族自治州', '富宁县', '云南省富宁县');
INSERT INTO  s_area_code  VALUES ('3226', '532700', '云南省', '', '', '云南省思茅地区');
INSERT INTO  s_area_code  VALUES ('3227', '532701', '云南省', '', '', '云南省思茅市');
INSERT INTO  s_area_code  VALUES ('3228', '532722', '云南省', '', '', '云南省普洱哈尼族彝族自治县');
INSERT INTO  s_area_code  VALUES ('3229', '532723', '云南省', '', '', '云南省墨江哈尼族自治县');
INSERT INTO  s_area_code  VALUES ('3230', '532724', '云南省', '', '', '云南省景东彝族自治县');
INSERT INTO  s_area_code  VALUES ('3231', '532725', '云南省', '', '', '云南省景谷傣族彝族自治县');
INSERT INTO  s_area_code  VALUES ('3232', '532726', '云南省', '', '', '云南省镇沅彝族哈尼族拉祜族自治县');
INSERT INTO  s_area_code  VALUES ('3233', '532727', '云南省', '', '', '云南省江城哈尼族彝族自治县');
INSERT INTO  s_area_code  VALUES ('3234', '532728', '云南省', '', '', '云南省孟连傣族拉祜族佤族自治县');
INSERT INTO  s_area_code  VALUES ('3235', '532729', '云南省', '', '', '云南省澜沧拉祜族自治县');
INSERT INTO  s_area_code  VALUES ('3236', '532730', '云南省', '', '', '云南省西盟佤族自治县');
INSERT INTO  s_area_code  VALUES ('3237', '532800', '云南省', '西双版纳傣族自治州', '', '云南省西双版纳傣族自治州');
INSERT INTO  s_area_code  VALUES ('3238', '532801', '云南省', '西双版纳傣族自治州', '景洪市', '云南省景洪市');
INSERT INTO  s_area_code  VALUES ('3239', '532822', '云南省', '西双版纳傣族自治州', '勐海县', '云南省勐海县');
INSERT INTO  s_area_code  VALUES ('3240', '532823', '云南省', '西双版纳傣族自治州', '勐腊县', '云南省勐腊县');
INSERT INTO  s_area_code  VALUES ('3241', '532900', '云南省', '大理白族自治州', '', '云南省大理白族自治州');
INSERT INTO  s_area_code  VALUES ('3242', '532901', '云南省', '大理白族自治州', '大理市', '云南省大理市');
INSERT INTO  s_area_code  VALUES ('3243', '532922', '云南省', '大理白族自治州', '漾濞彝族自治县', '云南省漾濞彝族自治县');
INSERT INTO  s_area_code  VALUES ('3244', '532923', '云南省', '大理白族自治州', '祥云县', '云南省祥云县');
INSERT INTO  s_area_code  VALUES ('3245', '532924', '云南省', '大理白族自治州', '宾川县', '云南省宾川县');
INSERT INTO  s_area_code  VALUES ('3246', '532925', '云南省', '大理白族自治州', '弥渡县', '云南省弥渡县');
INSERT INTO  s_area_code  VALUES ('3247', '532926', '云南省', '大理白族自治州', '南涧彝族自治县', '云南省南涧彝族自治县');
INSERT INTO  s_area_code  VALUES ('3248', '532927', '云南省', '大理白族自治州', '巍山彝族回族自治县', '云南省巍山彝族回族自治县');
INSERT INTO  s_area_code  VALUES ('3249', '532928', '云南省', '大理白族自治州', '永平县', '云南省永平县');
INSERT INTO  s_area_code  VALUES ('3250', '532929', '云南省', '大理白族自治州', '云龙县', '云南省云龙县');
INSERT INTO  s_area_code  VALUES ('3251', '532930', '云南省', '大理白族自治州', '洱源县', '云南省洱源县');
INSERT INTO  s_area_code  VALUES ('3252', '532931', '云南省', '大理白族自治州', '剑川县', '云南省剑川县');
INSERT INTO  s_area_code  VALUES ('3253', '532932', '云南省', '大理白族自治州', '鹤庆县', '云南省鹤庆县');
INSERT INTO  s_area_code  VALUES ('3254', '533100', '云南省', '德宏傣族景颇族自治州', '', '云南省德宏傣族景颇族自治州');
INSERT INTO  s_area_code  VALUES ('3255', '533102', '云南省', '德宏傣族景颇族自治州', '瑞丽市', '云南省瑞丽市');
INSERT INTO  s_area_code  VALUES ('3256', '533103', '云南省', '德宏傣族景颇族自治州', '潞西市', '云南省潞西市');
INSERT INTO  s_area_code  VALUES ('3257', '533122', '云南省', '德宏傣族景颇族自治州', '梁河县', '云南省梁河县');
INSERT INTO  s_area_code  VALUES ('3258', '533123', '云南省', '德宏傣族景颇族自治州', '盈江县', '云南省盈江县');
INSERT INTO  s_area_code  VALUES ('3259', '533124', '云南省', '德宏傣族景颇族自治州', '陇川县', '云南省陇川县');
INSERT INTO  s_area_code  VALUES ('3260', '533300', '云南省', '怒江傈僳族自治州', '', '云南省怒江傈僳族自治州');
INSERT INTO  s_area_code  VALUES ('3261', '533321', '云南省', '怒江傈僳族自治州', '泸水县', '云南省泸水县');
INSERT INTO  s_area_code  VALUES ('3262', '533323', '云南省', '怒江傈僳族自治州', '福贡县', '云南省福贡县');
INSERT INTO  s_area_code  VALUES ('3263', '533324', '云南省', '怒江傈僳族自治州', '贡山独龙族怒族自治县', '云南省贡山独龙族怒族自治县');
INSERT INTO  s_area_code  VALUES ('3264', '533325', '云南省', '怒江傈僳族自治州', '兰坪白族普米族自治县', '云南省兰坪白族普米族自治县');
INSERT INTO  s_area_code  VALUES ('3265', '533400', '云南省', '迪庆藏族自治州', '', '云南省迪庆藏族自治州');
INSERT INTO  s_area_code  VALUES ('3266', '533421', '云南省', '迪庆藏族自治州', '香格里拉县', '云南省香格里拉县');
INSERT INTO  s_area_code  VALUES ('3267', '533422', '云南省', '迪庆藏族自治州', '德钦县', '云南省德钦县');
INSERT INTO  s_area_code  VALUES ('3268', '533423', '云南省', '迪庆藏族自治州', '维西傈僳族自治县', '云南省维西傈僳族自治县');
INSERT INTO  s_area_code  VALUES ('3269', '533500', '云南省', '', '', '云南省临沧地区');
INSERT INTO  s_area_code  VALUES ('3270', '533521', '云南省', '', '', '云南省临沧县');
INSERT INTO  s_area_code  VALUES ('3271', '533522', '云南省', '', '', '云南省凤庆县');
INSERT INTO  s_area_code  VALUES ('3272', '533523', '云南省', '', '', '云南省云县');
INSERT INTO  s_area_code  VALUES ('3273', '533524', '云南省', '', '', '云南省永德县');
INSERT INTO  s_area_code  VALUES ('3274', '533525', '云南省', '', '', '云南省镇康县');
INSERT INTO  s_area_code  VALUES ('3275', '533526', '云南省', '', '', '云南省双江拉祜族佤族布朗族傣族自治县');
INSERT INTO  s_area_code  VALUES ('3276', '533527', '云南省', '', '', '云南省耿马傣族佤族自治县');
INSERT INTO  s_area_code  VALUES ('3277', '533528', '云南省', '', '', '云南省沧源佤族自治县');
INSERT INTO  s_area_code  VALUES ('3278', '540000', '西藏自治区', '', '', '西藏自治区');
INSERT INTO  s_area_code  VALUES ('3279', '540100', '西藏自治区', '拉萨市', '', '西藏自治区拉萨市');
INSERT INTO  s_area_code  VALUES ('3280', '540101', '西藏自治区', '拉萨市', '市辖区', '西藏自治区拉萨市市辖区');
INSERT INTO  s_area_code  VALUES ('3281', '540102', '西藏自治区', '拉萨市', '城关区', '西藏自治区拉萨市城关区');
INSERT INTO  s_area_code  VALUES ('3282', '540121', '西藏自治区', '拉萨市', '林周县', '西藏自治区林周县');
INSERT INTO  s_area_code  VALUES ('3283', '540122', '西藏自治区', '拉萨市', '当雄县', '西藏自治区当雄县');
INSERT INTO  s_area_code  VALUES ('3284', '540123', '西藏自治区', '拉萨市', '尼木县', '西藏自治区尼木县');
INSERT INTO  s_area_code  VALUES ('3285', '540124', '西藏自治区', '拉萨市', '曲水县', '西藏自治区曲水县');
INSERT INTO  s_area_code  VALUES ('3286', '540125', '西藏自治区', '拉萨市', '堆龙德庆县', '西藏自治区堆龙德庆县');
INSERT INTO  s_area_code  VALUES ('3287', '540126', '西藏自治区', '拉萨市', '达孜县', '西藏自治区达孜县');
INSERT INTO  s_area_code  VALUES ('3288', '540127', '西藏自治区', '拉萨市', '墨竹工卡县', '西藏自治区墨竹工卡县');
INSERT INTO  s_area_code  VALUES ('3289', '542100', '西藏自治区', '昌都地区', '', '西藏自治区昌都地区');
INSERT INTO  s_area_code  VALUES ('3290', '542121', '西藏自治区', '昌都地区', '昌都县', '西藏自治区昌都县');
INSERT INTO  s_area_code  VALUES ('3291', '542122', '西藏自治区', '昌都地区', '江达县', '西藏自治区江达县');
INSERT INTO  s_area_code  VALUES ('3292', '542123', '西藏自治区', '昌都地区', '贡觉县', '西藏自治区贡觉县');
INSERT INTO  s_area_code  VALUES ('3293', '542124', '西藏自治区', '昌都地区', '类乌齐县', '西藏自治区类乌齐县');
INSERT INTO  s_area_code  VALUES ('3294', '542125', '西藏自治区', '昌都地区', '丁青县', '西藏自治区丁青县');
INSERT INTO  s_area_code  VALUES ('3295', '542126', '西藏自治区', '昌都地区', '察雅县', '西藏自治区察雅县');
INSERT INTO  s_area_code  VALUES ('3296', '542127', '西藏自治区', '昌都地区', '八宿县', '西藏自治区八宿县');
INSERT INTO  s_area_code  VALUES ('3297', '542128', '西藏自治区', '昌都地区', '左贡县', '西藏自治区左贡县');
INSERT INTO  s_area_code  VALUES ('3298', '542129', '西藏自治区', '昌都地区', '芒康县', '西藏自治区芒康县');
INSERT INTO  s_area_code  VALUES ('3299', '542132', '西藏自治区', '昌都地区', '洛隆县', '西藏自治区洛隆县');
INSERT INTO  s_area_code  VALUES ('3300', '542133', '西藏自治区', '昌都地区', '边坝县', '西藏自治区边坝县');
INSERT INTO  s_area_code  VALUES ('3301', '542200', '西藏自治区', '山南地区', '', '西藏自治区山南地区');
INSERT INTO  s_area_code  VALUES ('3302', '542221', '西藏自治区', '山南地区', '乃东县', '西藏自治区乃东县');
INSERT INTO  s_area_code  VALUES ('3303', '542222', '西藏自治区', '山南地区', '扎囊县', '西藏自治区扎囊县');
INSERT INTO  s_area_code  VALUES ('3304', '542223', '西藏自治区', '山南地区', '贡嘎县', '西藏自治区贡嘎县');
INSERT INTO  s_area_code  VALUES ('3305', '542224', '西藏自治区', '山南地区', '桑日县', '西藏自治区桑日县');
INSERT INTO  s_area_code  VALUES ('3306', '542225', '西藏自治区', '山南地区', '琼结县', '西藏自治区琼结县');
INSERT INTO  s_area_code  VALUES ('3307', '542226', '西藏自治区', '山南地区', '曲松县', '西藏自治区曲松县');
INSERT INTO  s_area_code  VALUES ('3308', '542227', '西藏自治区', '山南地区', '措美县', '西藏自治区措美县');
INSERT INTO  s_area_code  VALUES ('3309', '542228', '西藏自治区', '山南地区', '洛扎县', '西藏自治区洛扎县');
INSERT INTO  s_area_code  VALUES ('3310', '542229', '西藏自治区', '山南地区', '加查县', '西藏自治区加查县');
INSERT INTO  s_area_code  VALUES ('3311', '542231', '西藏自治区', '山南地区', '隆子县', '西藏自治区隆子县');
INSERT INTO  s_area_code  VALUES ('3312', '542232', '西藏自治区', '山南地区', '错那县', '西藏自治区错那县');
INSERT INTO  s_area_code  VALUES ('3313', '542233', '西藏自治区', '山南地区', '浪卡子县', '西藏自治区浪卡子县');
INSERT INTO  s_area_code  VALUES ('3314', '542300', '西藏自治区', '日喀则地区', '', '西藏自治区日喀则地区');
INSERT INTO  s_area_code  VALUES ('3315', '542301', '西藏自治区', '日喀则地区', '日喀则市', '西藏自治区日喀则市');
INSERT INTO  s_area_code  VALUES ('3316', '542322', '西藏自治区', '日喀则地区', '南木林县', '西藏自治区南木林县');
INSERT INTO  s_area_code  VALUES ('3317', '542323', '西藏自治区', '日喀则地区', '江孜县', '西藏自治区江孜县');
INSERT INTO  s_area_code  VALUES ('3318', '542324', '西藏自治区', '日喀则地区', '定日县', '西藏自治区定日县');
INSERT INTO  s_area_code  VALUES ('3319', '542325', '西藏自治区', '日喀则地区', '萨迦县', '西藏自治区萨迦县');
INSERT INTO  s_area_code  VALUES ('3320', '542326', '西藏自治区', '日喀则地区', '拉孜县', '西藏自治区拉孜县');
INSERT INTO  s_area_code  VALUES ('3321', '542327', '西藏自治区', '日喀则地区', '昂仁县', '西藏自治区昂仁县');
INSERT INTO  s_area_code  VALUES ('3322', '542328', '西藏自治区', '日喀则地区', '谢通门县', '西藏自治区谢通门县');
INSERT INTO  s_area_code  VALUES ('3323', '542329', '西藏自治区', '日喀则地区', '白朗县', '西藏自治区白朗县');
INSERT INTO  s_area_code  VALUES ('3324', '542330', '西藏自治区', '日喀则地区', '仁布县', '西藏自治区仁布县');
INSERT INTO  s_area_code  VALUES ('3325', '542331', '西藏自治区', '日喀则地区', '康马县', '西藏自治区康马县');
INSERT INTO  s_area_code  VALUES ('3326', '542332', '西藏自治区', '日喀则地区', '定结县', '西藏自治区定结县');
INSERT INTO  s_area_code  VALUES ('3327', '542333', '西藏自治区', '日喀则地区', '仲巴县', '西藏自治区仲巴县');
INSERT INTO  s_area_code  VALUES ('3328', '542334', '西藏自治区', '日喀则地区', '亚东县', '西藏自治区亚东县');
INSERT INTO  s_area_code  VALUES ('3329', '542335', '西藏自治区', '日喀则地区', '吉隆县', '西藏自治区吉隆县');
INSERT INTO  s_area_code  VALUES ('3330', '542336', '西藏自治区', '日喀则地区', '聂拉木县', '西藏自治区聂拉木县');
INSERT INTO  s_area_code  VALUES ('3331', '542337', '西藏自治区', '日喀则地区', '萨嘎县', '西藏自治区萨嘎县');
INSERT INTO  s_area_code  VALUES ('3332', '542338', '西藏自治区', '日喀则地区', '岗巴县', '西藏自治区岗巴县');
INSERT INTO  s_area_code  VALUES ('3333', '542400', '西藏自治区', '那曲地区', '', '西藏自治区那曲地区');
INSERT INTO  s_area_code  VALUES ('3334', '542421', '西藏自治区', '那曲地区', '那曲县', '西藏自治区那曲县');
INSERT INTO  s_area_code  VALUES ('3335', '542422', '西藏自治区', '那曲地区', '嘉黎县', '西藏自治区嘉黎县');
INSERT INTO  s_area_code  VALUES ('3336', '542423', '西藏自治区', '那曲地区', '比如县', '西藏自治区比如县');
INSERT INTO  s_area_code  VALUES ('3337', '542424', '西藏自治区', '那曲地区', '聂荣县', '西藏自治区聂荣县');
INSERT INTO  s_area_code  VALUES ('3338', '542425', '西藏自治区', '那曲地区', '安多县', '西藏自治区安多县');
INSERT INTO  s_area_code  VALUES ('3339', '542426', '西藏自治区', '那曲地区', '申扎县', '西藏自治区申扎县');
INSERT INTO  s_area_code  VALUES ('3340', '542427', '西藏自治区', '那曲地区', '索 县', '西藏自治区索 县');
INSERT INTO  s_area_code  VALUES ('3341', '542428', '西藏自治区', '那曲地区', '班戈县', '西藏自治区班戈县');
INSERT INTO  s_area_code  VALUES ('3342', '542429', '西藏自治区', '那曲地区', '巴青县', '西藏自治区巴青县');
INSERT INTO  s_area_code  VALUES ('3343', '542430', '西藏自治区', '那曲地区', '尼玛县', '西藏自治区尼玛县');
INSERT INTO  s_area_code  VALUES ('3344', '542500', '西藏自治区', '阿里地区', '', '西藏自治区阿里地区');
INSERT INTO  s_area_code  VALUES ('3345', '542521', '西藏自治区', '阿里地区', '普兰县', '西藏自治区普兰县');
INSERT INTO  s_area_code  VALUES ('3346', '542522', '西藏自治区', '阿里地区', '札达县', '西藏自治区札达县');
INSERT INTO  s_area_code  VALUES ('3347', '542523', '西藏自治区', '阿里地区', '噶尔县', '西藏自治区噶尔县');
INSERT INTO  s_area_code  VALUES ('3348', '542524', '西藏自治区', '阿里地区', '日土县', '西藏自治区日土县');
INSERT INTO  s_area_code  VALUES ('3349', '542525', '西藏自治区', '阿里地区', '革吉县', '西藏自治区革吉县');
INSERT INTO  s_area_code  VALUES ('3350', '542526', '西藏自治区', '阿里地区', '改则县', '西藏自治区改则县');
INSERT INTO  s_area_code  VALUES ('3351', '542527', '西藏自治区', '阿里地区', '措勤县', '西藏自治区措勤县');
INSERT INTO  s_area_code  VALUES ('3352', '542600', '西藏自治区', '林芝地区', '', '西藏自治区林芝地区');
INSERT INTO  s_area_code  VALUES ('3353', '542621', '西藏自治区', '林芝地区', '林芝县', '西藏自治区林芝县');
INSERT INTO  s_area_code  VALUES ('3354', '542622', '西藏自治区', '林芝地区', '工布江达县', '西藏自治区工布江达县');
INSERT INTO  s_area_code  VALUES ('3355', '542623', '西藏自治区', '林芝地区', '米林县', '西藏自治区米林县');
INSERT INTO  s_area_code  VALUES ('3356', '542624', '西藏自治区', '林芝地区', '墨脱县', '西藏自治区墨脱县');
INSERT INTO  s_area_code  VALUES ('3357', '542625', '西藏自治区', '林芝地区', '波密县', '西藏自治区波密县');
INSERT INTO  s_area_code  VALUES ('3358', '542626', '西藏自治区', '林芝地区', '察隅县', '西藏自治区察隅县');
INSERT INTO  s_area_code  VALUES ('3359', '542627', '西藏自治区', '林芝地区', '朗 县', '西藏自治区朗 县');
INSERT INTO  s_area_code  VALUES ('3360', '610000', '陕西省', '', '', '陕西省');
INSERT INTO  s_area_code  VALUES ('3361', '610100', '陕西省', '西安市', '', '陕西省西安市');
INSERT INTO  s_area_code  VALUES ('3362', '610101', '陕西省', '西安市', '市辖区', '陕西省西安市市辖区');
INSERT INTO  s_area_code  VALUES ('3363', '610102', '陕西省', '西安市', '新城区', '陕西省西安市新城区');
INSERT INTO  s_area_code  VALUES ('3364', '610103', '陕西省', '西安市', '碑林区', '陕西省西安市碑林区');
INSERT INTO  s_area_code  VALUES ('3365', '610104', '陕西省', '西安市', '莲湖区', '陕西省西安市莲湖区');
INSERT INTO  s_area_code  VALUES ('3366', '610111', '陕西省', '西安市', '灞桥区', '陕西省西安市灞桥区');
INSERT INTO  s_area_code  VALUES ('3367', '610112', '陕西省', '西安市', '未央区', '陕西省西安市未央区');
INSERT INTO  s_area_code  VALUES ('3368', '610113', '陕西省', '西安市', '雁塔区', '陕西省西安市雁塔区');
INSERT INTO  s_area_code  VALUES ('3369', '610114', '陕西省', '西安市', '阎良区', '陕西省西安市阎良区');
INSERT INTO  s_area_code  VALUES ('3370', '610115', '陕西省', '西安市', '临潼区', '陕西省西安市临潼区');
INSERT INTO  s_area_code  VALUES ('3371', '610116', '陕西省', '西安市', '长安区', '陕西省西安市长安区');
INSERT INTO  s_area_code  VALUES ('3372', '610122', '陕西省', '西安市', '蓝田县', '陕西省蓝田县');
INSERT INTO  s_area_code  VALUES ('3373', '610124', '陕西省', '西安市', '周至县', '陕西省周至县');
INSERT INTO  s_area_code  VALUES ('3374', '610125', '陕西省', '西安市', '户 县', '陕西省户 县');
INSERT INTO  s_area_code  VALUES ('3375', '610126', '陕西省', '西安市', '高陵县', '陕西省高陵县');
INSERT INTO  s_area_code  VALUES ('3376', '610200', '陕西省', '铜川市', '', '陕西省铜川市');
INSERT INTO  s_area_code  VALUES ('3377', '610201', '陕西省', '铜川市', '市辖区', '陕西省铜川市市辖区');
INSERT INTO  s_area_code  VALUES ('3378', '610202', '陕西省', '铜川市', '王益区', '陕西省铜川市王益区');
INSERT INTO  s_area_code  VALUES ('3379', '610203', '陕西省', '铜川市', '印台区', '陕西省铜川市印台区');
INSERT INTO  s_area_code  VALUES ('3380', '610204', '陕西省', '铜川市', '耀州区', '陕西省铜川市耀州区');
INSERT INTO  s_area_code  VALUES ('3381', '610222', '陕西省', '铜川市', '宜君县', '陕西省宜君县');
INSERT INTO  s_area_code  VALUES ('3382', '610300', '陕西省', '宝鸡市', '', '陕西省宝鸡市');
INSERT INTO  s_area_code  VALUES ('3383', '610301', '陕西省', '宝鸡市', '市辖区', '陕西省宝鸡市市辖区');
INSERT INTO  s_area_code  VALUES ('3384', '610302', '陕西省', '宝鸡市', '渭滨区', '陕西省宝鸡市渭滨区');
INSERT INTO  s_area_code  VALUES ('3385', '610303', '陕西省', '宝鸡市', '金台区', '陕西省宝鸡市金台区');
INSERT INTO  s_area_code  VALUES ('3386', '610304', '陕西省', '宝鸡市', '陈仓区', '陕西省宝鸡市陈仓区');
INSERT INTO  s_area_code  VALUES ('3387', '610321', '陕西省', '宝鸡市', '宝鸡县', '陕西省宝鸡市宝鸡县');
INSERT INTO  s_area_code  VALUES ('3388', '610322', '陕西省', '宝鸡市', '凤翔县', '陕西省凤翔县');
INSERT INTO  s_area_code  VALUES ('3389', '610323', '陕西省', '宝鸡市', '岐山县', '陕西省岐山县');
INSERT INTO  s_area_code  VALUES ('3390', '610324', '陕西省', '宝鸡市', '扶风县', '陕西省扶风县');
INSERT INTO  s_area_code  VALUES ('3391', '610326', '陕西省', '宝鸡市', '眉 县', '陕西省眉 县');
INSERT INTO  s_area_code  VALUES ('3392', '610327', '陕西省', '宝鸡市', '陇 县', '陕西省陇 县');
INSERT INTO  s_area_code  VALUES ('3393', '610328', '陕西省', '宝鸡市', '千阳县', '陕西省千阳县');
INSERT INTO  s_area_code  VALUES ('3394', '610329', '陕西省', '宝鸡市', '麟游县', '陕西省麟游县');
INSERT INTO  s_area_code  VALUES ('3395', '610330', '陕西省', '宝鸡市', '凤 县', '陕西省凤 县');
INSERT INTO  s_area_code  VALUES ('3396', '610331', '陕西省', '宝鸡市', '太白县', '陕西省太白县');
INSERT INTO  s_area_code  VALUES ('3397', '610400', '陕西省', '咸阳市', '', '陕西省咸阳市');
INSERT INTO  s_area_code  VALUES ('3398', '610401', '陕西省', '咸阳市', '市辖区', '陕西省咸阳市市辖区');
INSERT INTO  s_area_code  VALUES ('3399', '610402', '陕西省', '咸阳市', '秦都区', '陕西省咸阳市秦都区');
INSERT INTO  s_area_code  VALUES ('3400', '610403', '陕西省', '咸阳市', '杨凌区', '陕西省咸阳市杨凌区');
INSERT INTO  s_area_code  VALUES ('3401', '610404', '陕西省', '咸阳市', '渭城区', '陕西省咸阳市渭城区');
INSERT INTO  s_area_code  VALUES ('3402', '610422', '陕西省', '咸阳市', '三原县', '陕西省三原县');
INSERT INTO  s_area_code  VALUES ('3403', '610423', '陕西省', '咸阳市', '泾阳县', '陕西省泾阳县');
INSERT INTO  s_area_code  VALUES ('3404', '610424', '陕西省', '咸阳市', '乾 县', '陕西省乾 县');
INSERT INTO  s_area_code  VALUES ('3405', '610425', '陕西省', '咸阳市', '礼泉县', '陕西省礼泉县');
INSERT INTO  s_area_code  VALUES ('3406', '610426', '陕西省', '咸阳市', '永寿县', '陕西省永寿县');
INSERT INTO  s_area_code  VALUES ('3407', '610427', '陕西省', '咸阳市', '彬 县', '陕西省彬 县');
INSERT INTO  s_area_code  VALUES ('3408', '610428', '陕西省', '咸阳市', '长武县', '陕西省长武县');
INSERT INTO  s_area_code  VALUES ('3409', '610429', '陕西省', '咸阳市', '旬邑县', '陕西省旬邑县');
INSERT INTO  s_area_code  VALUES ('3410', '610430', '陕西省', '咸阳市', '淳化县', '陕西省淳化县');
INSERT INTO  s_area_code  VALUES ('3411', '610431', '陕西省', '咸阳市', '武功县', '陕西省武功县');
INSERT INTO  s_area_code  VALUES ('3412', '610481', '陕西省', '咸阳市', '兴平市', '陕西省兴平市');
INSERT INTO  s_area_code  VALUES ('3413', '610500', '陕西省', '渭南市', '', '陕西省渭南市');
INSERT INTO  s_area_code  VALUES ('3414', '610501', '陕西省', '渭南市', '市辖区', '陕西省渭南市市辖区');
INSERT INTO  s_area_code  VALUES ('3415', '610502', '陕西省', '渭南市', '临渭区', '陕西省渭南市临渭区');
INSERT INTO  s_area_code  VALUES ('3416', '610521', '陕西省', '渭南市', '华 县', '陕西省华 县');
INSERT INTO  s_area_code  VALUES ('3417', '610522', '陕西省', '渭南市', '潼关县', '陕西省潼关县');
INSERT INTO  s_area_code  VALUES ('3418', '610523', '陕西省', '渭南市', '大荔县', '陕西省大荔县');
INSERT INTO  s_area_code  VALUES ('3419', '610524', '陕西省', '渭南市', '合阳县', '陕西省合阳县');
INSERT INTO  s_area_code  VALUES ('3420', '610525', '陕西省', '渭南市', '澄城县', '陕西省澄城县');
INSERT INTO  s_area_code  VALUES ('3421', '610526', '陕西省', '渭南市', '蒲城县', '陕西省蒲城县');
INSERT INTO  s_area_code  VALUES ('3422', '610527', '陕西省', '渭南市', '白水县', '陕西省白水县');
INSERT INTO  s_area_code  VALUES ('3423', '610528', '陕西省', '渭南市', '富平县', '陕西省富平县');
INSERT INTO  s_area_code  VALUES ('3424', '610581', '陕西省', '渭南市', '韩城市', '陕西省韩城市');
INSERT INTO  s_area_code  VALUES ('3425', '610582', '陕西省', '渭南市', '华阴市', '陕西省华阴市');
INSERT INTO  s_area_code  VALUES ('3426', '610600', '陕西省', '延安市', '', '陕西省延安市');
INSERT INTO  s_area_code  VALUES ('3427', '610601', '陕西省', '延安市', '市辖区', '陕西省延安市市辖区');
INSERT INTO  s_area_code  VALUES ('3428', '610602', '陕西省', '延安市', '宝塔区', '陕西省延安市宝塔区');
INSERT INTO  s_area_code  VALUES ('3429', '610621', '陕西省', '延安市', '延长县', '陕西省延长县');
INSERT INTO  s_area_code  VALUES ('3430', '610622', '陕西省', '延安市', '延川县', '陕西省延川县');
INSERT INTO  s_area_code  VALUES ('3431', '610623', '陕西省', '延安市', '子长县', '陕西省子长县');
INSERT INTO  s_area_code  VALUES ('3432', '610624', '陕西省', '延安市', '安塞县', '陕西省安塞县');
INSERT INTO  s_area_code  VALUES ('3433', '610625', '陕西省', '延安市', '志丹县', '陕西省志丹县');
INSERT INTO  s_area_code  VALUES ('3434', '610626', '陕西省', '延安市', '吴旗县', '陕西省吴旗县');
INSERT INTO  s_area_code  VALUES ('3435', '610627', '陕西省', '延安市', '甘泉县', '陕西省甘泉县');
INSERT INTO  s_area_code  VALUES ('3436', '610628', '陕西省', '延安市', '富 县', '陕西省富 县');
INSERT INTO  s_area_code  VALUES ('3437', '610629', '陕西省', '延安市', '洛川县', '陕西省洛川县');
INSERT INTO  s_area_code  VALUES ('3438', '610630', '陕西省', '延安市', '宜川县', '陕西省宜川县');
INSERT INTO  s_area_code  VALUES ('3439', '610631', '陕西省', '延安市', '黄龙县', '陕西省黄龙县');
INSERT INTO  s_area_code  VALUES ('3440', '610632', '陕西省', '延安市', '黄陵县', '陕西省黄陵县');
INSERT INTO  s_area_code  VALUES ('3441', '610700', '陕西省', '汉中市', '', '陕西省汉中市');
INSERT INTO  s_area_code  VALUES ('3442', '610701', '陕西省', '汉中市', '市辖区', '陕西省汉中市市辖区');
INSERT INTO  s_area_code  VALUES ('3443', '610702', '陕西省', '汉中市', '汉台区', '陕西省汉中市汉台区');
INSERT INTO  s_area_code  VALUES ('3444', '610721', '陕西省', '汉中市', '南郑县', '陕西省南郑县');
INSERT INTO  s_area_code  VALUES ('3445', '610722', '陕西省', '汉中市', '城固县', '陕西省城固县');
INSERT INTO  s_area_code  VALUES ('3446', '610723', '陕西省', '汉中市', '洋 县', '陕西省洋 县');
INSERT INTO  s_area_code  VALUES ('3447', '610724', '陕西省', '汉中市', '西乡县', '陕西省西乡县');
INSERT INTO  s_area_code  VALUES ('3448', '610725', '陕西省', '汉中市', '勉 县', '陕西省勉 县');
INSERT INTO  s_area_code  VALUES ('3449', '610726', '陕西省', '汉中市', '宁强县', '陕西省宁强县');
INSERT INTO  s_area_code  VALUES ('3450', '610727', '陕西省', '汉中市', '略阳县', '陕西省略阳县');
INSERT INTO  s_area_code  VALUES ('3451', '610728', '陕西省', '汉中市', '镇巴县', '陕西省镇巴县');
INSERT INTO  s_area_code  VALUES ('3452', '610729', '陕西省', '汉中市', '留坝县', '陕西省留坝县');
INSERT INTO  s_area_code  VALUES ('3453', '610730', '陕西省', '汉中市', '佛坪县', '陕西省佛坪县');
INSERT INTO  s_area_code  VALUES ('3454', '610800', '陕西省', '榆林市', '', '陕西省榆林市');
INSERT INTO  s_area_code  VALUES ('3455', '610801', '陕西省', '榆林市', '市辖区', '陕西省榆林市市辖区');
INSERT INTO  s_area_code  VALUES ('3456', '610802', '陕西省', '榆林市', '榆阳区', '陕西省榆林市榆阳区');
INSERT INTO  s_area_code  VALUES ('3457', '610821', '陕西省', '榆林市', '神木县', '陕西省神木县');
INSERT INTO  s_area_code  VALUES ('3458', '610822', '陕西省', '榆林市', '府谷县', '陕西省府谷县');
INSERT INTO  s_area_code  VALUES ('3459', '610823', '陕西省', '榆林市', '横山县', '陕西省横山县');
INSERT INTO  s_area_code  VALUES ('3460', '610824', '陕西省', '榆林市', '靖边县', '陕西省靖边县');
INSERT INTO  s_area_code  VALUES ('3461', '610825', '陕西省', '榆林市', '定边县', '陕西省定边县');
INSERT INTO  s_area_code  VALUES ('3462', '610826', '陕西省', '榆林市', '绥德县', '陕西省绥德县');
INSERT INTO  s_area_code  VALUES ('3463', '610827', '陕西省', '榆林市', '米脂县', '陕西省米脂县');
INSERT INTO  s_area_code  VALUES ('3464', '610828', '陕西省', '榆林市', '佳 县', '陕西省佳 县');
INSERT INTO  s_area_code  VALUES ('3465', '610829', '陕西省', '榆林市', '吴堡县', '陕西省吴堡县');
INSERT INTO  s_area_code  VALUES ('3466', '610830', '陕西省', '榆林市', '清涧县', '陕西省清涧县');
INSERT INTO  s_area_code  VALUES ('3467', '610831', '陕西省', '榆林市', '子洲县', '陕西省子洲县');
INSERT INTO  s_area_code  VALUES ('3468', '610900', '陕西省', '安康市', '', '陕西省安康市');
INSERT INTO  s_area_code  VALUES ('3469', '610901', '陕西省', '安康市', '市辖区', '陕西省安康市市辖区');
INSERT INTO  s_area_code  VALUES ('3470', '610902', '陕西省', '安康市', '汉滨区', '陕西省安康市汉滨区');
INSERT INTO  s_area_code  VALUES ('3471', '610921', '陕西省', '安康市', '汉阴县', '陕西省汉阴县');
INSERT INTO  s_area_code  VALUES ('3472', '610922', '陕西省', '安康市', '石泉县', '陕西省石泉县');
INSERT INTO  s_area_code  VALUES ('3473', '610923', '陕西省', '安康市', '宁陕县', '陕西省宁陕县');
INSERT INTO  s_area_code  VALUES ('3474', '610924', '陕西省', '安康市', '紫阳县', '陕西省紫阳县');
INSERT INTO  s_area_code  VALUES ('3475', '610925', '陕西省', '安康市', '岚皋县', '陕西省岚皋县');
INSERT INTO  s_area_code  VALUES ('3476', '610926', '陕西省', '安康市', '平利县', '陕西省平利县');
INSERT INTO  s_area_code  VALUES ('3477', '610927', '陕西省', '安康市', '镇坪县', '陕西省镇坪县');
INSERT INTO  s_area_code  VALUES ('3478', '610928', '陕西省', '安康市', '旬阳县', '陕西省旬阳县');
INSERT INTO  s_area_code  VALUES ('3479', '610929', '陕西省', '安康市', '白河县', '陕西省白河县');
INSERT INTO  s_area_code  VALUES ('3480', '611000', '陕西省', '商洛市', '', '陕西省商洛市');
INSERT INTO  s_area_code  VALUES ('3481', '611001', '陕西省', '商洛市', '市辖区', '陕西省商洛市市辖区');
INSERT INTO  s_area_code  VALUES ('3482', '611002', '陕西省', '商洛市', '商州区', '陕西省商洛市商州区');
INSERT INTO  s_area_code  VALUES ('3483', '611021', '陕西省', '商洛市', '洛南县', '陕西省洛南县');
INSERT INTO  s_area_code  VALUES ('3484', '611022', '陕西省', '商洛市', '丹凤县', '陕西省丹凤县');
INSERT INTO  s_area_code  VALUES ('3485', '611023', '陕西省', '商洛市', '商南县', '陕西省商南县');
INSERT INTO  s_area_code  VALUES ('3486', '611024', '陕西省', '商洛市', '山阳县', '陕西省山阳县');
INSERT INTO  s_area_code  VALUES ('3487', '611025', '陕西省', '商洛市', '镇安县', '陕西省镇安县');
INSERT INTO  s_area_code  VALUES ('3488', '611026', '陕西省', '商洛市', '柞水县', '陕西省柞水县');
INSERT INTO  s_area_code  VALUES ('3489', '612400', '陕西省', '铜川市', '安康地区 ', '陕西省铜川市安康地区 ');
INSERT INTO  s_area_code  VALUES ('3490', '612401', '陕西省', '铜川市', '安康市', '陕西省铜川市 安康市 ');
INSERT INTO  s_area_code  VALUES ('3491', '612422', '陕西省', '铜川市', '汉阴县', '陕西省铜川市 汉阴县 ');
INSERT INTO  s_area_code  VALUES ('3492', '612423', '陕西省', '铜川市', '石泉县 ', '陕西省铜川市 石泉县 ');
INSERT INTO  s_area_code  VALUES ('3493', '612424', '陕西省', '铜川市', '宁陕县', '陕西省铜川市 宁陕县 ');
INSERT INTO  s_area_code  VALUES ('3494', '612425', '陕西省', '铜川市', '紫阳县', '陕西省铜川市 紫阳县 ');
INSERT INTO  s_area_code  VALUES ('3495', '612426', '陕西省', '铜川市', '岚皋县', '陕西省铜川市 岚皋县 ');
INSERT INTO  s_area_code  VALUES ('3496', '612427', '陕西省', '铜川市', '平利县', '陕西省铜川市 平利县 ');
INSERT INTO  s_area_code  VALUES ('3497', '612428', '陕西省', '铜川市', '镇坪县 ', '陕西省铜川市 镇坪县 ');
INSERT INTO  s_area_code  VALUES ('3498', '612429', '陕西省', '铜川市', '旬阳县', '陕西省铜川市 旬阳县 ');
INSERT INTO  s_area_code  VALUES ('3499', '612430', '陕西省', '铜川市', '白河县', '陕西省铜川市 白河县 ');
INSERT INTO  s_area_code  VALUES ('3500', '620000', '甘肃省', '', '', '甘肃省');
INSERT INTO  s_area_code  VALUES ('3501', '620100', '甘肃省', '兰州市', '', '甘肃省兰州市');
INSERT INTO  s_area_code  VALUES ('3502', '620101', '甘肃省', '兰州市', '市辖区', '甘肃省兰州市市辖区');
INSERT INTO  s_area_code  VALUES ('3503', '620102', '甘肃省', '兰州市', '城关区', '甘肃省兰州市城关区');
INSERT INTO  s_area_code  VALUES ('3504', '620103', '甘肃省', '兰州市', '七里河区', '甘肃省兰州市七里河区');
INSERT INTO  s_area_code  VALUES ('3505', '620104', '甘肃省', '兰州市', '西固区', '甘肃省兰州市西固区');
INSERT INTO  s_area_code  VALUES ('3506', '620105', '甘肃省', '兰州市', '安宁区', '甘肃省兰州市安宁区');
INSERT INTO  s_area_code  VALUES ('3507', '620111', '甘肃省', '兰州市', '红古区', '甘肃省兰州市红古区');
INSERT INTO  s_area_code  VALUES ('3508', '620121', '甘肃省', '兰州市', '永登县', '甘肃省永登县');
INSERT INTO  s_area_code  VALUES ('3509', '620122', '甘肃省', '兰州市', '皋兰县', '甘肃省皋兰县');
INSERT INTO  s_area_code  VALUES ('3510', '620123', '甘肃省', '兰州市', '榆中县', '甘肃省榆中县');
INSERT INTO  s_area_code  VALUES ('3511', '620200', '甘肃省', '嘉峪关市', '', '甘肃省嘉峪关市');
INSERT INTO  s_area_code  VALUES ('3512', '620201', '甘肃省', '嘉峪关市', '市辖区', '甘肃省嘉峪关市市辖区');
INSERT INTO  s_area_code  VALUES ('3513', '620300', '甘肃省', '金昌市', '', '甘肃省金昌市');
INSERT INTO  s_area_code  VALUES ('3514', '620301', '甘肃省', '金昌市', '市辖区', '甘肃省金昌市市辖区');
INSERT INTO  s_area_code  VALUES ('3515', '620302', '甘肃省', '金昌市', '金川区', '甘肃省金昌市金川区');
INSERT INTO  s_area_code  VALUES ('3516', '620321', '甘肃省', '金昌市', '永昌县', '甘肃省永昌县');
INSERT INTO  s_area_code  VALUES ('3517', '620400', '甘肃省', '白银市', '', '甘肃省白银市');
INSERT INTO  s_area_code  VALUES ('3518', '620401', '甘肃省', '白银市', '市辖区', '甘肃省白银市市辖区');
INSERT INTO  s_area_code  VALUES ('3519', '620402', '甘肃省', '白银市', '白银区', '甘肃省白银市白银区');
INSERT INTO  s_area_code  VALUES ('3520', '620403', '甘肃省', '白银市', '平川区', '甘肃省白银市平川区');
INSERT INTO  s_area_code  VALUES ('3521', '620421', '甘肃省', '白银市', '靖远县', '甘肃省靖远县');
INSERT INTO  s_area_code  VALUES ('3522', '620422', '甘肃省', '白银市', '会宁县', '甘肃省会宁县');
INSERT INTO  s_area_code  VALUES ('3523', '620423', '甘肃省', '白银市', '景泰县', '甘肃省景泰县');
INSERT INTO  s_area_code  VALUES ('3524', '620500', '甘肃省', '天水市', '', '甘肃省天水市');
INSERT INTO  s_area_code  VALUES ('3525', '620501', '甘肃省', '天水市', '市辖区', '甘肃省天水市市辖区');
INSERT INTO  s_area_code  VALUES ('3526', '620502', '甘肃省', '天水市', '秦城区', '甘肃省天水市秦城区');
INSERT INTO  s_area_code  VALUES ('3527', '620503', '甘肃省', '天水市', '北道区', '甘肃省天水市北道区');
INSERT INTO  s_area_code  VALUES ('3528', '620521', '甘肃省', '天水市', '清水县', '甘肃省清水县');
INSERT INTO  s_area_code  VALUES ('3529', '620522', '甘肃省', '天水市', '秦安县', '甘肃省秦安县');
INSERT INTO  s_area_code  VALUES ('3530', '620523', '甘肃省', '天水市', '甘谷县', '甘肃省甘谷县');
INSERT INTO  s_area_code  VALUES ('3531', '620524', '甘肃省', '天水市', '武山县', '甘肃省武山县');
INSERT INTO  s_area_code  VALUES ('3532', '620525', '甘肃省', '天水市', '张家川回族自治县', '甘肃省张家川回族自治县');
INSERT INTO  s_area_code  VALUES ('3533', '620600', '甘肃省', '武威市', '', '甘肃省武威市');
INSERT INTO  s_area_code  VALUES ('3534', '620601', '甘肃省', '武威市', '市辖区', '甘肃省武威市市辖区');
INSERT INTO  s_area_code  VALUES ('3535', '620602', '甘肃省', '武威市', '凉州区', '甘肃省武威市凉州区');
INSERT INTO  s_area_code  VALUES ('3536', '620621', '甘肃省', '武威市', '民勤县', '甘肃省民勤县');
INSERT INTO  s_area_code  VALUES ('3537', '620622', '甘肃省', '武威市', '古浪县', '甘肃省古浪县');
INSERT INTO  s_area_code  VALUES ('3538', '620623', '甘肃省', '武威市', '天祝藏族自治县', '甘肃省天祝藏族自治县');
INSERT INTO  s_area_code  VALUES ('3539', '620700', '甘肃省', '张掖市', '', '甘肃省张掖市');
INSERT INTO  s_area_code  VALUES ('3540', '620701', '甘肃省', '张掖市', '市辖区', '甘肃省张掖市市辖区');
INSERT INTO  s_area_code  VALUES ('3541', '620702', '甘肃省', '张掖市', '甘州区', '甘肃省张掖市甘州区');
INSERT INTO  s_area_code  VALUES ('3542', '620721', '甘肃省', '张掖市', '肃南裕固族自治县', '甘肃省肃南裕固族自治县');
INSERT INTO  s_area_code  VALUES ('3543', '620722', '甘肃省', '张掖市', '民乐县', '甘肃省民乐县');
INSERT INTO  s_area_code  VALUES ('3544', '620723', '甘肃省', '张掖市', '临泽县', '甘肃省临泽县');
INSERT INTO  s_area_code  VALUES ('3545', '620724', '甘肃省', '张掖市', '高台县', '甘肃省高台县');
INSERT INTO  s_area_code  VALUES ('3546', '620725', '甘肃省', '张掖市', '山丹县', '甘肃省山丹县');
INSERT INTO  s_area_code  VALUES ('3547', '620800', '甘肃省', '平凉市', '', '甘肃省平凉市');
INSERT INTO  s_area_code  VALUES ('3548', '620801', '甘肃省', '平凉市', '市辖区', '甘肃省平凉市市辖区');
INSERT INTO  s_area_code  VALUES ('3549', '620802', '甘肃省', '平凉市', '崆峒区', '甘肃省平凉市崆峒区');
INSERT INTO  s_area_code  VALUES ('3550', '620821', '甘肃省', '平凉市', '泾川县', '甘肃省泾川县');
INSERT INTO  s_area_code  VALUES ('3551', '620822', '甘肃省', '平凉市', '灵台县', '甘肃省灵台县');
INSERT INTO  s_area_code  VALUES ('3552', '620823', '甘肃省', '平凉市', '崇信县', '甘肃省崇信县');
INSERT INTO  s_area_code  VALUES ('3553', '620824', '甘肃省', '平凉市', '华亭县', '甘肃省华亭县');
INSERT INTO  s_area_code  VALUES ('3554', '620825', '甘肃省', '平凉市', '庄浪县', '甘肃省庄浪县');
INSERT INTO  s_area_code  VALUES ('3555', '620826', '甘肃省', '平凉市', '静宁县', '甘肃省静宁县');
INSERT INTO  s_area_code  VALUES ('3556', '620900', '甘肃省', '酒泉市', '', '甘肃省酒泉市');
INSERT INTO  s_area_code  VALUES ('3557', '620901', '甘肃省', '酒泉市', '市辖区', '甘肃省酒泉市市辖区');
INSERT INTO  s_area_code  VALUES ('3558', '620902', '甘肃省', '酒泉市', '肃州区', '甘肃省酒泉市肃州区');
INSERT INTO  s_area_code  VALUES ('3559', '620921', '甘肃省', '酒泉市', '金塔县', '甘肃省金塔县');
INSERT INTO  s_area_code  VALUES ('3560', '620922', '甘肃省', '酒泉市', '安西县', '甘肃省安西县');
INSERT INTO  s_area_code  VALUES ('3561', '620923', '甘肃省', '酒泉市', '肃北蒙古族自治县', '甘肃省肃北蒙古族自治县');
INSERT INTO  s_area_code  VALUES ('3562', '620924', '甘肃省', '酒泉市', '阿克塞哈萨克族自治县', '甘肃省阿克塞哈萨克族自治县');
INSERT INTO  s_area_code  VALUES ('3563', '620981', '甘肃省', '酒泉市', '玉门市', '甘肃省玉门市');
INSERT INTO  s_area_code  VALUES ('3564', '620982', '甘肃省', '酒泉市', '敦煌市', '甘肃省敦煌市');
INSERT INTO  s_area_code  VALUES ('3565', '621000', '甘肃省', '庆阳市', '', '甘肃省庆阳市');
INSERT INTO  s_area_code  VALUES ('3566', '621001', '甘肃省', '庆阳市', '市辖区', '甘肃省庆阳市市辖区');
INSERT INTO  s_area_code  VALUES ('3567', '621002', '甘肃省', '庆阳市', '西峰区', '甘肃省庆阳市西峰区');
INSERT INTO  s_area_code  VALUES ('3568', '621021', '甘肃省', '庆阳市', '庆城县', '甘肃省庆城县');
INSERT INTO  s_area_code  VALUES ('3569', '621022', '甘肃省', '庆阳市', '环 县', '甘肃省环 县');
INSERT INTO  s_area_code  VALUES ('3570', '621023', '甘肃省', '庆阳市', '华池县', '甘肃省华池县');
INSERT INTO  s_area_code  VALUES ('3571', '621024', '甘肃省', '庆阳市', '合水县', '甘肃省合水县');
INSERT INTO  s_area_code  VALUES ('3572', '621025', '甘肃省', '庆阳市', '正宁县', '甘肃省正宁县');
INSERT INTO  s_area_code  VALUES ('3573', '621026', '甘肃省', '庆阳市', '宁 县', '甘肃省宁 县');
INSERT INTO  s_area_code  VALUES ('3574', '621027', '甘肃省', '庆阳市', '镇原县', '甘肃省镇原县');
INSERT INTO  s_area_code  VALUES ('3575', '621100', '甘肃省', '定西市', '', '甘肃省定西市');
INSERT INTO  s_area_code  VALUES ('3576', '621101', '甘肃省', '定西市', '市辖区', '甘肃省定西市市辖区');
INSERT INTO  s_area_code  VALUES ('3577', '621102', '甘肃省', '定西市', '安定区', '甘肃省定西市安定区');
INSERT INTO  s_area_code  VALUES ('3578', '621121', '甘肃省', '定西市', '通渭县', '甘肃省通渭县');
INSERT INTO  s_area_code  VALUES ('3579', '621122', '甘肃省', '定西市', '陇西县', '甘肃省陇西县');
INSERT INTO  s_area_code  VALUES ('3580', '621123', '甘肃省', '定西市', '渭源县', '甘肃省渭源县');
INSERT INTO  s_area_code  VALUES ('3581', '621124', '甘肃省', '定西市', '临洮县', '甘肃省临洮县');
INSERT INTO  s_area_code  VALUES ('3582', '621125', '甘肃省', '定西市', '漳 县', '甘肃省漳 县');
INSERT INTO  s_area_code  VALUES ('3583', '621126', '甘肃省', '定西市', '岷 县', '甘肃省岷 县');
INSERT INTO  s_area_code  VALUES ('3584', '621200', '甘肃省', '陇南市', '', '甘肃省陇南市');
INSERT INTO  s_area_code  VALUES ('3585', '621201', '甘肃省', '陇南市', '市辖区', '甘肃省陇南市市辖区');
INSERT INTO  s_area_code  VALUES ('3586', '621202', '甘肃省', '陇南市', '武都区', '甘肃省陇南市武都区');
INSERT INTO  s_area_code  VALUES ('3587', '621221', '甘肃省', '陇南市', '成 县', '甘肃省成 县');
INSERT INTO  s_area_code  VALUES ('3588', '621222', '甘肃省', '陇南市', '文 县', '甘肃省文 县');
INSERT INTO  s_area_code  VALUES ('3589', '621223', '甘肃省', '陇南市', '宕昌县', '甘肃省宕昌县');
INSERT INTO  s_area_code  VALUES ('3590', '621224', '甘肃省', '陇南市', '康 县', '甘肃省康 县');
INSERT INTO  s_area_code  VALUES ('3591', '621225', '甘肃省', '陇南市', '西和县', '甘肃省西和县');
INSERT INTO  s_area_code  VALUES ('3592', '621226', '甘肃省', '陇南市', '礼 县', '甘肃省礼 县');
INSERT INTO  s_area_code  VALUES ('3593', '621227', '甘肃省', '陇南市', '徽 县', '甘肃省徽 县');
INSERT INTO  s_area_code  VALUES ('3594', '621228', '甘肃省', '陇南市', '两当县', '甘肃省两当县');
INSERT INTO  s_area_code  VALUES ('3595', '622400', '甘肃省', '', '', '甘肃省定西地区');
INSERT INTO  s_area_code  VALUES ('3596', '622421', '甘肃省', '', '', '甘肃省定西县');
INSERT INTO  s_area_code  VALUES ('3597', '622600', '甘肃省', '', '', '甘肃省陇南地区');
INSERT INTO  s_area_code  VALUES ('3598', '622621', '甘肃省', '', '', '甘肃省陇南地区武都县');
INSERT INTO  s_area_code  VALUES ('3599', '622629', '甘肃省', '', '', '甘肃省陇南地区徽县两当县');
INSERT INTO  s_area_code  VALUES ('3600', '622630', '甘肃省', '', '', '甘肃省陇南地区徽县');
INSERT INTO  s_area_code  VALUES ('3601', '622900', '甘肃省', '临夏回族自治州', '', '甘肃省临夏回族自治州');
INSERT INTO  s_area_code  VALUES ('3602', '622901', '甘肃省', '临夏回族自治州', '临夏市', '甘肃省临夏市');
INSERT INTO  s_area_code  VALUES ('3603', '622921', '甘肃省', '临夏回族自治州', '临夏县', '甘肃省临夏县');
INSERT INTO  s_area_code  VALUES ('3604', '622922', '甘肃省', '临夏回族自治州', '康乐县', '甘肃省康乐县');
INSERT INTO  s_area_code  VALUES ('3605', '622923', '甘肃省', '临夏回族自治州', '永靖县', '甘肃省永靖县');
INSERT INTO  s_area_code  VALUES ('3606', '622924', '甘肃省', '临夏回族自治州', '广河县', '甘肃省广河县');
INSERT INTO  s_area_code  VALUES ('3607', '622925', '甘肃省', '临夏回族自治州', '和政县', '甘肃省和政县');
INSERT INTO  s_area_code  VALUES ('3608', '622926', '甘肃省', '临夏回族自治州', '东乡族自治县', '甘肃省东乡族自治县');
INSERT INTO  s_area_code  VALUES ('3609', '622927', '甘肃省', '临夏回族自治州', '积石山保安族东乡族撒拉族自治县', '甘肃省积石山保安族东乡族撒拉族自治县');
INSERT INTO  s_area_code  VALUES ('3610', '623000', '甘肃省', '甘南藏族自治州', '', '甘肃省甘南藏族自治州');
INSERT INTO  s_area_code  VALUES ('3611', '623001', '甘肃省', '甘南藏族自治州', '合作市', '甘肃省合作市');
INSERT INTO  s_area_code  VALUES ('3612', '623021', '甘肃省', '甘南藏族自治州', '临潭县', '甘肃省临潭县');
INSERT INTO  s_area_code  VALUES ('3613', '623022', '甘肃省', '甘南藏族自治州', '卓尼县', '甘肃省卓尼县');
INSERT INTO  s_area_code  VALUES ('3614', '623023', '甘肃省', '甘南藏族自治州', '舟曲县', '甘肃省舟曲县');
INSERT INTO  s_area_code  VALUES ('3615', '623024', '甘肃省', '甘南藏族自治州', '迭部县', '甘肃省迭部县');
INSERT INTO  s_area_code  VALUES ('3616', '623025', '甘肃省', '甘南藏族自治州', '玛曲县', '甘肃省玛曲县');
INSERT INTO  s_area_code  VALUES ('3617', '623026', '甘肃省', '甘南藏族自治州', '碌曲县', '甘肃省碌曲县');
INSERT INTO  s_area_code  VALUES ('3618', '623027', '甘肃省', '甘南藏族自治州', '夏河县', '甘肃省夏河县');
INSERT INTO  s_area_code  VALUES ('3619', '630000', '青海省', '', '', '青海省');
INSERT INTO  s_area_code  VALUES ('3620', '630100', '青海省', '西宁市', '', '青海省西宁市');
INSERT INTO  s_area_code  VALUES ('3621', '630101', '青海省', '西宁市', '市辖区', '青海省西宁市市辖区');
INSERT INTO  s_area_code  VALUES ('3622', '630102', '青海省', '西宁市', '城东区', '青海省西宁市城东区');
INSERT INTO  s_area_code  VALUES ('3623', '630103', '青海省', '西宁市', '城中区', '青海省西宁市城中区');
INSERT INTO  s_area_code  VALUES ('3624', '630104', '青海省', '西宁市', '城西区', '青海省西宁市城西区');
INSERT INTO  s_area_code  VALUES ('3625', '630105', '青海省', '西宁市', '城北区', '青海省西宁市城北区');
INSERT INTO  s_area_code  VALUES ('3626', '630121', '青海省', '西宁市', '大通回族土族自治县', '青海省大通回族土族自治县');
INSERT INTO  s_area_code  VALUES ('3627', '630122', '青海省', '西宁市', '湟中县', '青海省湟中县');
INSERT INTO  s_area_code  VALUES ('3628', '630123', '青海省', '西宁市', '湟源县', '青海省湟源县');
INSERT INTO  s_area_code  VALUES ('3629', '632100', '青海省', '海东地区', '', '青海省海东地区');
INSERT INTO  s_area_code  VALUES ('3630', '632121', '青海省', '海东地区', '平安县', '青海省平安县');
INSERT INTO  s_area_code  VALUES ('3631', '632122', '青海省', '海东地区', '民和回族土族自治县', '青海省民和回族土族自治县');
INSERT INTO  s_area_code  VALUES ('3632', '632123', '青海省', '海东地区', '乐都县', '青海省乐都县');
INSERT INTO  s_area_code  VALUES ('3633', '632126', '青海省', '海东地区', '互助土族自治县', '青海省互助土族自治县');
INSERT INTO  s_area_code  VALUES ('3634', '632127', '青海省', '海东地区', '化隆回族自治县', '青海省化隆回族自治县');
INSERT INTO  s_area_code  VALUES ('3635', '632128', '青海省', '海东地区', '循化撒拉族自治县', '青海省循化撒拉族自治县');
INSERT INTO  s_area_code  VALUES ('3636', '632200', '青海省', '海北藏族自治州', '', '青海省海北藏族自治州');
INSERT INTO  s_area_code  VALUES ('3637', '632221', '青海省', '海北藏族自治州', '门源回族自治县', '青海省门源回族自治县');
INSERT INTO  s_area_code  VALUES ('3638', '632222', '青海省', '海北藏族自治州', '祁连县', '青海省祁连县');
INSERT INTO  s_area_code  VALUES ('3639', '632223', '青海省', '海北藏族自治州', '海晏县', '青海省海晏县');
INSERT INTO  s_area_code  VALUES ('3640', '632224', '青海省', '海北藏族自治州', '刚察县', '青海省刚察县');
INSERT INTO  s_area_code  VALUES ('3641', '632300', '青海省', '黄南藏族自治州', '', '青海省黄南藏族自治州');
INSERT INTO  s_area_code  VALUES ('3642', '632321', '青海省', '黄南藏族自治州', '同仁县', '青海省同仁县');
INSERT INTO  s_area_code  VALUES ('3643', '632322', '青海省', '黄南藏族自治州', '尖扎县', '青海省尖扎县');
INSERT INTO  s_area_code  VALUES ('3644', '632323', '青海省', '黄南藏族自治州', '泽库县', '青海省泽库县');
INSERT INTO  s_area_code  VALUES ('3645', '632324', '青海省', '黄南藏族自治州', '河南蒙古族自治县', '青海省河南蒙古族自治县');
INSERT INTO  s_area_code  VALUES ('3646', '632500', '青海省', '海南藏族自治州', '', '青海省海南藏族自治州');
INSERT INTO  s_area_code  VALUES ('3647', '632521', '青海省', '海南藏族自治州', '共和县', '青海省共和县');
INSERT INTO  s_area_code  VALUES ('3648', '632522', '青海省', '海南藏族自治州', '同德县', '青海省同德县');
INSERT INTO  s_area_code  VALUES ('3649', '632523', '青海省', '海南藏族自治州', '贵德县', '青海省贵德县');
INSERT INTO  s_area_code  VALUES ('3650', '632524', '青海省', '海南藏族自治州', '兴海县', '青海省兴海县');
INSERT INTO  s_area_code  VALUES ('3651', '632525', '青海省', '海南藏族自治州', '贵南县', '青海省贵南县');
INSERT INTO  s_area_code  VALUES ('3652', '632600', '青海省', '果洛藏族自治州', '', '青海省果洛藏族自治州');
INSERT INTO  s_area_code  VALUES ('3653', '632621', '青海省', '果洛藏族自治州', '玛沁县', '青海省玛沁县');
INSERT INTO  s_area_code  VALUES ('3654', '632622', '青海省', '果洛藏族自治州', '班玛县', '青海省班玛县');
INSERT INTO  s_area_code  VALUES ('3655', '632623', '青海省', '果洛藏族自治州', '甘德县', '青海省甘德县');
INSERT INTO  s_area_code  VALUES ('3656', '632624', '青海省', '果洛藏族自治州', '达日县', '青海省达日县');
INSERT INTO  s_area_code  VALUES ('3657', '632625', '青海省', '果洛藏族自治州', '久治县', '青海省久治县');
INSERT INTO  s_area_code  VALUES ('3658', '632626', '青海省', '果洛藏族自治州', '玛多县', '青海省玛多县');
INSERT INTO  s_area_code  VALUES ('3659', '632700', '青海省', '玉树藏族自治州', '', '青海省玉树藏族自治州');
INSERT INTO  s_area_code  VALUES ('3660', '632721', '青海省', '玉树藏族自治州', '玉树县', '青海省玉树县');
INSERT INTO  s_area_code  VALUES ('3661', '632722', '青海省', '玉树藏族自治州', '杂多县', '青海省杂多县');
INSERT INTO  s_area_code  VALUES ('3662', '632723', '青海省', '玉树藏族自治州', '称多县', '青海省称多县');
INSERT INTO  s_area_code  VALUES ('3663', '632724', '青海省', '玉树藏族自治州', '治多县', '青海省治多县');
INSERT INTO  s_area_code  VALUES ('3664', '632725', '青海省', '玉树藏族自治州', '囊谦县', '青海省囊谦县');
INSERT INTO  s_area_code  VALUES ('3665', '632726', '青海省', '玉树藏族自治州', '曲麻莱县', '青海省曲麻莱县');
INSERT INTO  s_area_code  VALUES ('3666', '632800', '青海省', '海西蒙古族藏族自治州', '', '青海省海西蒙古族藏族自治州');
INSERT INTO  s_area_code  VALUES ('3667', '632801', '青海省', '海西蒙古族藏族自治州', '格尔木市', '青海省格尔木市');
INSERT INTO  s_area_code  VALUES ('3668', '632802', '青海省', '海西蒙古族藏族自治州', '德令哈市', '青海省德令哈市');
INSERT INTO  s_area_code  VALUES ('3669', '632821', '青海省', '海西蒙古族藏族自治州', '乌兰县', '青海省乌兰县');
INSERT INTO  s_area_code  VALUES ('3670', '632822', '青海省', '海西蒙古族藏族自治州', '都兰县', '青海省都兰县');
INSERT INTO  s_area_code  VALUES ('3671', '632823', '青海省', '海西蒙古族藏族自治州', '天峻县', '青海省天峻县');
INSERT INTO  s_area_code  VALUES ('3672', '640000', '宁夏回族自治区', '', '', '宁夏回族自治区');
INSERT INTO  s_area_code  VALUES ('3673', '640100', '宁夏回族自治区', '银川市', '', '宁夏回族自治区银川市');
INSERT INTO  s_area_code  VALUES ('3674', '640101', '宁夏回族自治区', '银川市', '市辖区', '宁夏回族自治区银川市市辖区');
INSERT INTO  s_area_code  VALUES ('3675', '640104', '宁夏回族自治区', '银川市', '兴庆区', '宁夏回族自治区银川市兴庆区');
INSERT INTO  s_area_code  VALUES ('3676', '640105', '宁夏回族自治区', '银川市', '西夏区', '宁夏回族自治区银川市西夏区');
INSERT INTO  s_area_code  VALUES ('3677', '640106', '宁夏回族自治区', '银川市', '金凤区', '宁夏回族自治区银川市金凤区');
INSERT INTO  s_area_code  VALUES ('3678', '640121', '宁夏回族自治区', '银川市', '永宁县', '宁夏回族自治区永宁县');
INSERT INTO  s_area_code  VALUES ('3679', '640122', '宁夏回族自治区', '银川市', '贺兰县', '宁夏回族自治区贺兰县');
INSERT INTO  s_area_code  VALUES ('3680', '640181', '宁夏回族自治区', '银川市', '灵武市', '宁夏回族自治区灵武市');
INSERT INTO  s_area_code  VALUES ('3681', '640200', '宁夏回族自治区', '石嘴山市', '', '宁夏回族自治区石嘴山市');
INSERT INTO  s_area_code  VALUES ('3682', '640201', '宁夏回族自治区', '石嘴山市', '市辖区', '宁夏回族自治区石嘴山市市辖区');
INSERT INTO  s_area_code  VALUES ('3683', '640202', '宁夏回族自治区', '石嘴山市', '大武口区', '宁夏回族自治区石嘴山市大武口区');
INSERT INTO  s_area_code  VALUES ('3684', '640203', '宁夏回族自治区', '石嘴山市', '石嘴山区', '宁夏回族自治区石嘴山区');
INSERT INTO  s_area_code  VALUES ('3685', '640205', '宁夏回族自治区', '石嘴山市', '惠农区', '宁夏回族自治区石嘴山市惠农区');
INSERT INTO  s_area_code  VALUES ('3686', '640221', '宁夏回族自治区', '石嘴山市', '平罗县', '宁夏回族自治区平罗县');
INSERT INTO  s_area_code  VALUES ('3687', '640222', '宁夏回族自治区', '', '', '宁夏回族自治区陶乐县');
INSERT INTO  s_area_code  VALUES ('3688', '640223', '宁夏回族自治区', '', '', '宁夏回族自治区惠农县');
INSERT INTO  s_area_code  VALUES ('3689', '640300', '宁夏回族自治区', '吴忠市', '', '宁夏回族自治区吴忠市');
INSERT INTO  s_area_code  VALUES ('3690', '640301', '宁夏回族自治区', '吴忠市', '市辖区', '宁夏回族自治区吴忠市市辖区');
INSERT INTO  s_area_code  VALUES ('3691', '640302', '宁夏回族自治区', '吴忠市', '利通区', '宁夏回族自治区吴忠市利通区');
INSERT INTO  s_area_code  VALUES ('3692', '640321', '宁夏回族自治区', '吴忠市', '中卫县', '宁夏回族自治区中卫县');
INSERT INTO  s_area_code  VALUES ('3693', '640322', '宁夏回族自治区', '吴忠市', '中宁县', '宁夏回族自治区中宁县');
INSERT INTO  s_area_code  VALUES ('3694', '640323', '宁夏回族自治区', '吴忠市', '盐池县', '宁夏回族自治区盐池县');
INSERT INTO  s_area_code  VALUES ('3695', '640324', '宁夏回族自治区', '吴忠市', '同心县', '宁夏回族自治区同心县');
INSERT INTO  s_area_code  VALUES ('3696', '640381', '宁夏回族自治区', '吴忠市', '青铜峡市', '宁夏回族自治区青铜峡市');
INSERT INTO  s_area_code  VALUES ('3697', '640400', '宁夏回族自治区', '固原市', '', '宁夏回族自治区固原市');
INSERT INTO  s_area_code  VALUES ('3698', '640401', '宁夏回族自治区', '固原市', '市辖区', '宁夏回族自治区固原市市辖区');
INSERT INTO  s_area_code  VALUES ('3699', '640402', '宁夏回族自治区', '固原市', '原州区', '宁夏回族自治区固原市原州区');
INSERT INTO  s_area_code  VALUES ('3700', '640421', '宁夏回族自治区', '固原市', '海原县', '宁夏回族自治区海原县');
INSERT INTO  s_area_code  VALUES ('3701', '640422', '宁夏回族自治区', '固原市', '西吉县', '宁夏回族自治区西吉县');
INSERT INTO  s_area_code  VALUES ('3702', '640423', '宁夏回族自治区', '固原市', '隆德县', '宁夏回族自治区隆德县');
INSERT INTO  s_area_code  VALUES ('3703', '640424', '宁夏回族自治区', '固原市', '泾源县', '宁夏回族自治区泾源县');
INSERT INTO  s_area_code  VALUES ('3704', '640425', '宁夏回族自治区', '固原市', '彭阳县', '宁夏回族自治区彭阳县');
INSERT INTO  s_area_code  VALUES ('3705', '640500', '宁夏回族自治区', '中卫市', '', '宁夏回族自治区中卫市');
INSERT INTO  s_area_code  VALUES ('3706', '640501', '宁夏回族自治区', '中卫市', '市辖区', '宁夏回族自治区中卫市市辖区');
INSERT INTO  s_area_code  VALUES ('3707', '640502', '宁夏回族自治区', '中卫市', '沙坡头区', '宁夏回族自治区中卫市沙坡头区');
INSERT INTO  s_area_code  VALUES ('3708', '640521', '宁夏回族自治区', '中卫市', '中宁县', '宁夏回族自治区中宁县');
INSERT INTO  s_area_code  VALUES ('3709', '640522', '宁夏回族自治区', '中卫市', '海原县', '宁夏回族自治区海原县');
INSERT INTO  s_area_code  VALUES ('3710', '650000', '新疆维吾尔自治区', '', '', '新疆维吾尔自治区');
INSERT INTO  s_area_code  VALUES ('3711', '650100', '新疆维吾尔自治区', '乌鲁木齐市', '', '新疆维吾尔自治区乌鲁木齐市');
INSERT INTO  s_area_code  VALUES ('3712', '650101', '新疆维吾尔自治区', '乌鲁木齐市', '市辖区', '新疆维吾尔自治区乌鲁木齐市市辖区');
INSERT INTO  s_area_code  VALUES ('3713', '650102', '新疆维吾尔自治区', '乌鲁木齐市', '天山区', '新疆维吾尔自治区乌鲁木齐市天山区');
INSERT INTO  s_area_code  VALUES ('3714', '650103', '新疆维吾尔自治区', '乌鲁木齐市', '沙依巴克区', '新疆维吾尔自治区乌鲁木齐市沙依巴克区');
INSERT INTO  s_area_code  VALUES ('3715', '650104', '新疆维吾尔自治区', '乌鲁木齐市', '新市区', '新疆维吾尔自治区乌鲁木齐市新市区');
INSERT INTO  s_area_code  VALUES ('3716', '650105', '新疆维吾尔自治区', '乌鲁木齐市', '水磨沟区', '新疆维吾尔自治区乌鲁木齐市水磨沟区');
INSERT INTO  s_area_code  VALUES ('3717', '650106', '新疆维吾尔自治区', '乌鲁木齐市', '头屯河区', '新疆维吾尔自治区乌鲁木齐市头屯河区');
INSERT INTO  s_area_code  VALUES ('3718', '650107', '新疆维吾尔自治区', '乌鲁木齐市', '达坂城区', '新疆维吾尔自治区乌鲁木齐市达坂城区');
INSERT INTO  s_area_code  VALUES ('3719', '650108', '新疆维吾尔自治区', '乌鲁木齐市', '东山区', '新疆维吾尔自治区乌鲁木齐市东山区');
INSERT INTO  s_area_code  VALUES ('3720', '650121', '新疆维吾尔自治区', '乌鲁木齐市', '乌鲁木齐县', '新疆维吾尔自治区乌鲁木齐县');
INSERT INTO  s_area_code  VALUES ('3721', '650200', '新疆维吾尔自治区', '克拉玛依市', '', '新疆维吾尔自治区克拉玛依市');
INSERT INTO  s_area_code  VALUES ('3722', '650201', '新疆维吾尔自治区', '克拉玛依市', '市辖区', '新疆维吾尔自治区克拉玛依市市辖区');
INSERT INTO  s_area_code  VALUES ('3723', '650202', '新疆维吾尔自治区', '克拉玛依市', '独山子区', '新疆维吾尔自治区克拉玛依市独山子区');
INSERT INTO  s_area_code  VALUES ('3724', '650203', '新疆维吾尔自治区', '克拉玛依市', '克拉玛依区', '新疆维吾尔自治区克拉玛依市克拉玛依区');
INSERT INTO  s_area_code  VALUES ('3725', '650204', '新疆维吾尔自治区', '克拉玛依市', '白碱滩区', '新疆维吾尔自治区克拉玛依市白碱滩区');
INSERT INTO  s_area_code  VALUES ('3726', '650205', '新疆维吾尔自治区', '克拉玛依市', '乌尔禾区', '新疆维吾尔自治区克拉玛依市乌尔禾区');
INSERT INTO  s_area_code  VALUES ('3727', '652100', '新疆维吾尔自治区', '吐鲁番地区', '', '新疆维吾尔自治区吐鲁番地区');
INSERT INTO  s_area_code  VALUES ('3728', '652101', '新疆维吾尔自治区', '吐鲁番地区', '吐鲁番市', '新疆维吾尔自治区吐鲁番市');
INSERT INTO  s_area_code  VALUES ('3729', '652122', '新疆维吾尔自治区', '吐鲁番地区', '鄯善县', '新疆维吾尔自治区鄯善县');
INSERT INTO  s_area_code  VALUES ('3730', '652123', '新疆维吾尔自治区', '吐鲁番地区', '托克逊县', '新疆维吾尔自治区托克逊县');
INSERT INTO  s_area_code  VALUES ('3731', '652200', '新疆维吾尔自治区', '哈密地区', '', '新疆维吾尔自治区哈密地区');
INSERT INTO  s_area_code  VALUES ('3732', '652201', '新疆维吾尔自治区', '哈密地区', '哈密市', '新疆维吾尔自治区哈密市');
INSERT INTO  s_area_code  VALUES ('3733', '652222', '新疆维吾尔自治区', '哈密地区', '巴里坤哈萨克自治县', '新疆维吾尔自治区巴里坤哈萨克自治县');
INSERT INTO  s_area_code  VALUES ('3734', '652223', '新疆维吾尔自治区', '哈密地区', '伊吾县', '新疆维吾尔自治区伊吾县');
INSERT INTO  s_area_code  VALUES ('3735', '652300', '新疆维吾尔自治区', '昌吉回族自治州', '', '新疆维吾尔自治区昌吉回族自治州');
INSERT INTO  s_area_code  VALUES ('3736', '652301', '新疆维吾尔自治区', '昌吉回族自治州', '昌吉市', '新疆维吾尔自治区昌吉市');
INSERT INTO  s_area_code  VALUES ('3737', '652302', '新疆维吾尔自治区', '昌吉回族自治州', '阜康市', '新疆维吾尔自治区阜康市');
INSERT INTO  s_area_code  VALUES ('3738', '652303', '新疆维吾尔自治区', '昌吉回族自治州', '米泉市', '新疆维吾尔自治区米泉市');
INSERT INTO  s_area_code  VALUES ('3739', '652323', '新疆维吾尔自治区', '昌吉回族自治州', '呼图壁县', '新疆维吾尔自治区呼图壁县');
INSERT INTO  s_area_code  VALUES ('3740', '652324', '新疆维吾尔自治区', '昌吉回族自治州', '玛纳斯县', '新疆维吾尔自治区玛纳斯县');
INSERT INTO  s_area_code  VALUES ('3741', '652325', '新疆维吾尔自治区', '昌吉回族自治州', '奇台县', '新疆维吾尔自治区奇台县');
INSERT INTO  s_area_code  VALUES ('3742', '652327', '新疆维吾尔自治区', '昌吉回族自治州', '吉木萨尔县', '新疆维吾尔自治区吉木萨尔县');
INSERT INTO  s_area_code  VALUES ('3743', '652328', '新疆维吾尔自治区', '昌吉回族自治州', '木垒哈萨克自治县', '新疆维吾尔自治区木垒哈萨克自治县');
INSERT INTO  s_area_code  VALUES ('3744', '652700', '新疆维吾尔自治区', '博尔塔拉蒙古自治州', '', '新疆维吾尔自治区博尔塔拉蒙古自治州');
INSERT INTO  s_area_code  VALUES ('3745', '652701', '新疆维吾尔自治区', '博尔塔拉蒙古自治州', '博乐市', '新疆维吾尔自治区博乐市');
INSERT INTO  s_area_code  VALUES ('3746', '652722', '新疆维吾尔自治区', '博尔塔拉蒙古自治州', '精河县', '新疆维吾尔自治区精河县');
INSERT INTO  s_area_code  VALUES ('3747', '652723', '新疆维吾尔自治区', '博尔塔拉蒙古自治州', '温泉县', '新疆维吾尔自治区温泉县');
INSERT INTO  s_area_code  VALUES ('3748', '652800', '新疆维吾尔自治区', '巴音郭楞蒙古自治州', '', '新疆维吾尔自治区巴音郭楞蒙古自治州');
INSERT INTO  s_area_code  VALUES ('3749', '652801', '新疆维吾尔自治区', '巴音郭楞蒙古自治州', '库尔勒市', '新疆维吾尔自治区库尔勒市');
INSERT INTO  s_area_code  VALUES ('3750', '652822', '新疆维吾尔自治区', '巴音郭楞蒙古自治州', '轮台县', '新疆维吾尔自治区轮台县');
INSERT INTO  s_area_code  VALUES ('3751', '652823', '新疆维吾尔自治区', '巴音郭楞蒙古自治州', '尉犁县', '新疆维吾尔自治区尉犁县');
INSERT INTO  s_area_code  VALUES ('3752', '652824', '新疆维吾尔自治区', '巴音郭楞蒙古自治州', '若羌县', '新疆维吾尔自治区若羌县');
INSERT INTO  s_area_code  VALUES ('3753', '652825', '新疆维吾尔自治区', '巴音郭楞蒙古自治州', '且末县', '新疆维吾尔自治区且末县');
INSERT INTO  s_area_code  VALUES ('3754', '652826', '新疆维吾尔自治区', '巴音郭楞蒙古自治州', '焉耆回族自治县', '新疆维吾尔自治区焉耆回族自治县');
INSERT INTO  s_area_code  VALUES ('3755', '652827', '新疆维吾尔自治区', '巴音郭楞蒙古自治州', '和静县', '新疆维吾尔自治区和静县');
INSERT INTO  s_area_code  VALUES ('3756', '652828', '新疆维吾尔自治区', '巴音郭楞蒙古自治州', '和硕县', '新疆维吾尔自治区和硕县');
INSERT INTO  s_area_code  VALUES ('3757', '652829', '新疆维吾尔自治区', '巴音郭楞蒙古自治州', '博湖县', '新疆维吾尔自治区博湖县');
INSERT INTO  s_area_code  VALUES ('3758', '652900', '新疆维吾尔自治区', '阿克苏地区', '', '新疆维吾尔自治区阿克苏地区');
INSERT INTO  s_area_code  VALUES ('3759', '652901', '新疆维吾尔自治区', '阿克苏地区', '阿克苏市', '新疆维吾尔自治区阿克苏市');
INSERT INTO  s_area_code  VALUES ('3760', '652922', '新疆维吾尔自治区', '阿克苏地区', '温宿县', '新疆维吾尔自治区温宿县');
INSERT INTO  s_area_code  VALUES ('3761', '652923', '新疆维吾尔自治区', '阿克苏地区', '库车县', '新疆维吾尔自治区库车县');
INSERT INTO  s_area_code  VALUES ('3762', '652924', '新疆维吾尔自治区', '阿克苏地区', '沙雅县', '新疆维吾尔自治区沙雅县');
INSERT INTO  s_area_code  VALUES ('3763', '652925', '新疆维吾尔自治区', '阿克苏地区', '新和县', '新疆维吾尔自治区新和县');
INSERT INTO  s_area_code  VALUES ('3764', '652926', '新疆维吾尔自治区', '阿克苏地区', '拜城县', '新疆维吾尔自治区拜城县');
INSERT INTO  s_area_code  VALUES ('3765', '652927', '新疆维吾尔自治区', '阿克苏地区', '乌什县', '新疆维吾尔自治区乌什县');
INSERT INTO  s_area_code  VALUES ('3766', '652928', '新疆维吾尔自治区', '阿克苏地区', '阿瓦提县', '新疆维吾尔自治区阿瓦提县');
INSERT INTO  s_area_code  VALUES ('3767', '652929', '新疆维吾尔自治区', '阿克苏地区', '柯坪县', '新疆维吾尔自治区柯坪县');
INSERT INTO  s_area_code  VALUES ('3768', '653000', '新疆维吾尔自治区', '克孜勒苏柯尔克孜自治州', '', '新疆维吾尔自治区克孜勒苏柯尔克孜自治州');
INSERT INTO  s_area_code  VALUES ('3769', '653001', '新疆维吾尔自治区', '克孜勒苏柯尔克孜自治州', '阿图什市', '新疆维吾尔自治区阿图什市');
INSERT INTO  s_area_code  VALUES ('3770', '653022', '新疆维吾尔自治区', '克孜勒苏柯尔克孜自治州', '阿克陶县', '新疆维吾尔自治区阿克陶县');
INSERT INTO  s_area_code  VALUES ('3771', '653023', '新疆维吾尔自治区', '克孜勒苏柯尔克孜自治州', '阿合奇县', '新疆维吾尔自治区阿合奇县');
INSERT INTO  s_area_code  VALUES ('3772', '653024', '新疆维吾尔自治区', '克孜勒苏柯尔克孜自治州', '乌恰县', '新疆维吾尔自治区乌恰县');
INSERT INTO  s_area_code  VALUES ('3773', '653100', '新疆维吾尔自治区', '喀什地区', '', '新疆维吾尔自治区喀什地区');
INSERT INTO  s_area_code  VALUES ('3774', '653101', '新疆维吾尔自治区', '喀什地区', '喀什市', '新疆维吾尔自治区喀什市');
INSERT INTO  s_area_code  VALUES ('3775', '653121', '新疆维吾尔自治区', '喀什地区', '疏附县', '新疆维吾尔自治区疏附县');
INSERT INTO  s_area_code  VALUES ('3776', '653122', '新疆维吾尔自治区', '喀什地区', '疏勒县', '新疆维吾尔自治区疏勒县');
INSERT INTO  s_area_code  VALUES ('3777', '653123', '新疆维吾尔自治区', '喀什地区', '英吉沙县', '新疆维吾尔自治区英吉沙县');
INSERT INTO  s_area_code  VALUES ('3778', '653124', '新疆维吾尔自治区', '喀什地区', '泽普县', '新疆维吾尔自治区泽普县');
INSERT INTO  s_area_code  VALUES ('3779', '653125', '新疆维吾尔自治区', '喀什地区', '莎车县', '新疆维吾尔自治区莎车县');
INSERT INTO  s_area_code  VALUES ('3780', '653126', '新疆维吾尔自治区', '喀什地区', '叶城县', '新疆维吾尔自治区叶城县');
INSERT INTO  s_area_code  VALUES ('3781', '653127', '新疆维吾尔自治区', '喀什地区', '麦盖提县', '新疆维吾尔自治区麦盖提县');
INSERT INTO  s_area_code  VALUES ('3782', '653128', '新疆维吾尔自治区', '喀什地区', '岳普湖县', '新疆维吾尔自治区岳普湖县');
INSERT INTO  s_area_code  VALUES ('3783', '653129', '新疆维吾尔自治区', '喀什地区', '伽师县', '新疆维吾尔自治区伽师县');
INSERT INTO  s_area_code  VALUES ('3784', '653130', '新疆维吾尔自治区', '喀什地区', '巴楚县', '新疆维吾尔自治区巴楚县');
INSERT INTO  s_area_code  VALUES ('3785', '653131', '新疆维吾尔自治区', '喀什地区', '塔什库尔干塔吉克自治县', '新疆维吾尔自治区塔什库尔干塔吉克自治县');
INSERT INTO  s_area_code  VALUES ('3786', '653200', '新疆维吾尔自治区', '和田地区', '', '新疆维吾尔自治区和田地区');
INSERT INTO  s_area_code  VALUES ('3787', '653201', '新疆维吾尔自治区', '和田地区', '和田市', '新疆维吾尔自治区和田市');
INSERT INTO  s_area_code  VALUES ('3788', '653221', '新疆维吾尔自治区', '和田地区', '和田县', '新疆维吾尔自治区和田县');
INSERT INTO  s_area_code  VALUES ('3789', '653222', '新疆维吾尔自治区', '和田地区', '墨玉县', '新疆维吾尔自治区墨玉县');
INSERT INTO  s_area_code  VALUES ('3790', '653223', '新疆维吾尔自治区', '和田地区', '皮山县', '新疆维吾尔自治区皮山县');
INSERT INTO  s_area_code  VALUES ('3791', '653224', '新疆维吾尔自治区', '和田地区', '洛浦县', '新疆维吾尔自治区洛浦县');
INSERT INTO  s_area_code  VALUES ('3792', '653225', '新疆维吾尔自治区', '和田地区', '策勒县', '新疆维吾尔自治区策勒县');
INSERT INTO  s_area_code  VALUES ('3793', '653226', '新疆维吾尔自治区', '和田地区', '于田县', '新疆维吾尔自治区于田县');
INSERT INTO  s_area_code  VALUES ('3794', '653227', '新疆维吾尔自治区', '和田地区', '民丰县', '新疆维吾尔自治区民丰县');
INSERT INTO  s_area_code  VALUES ('3795', '654000', '新疆维吾尔自治区', '伊犁哈萨克自治州', '', '新疆维吾尔自治区伊犁哈萨克自治州');
INSERT INTO  s_area_code  VALUES ('3796', '654002', '新疆维吾尔自治区', '伊犁哈萨克自治州', '伊宁市', '新疆维吾尔自治区伊宁市');
INSERT INTO  s_area_code  VALUES ('3797', '654003', '新疆维吾尔自治区', '伊犁哈萨克自治州', '奎屯市', '新疆维吾尔自治区奎屯市');
INSERT INTO  s_area_code  VALUES ('3798', '654021', '新疆维吾尔自治区', '伊犁哈萨克自治州', '伊宁县', '新疆维吾尔自治区伊宁县');
INSERT INTO  s_area_code  VALUES ('3799', '654022', '新疆维吾尔自治区', '伊犁哈萨克自治州', '察布查尔锡伯自治县', '新疆维吾尔自治区察布查尔锡伯自治县');
INSERT INTO  s_area_code  VALUES ('3800', '654023', '新疆维吾尔自治区', '伊犁哈萨克自治州', '霍城县', '新疆维吾尔自治区霍城县');
INSERT INTO  s_area_code  VALUES ('3801', '654024', '新疆维吾尔自治区', '伊犁哈萨克自治州', '巩留县', '新疆维吾尔自治区巩留县');
INSERT INTO  s_area_code  VALUES ('3802', '654025', '新疆维吾尔自治区', '伊犁哈萨克自治州', '新源县', '新疆维吾尔自治区新源县');
INSERT INTO  s_area_code  VALUES ('3803', '654026', '新疆维吾尔自治区', '伊犁哈萨克自治州', '昭苏县', '新疆维吾尔自治区昭苏县');
INSERT INTO  s_area_code  VALUES ('3804', '654027', '新疆维吾尔自治区', '伊犁哈萨克自治州', '特克斯县', '新疆维吾尔自治区特克斯县');
INSERT INTO  s_area_code  VALUES ('3805', '654028', '新疆维吾尔自治区', '伊犁哈萨克自治州', '尼勒克县', '新疆维吾尔自治区尼勒克县');
INSERT INTO  s_area_code  VALUES ('3806', '654200', '新疆维吾尔自治区', '塔城地区', '', '新疆维吾尔自治区塔城地区');
INSERT INTO  s_area_code  VALUES ('3807', '654201', '新疆维吾尔自治区', '塔城地区', '塔城市', '新疆维吾尔自治区塔城市');
INSERT INTO  s_area_code  VALUES ('3808', '654202', '新疆维吾尔自治区', '塔城地区', '乌苏市', '新疆维吾尔自治区乌苏市');
INSERT INTO  s_area_code  VALUES ('3809', '654221', '新疆维吾尔自治区', '塔城地区', '额敏县', '新疆维吾尔自治区额敏县');
INSERT INTO  s_area_code  VALUES ('3810', '654223', '新疆维吾尔自治区', '塔城地区', '沙湾县', '新疆维吾尔自治区沙湾县');
INSERT INTO  s_area_code  VALUES ('3811', '654224', '新疆维吾尔自治区', '塔城地区', '托里县', '新疆维吾尔自治区托里县');
INSERT INTO  s_area_code  VALUES ('3812', '654225', '新疆维吾尔自治区', '塔城地区', '裕民县', '新疆维吾尔自治区裕民县');
INSERT INTO  s_area_code  VALUES ('3813', '654226', '新疆维吾尔自治区', '塔城地区', '和布克赛尔蒙古自治县', '新疆维吾尔自治区和布克赛尔蒙古自治县');
INSERT INTO  s_area_code  VALUES ('3814', '654300', '新疆维吾尔自治区', '阿勒泰地区', '', '新疆维吾尔自治区阿勒泰地区');
INSERT INTO  s_area_code  VALUES ('3815', '654301', '新疆维吾尔自治区', '阿勒泰地区', '阿勒泰市', '新疆维吾尔自治区阿勒泰市');
INSERT INTO  s_area_code  VALUES ('3816', '654321', '新疆维吾尔自治区', '阿勒泰地区', '布尔津县', '新疆维吾尔自治区布尔津县');
INSERT INTO  s_area_code  VALUES ('3817', '654322', '新疆维吾尔自治区', '阿勒泰地区', '富蕴县', '新疆维吾尔自治区富蕴县');
INSERT INTO  s_area_code  VALUES ('3818', '654323', '新疆维吾尔自治区', '阿勒泰地区', '福海县', '新疆维吾尔自治区福海县');
INSERT INTO  s_area_code  VALUES ('3819', '654324', '新疆维吾尔自治区', '阿勒泰地区', '哈巴河县', '新疆维吾尔自治区哈巴河县');
INSERT INTO  s_area_code  VALUES ('3820', '654325', '新疆维吾尔自治区', '阿勒泰地区', '青河县', '新疆维吾尔自治区青河县');
INSERT INTO  s_area_code  VALUES ('3821', '654326', '新疆维吾尔自治区', '阿勒泰地区', '吉木乃县', '新疆维吾尔自治区吉木乃县');
INSERT INTO  s_area_code  VALUES ('3822', '659000', '新疆维吾尔自治区', '省直辖行政单位', '', '新疆维吾尔自治区省直辖行政单位');
INSERT INTO  s_area_code  VALUES ('3823', '659001', '新疆维吾尔自治区', '省直辖行政单位', '石河子市', '新疆维吾尔自治区石河子市');
INSERT INTO  s_area_code  VALUES ('3824', '659002', '新疆维吾尔自治区', '省直辖行政单位', '阿拉尔市', '新疆维吾尔自治区阿拉尔市');
INSERT INTO  s_area_code  VALUES ('3825', '659003', '新疆维吾尔自治区', '省直辖行政单位', '图木舒克市', '新疆维吾尔自治区图木舒克市');
INSERT INTO  s_area_code  VALUES ('3826', '659004', '新疆维吾尔自治区', '省直辖行政单位', '五家渠市', '新疆维吾尔自治区五家渠市');
INSERT INTO  s_area_code  VALUES ('3827', '710000', '台湾省', '', '', '台湾省');
INSERT INTO  s_area_code  VALUES ('3828', '810000', '香港特别行政区', '', '', '香港特别行政区');
INSERT INTO  s_area_code  VALUES ('3829', '820000', '澳门特别行政区', '', '', '澳门特别行政区');
